[
    {
        "Titles":"Priti Bhojnagarwala vs State Of Gujarat And Anr. on 4 May, 2001",
        "Court_Name":"Gujarat High Court",
        "Cites":72,
        "Cited_by":2,
        "Doc_url":"https:\/\/indiankanoon.org\/doc\/1943657",
        "Text":"JUDGMENT H.H. Mehta, J.  \n 1. This is a group of 30 Criminal Misc. Applications filed under Section 482 of the Code of Criminal Procedure, 1973 (for short \"CrPC\") by the petitioner-original accused No. 3-Priti Manoj Bhojnagarwala who happens to be the wife of accused No. 2 Manoj Jagdishbhai Bhojnagarwala, with a request to quash and set aside the respective complaints filed by Mr. Priyakant R. Parikh in his individual capacity as well as the Karta of his Hindu Undivided Family and also by his close near relative, as stated in Annexure I which will be a part and parcel of this judgment,  \n \n\n 2. With the consent of the learned Advocates for both the parties, these 30 Criminal Misc. Applications are taken up for final hearing in a group and as the common questions of law and facts are involved in this group of 30 Criminal Misc. Applications, they are disposed of by this one common judgment.  \n 3. Common facts leading to this group of 30 Criminal Misc. Applications in a nutshell are as follows. The facts stated hereinbelow are taken from the complaint of Criminal Case No.3432 of 1998 which is sought to be quashed in (Main) Criminal Misc. Application No. 4188 of 1999.  \n 3.1 The complainant whose complaint is sought to be quashed which is filed as Private Complaint in the Court of the learned Metropolitan Magistrate, Court No. 4, Ahmedabad (who will be referred to hereinafter as the learned Magistrate for the sake of convenience) and as per the complaint of Criminal Case No. 3432 of 1998 which is sought to be quashed by preferring Criminal Misc. Application No. 4188 of 1999, accused No. 1 is Nidhi Investments (Private Firm). Accused Nos. 2 and 3 are the partners in that firm i.e. accused No. 1. Accused No. 2 is a husband of accused No. 3.  \n 3.2. Complainant's sister's daughter has married with one Yogendra Jagdishbhai Bhojnagarwala who happens to be the younger brother of accused No. 2 Manoj Bhojnagarwala and there have been family relations between accused Nos. 2 and 3 and complainant since long. As per the case of complainant, Nidhi Investments (Private Firm) started to function and carry on its business with effect from 27.6.1992.  \n 3.3. As stated in Para 3 of the complaint, accused Nos. 2 and 3 both had jointly represented to the complainant through their good offices of Yogendra Jagdishbhai with whom the daughter of complainant's sister has married as well as their (Manoj and Yogendra's) parents namely Jagdishbhai and Sulochnaben, that Nidhi Investment i.e. accused No. 1 handles all portfolio of shares and finances in the most successful way and the complainant being the relative should entrust both these aspects i.e. portfolios of shares as well as finances\/deposit management to Nidhi Investments and the parents had orally guaranteed safety and security of the same.  \n 3.4. As stated in Para 4 of the complaint, during the period from 20.12.1997 to 10.9.1998, the complainant Mr. Priyakant R. Parikh advanced his deposits to the tune of Rs. 2,03,00,000 by different cheques to the Nidhi Investments. The particulars of aforesaid deposits are stated in Para 4 of the complaint. It is the case of the complainant that a large amount of money was advanced as deposits on various dates, to the accused and accused Nos. 2 and 3 represented to the complainant that all the members of the family are concerned (connected) with Nidhi Investment, and, therefore, accused No. 2 Manoj is authorised to sign as Authorised Signatory, and, therefore, the complainant had no reason to suspect the mala fide of any of the accused.  \n 3.5. As stated in Para 5(a) of the complaint, the accused were paying back the amounts as well as interest to the complainant. As per particulars given in Para 5(A) of the complaint, the accused returned a total amount of Rs. 1,05,00,000\/- towards the principal amount during the period from 4.4.1998 to 16.9.1998 by 12 different items. It is also the case of the complainant that accused have paid in all Rs. 1,02,25,500\/- towards interest to the complainant by different 38 items.  \n 3.6. It is further the case of the complainant that the complainant has advanced an amount of Rs. 2,03,00,000\/- to accused and as against that amount, the complainant has received back a total amount of Rs. 1,17,25,500\/- inclusive of the interest. Thus, the complainant has a right to recover an amount of Rs. 85,74,500\/- from the accused for which the accused has issued different cheques of which particulars are given in Annexure I. As that cheques have been bounced without they being honoured, a notice was issued and the reply was expected from the accused. The complainant received a reply from the accused in vague manner. As per the case of the complainant, by that reply, the accused have attempted to settle the amount of interest paid by them, to the complainant as principal amounts which also establishes on intention of the accused to deceive the complainant by luring him to finance the funds.  \n 3.7. As per the case of the complainant, the deposits were given way back in the year 1997 and accused had agreed to pay the agreed rate of interest on the same because that would be the common procedure of the market.  \n 3.8. Accused are required to pay an amount of Rs. 85,74,500\/- for clearance of debt for which accused have issued various cheques of various dates. Because of the representations of the accused, different cheques of different dates came to be presented by the complainant on particular dates, because of the promises of the accused of arrangement of clearance. One of the cheques issued by the accused is the subject-matter of Criminal Case No. 3432 of 1998 for which the notice dated 5.l 1.1998 has been issued. The complain ant received a vague reply from the accused. By reply, accused have neither admitted their liabilities, nor did they deny the same. It is the case of the complainant that the accused have committed an offence punishable under Section 138 of the Act.  \n 3.9. As stated in Para 7 of the complaint, it is a defence of the accused that Nidhi Investment is a proprietory firm and none of the accused named in the cause title of complaint have nothing to do with that firm. This stand of the accused No. 2 Manoj Bhojnagarwala is highly unreasonable and unacceptable because said Manoj Bhojnagarwala had issued a cheque as an Authorised Signatory of Nidhi Investment. That cheque has been annexed as Annexure A with the complaint.  \n 3.10. The fact that Manoj Bhojnagarwala issued cheques in two different capacities, establishes design of family of accused to cheat the family of the complainant and the complainant himself. As stated in Sub-para 2 of Para 7 of the complaint, the total amount of Rs. 2.5 crores remains outstanding from the family of the accused and the family of the accused has now decided to invite the complainant for legal battle rather than settlement of legal debts because the accused Manoj Bhojnagarwala has conveyed to the complainant that the convictions are hard to be earned and difficult to be implemented. This message has shocked the complainant to the extent that the complainant was required to consult the Advocate for the return of the cheques.  \n 3.11. As stated in Para 9 of the complaint, in all nine numbers of cheques returned with endorsement that accused have failed to make funds available for the clearance of the cheques. For each and every cheque, complainant, therefore, got issued distinct and separate notice calling upon the accused to comply with requirements of Section 138 of the Negotiable Instruments Act, 1881 (for short \"the Act\"). The accused have failed to comply with the notice.  \n 3.12. As stated in Para 10 of the complaint, Section 118 of the Act provides' for presumption of legal dues in event of issuance of the cheque unless specifically denied. It is in this view that accused cannot claim non-compliance to the provisions of the Act and since they cannot claim non-compliance, they are liable for the prosecution under Section 138 of the Act.  \n 3.13. As stated in Para 11 of the complaint, a reply of the accused establishes their intention to misguide even the learned Advocate consulted by them for the purposes of reply. The reply clearly establishes that accused Manoj Bhojnagarwala has not briefed the learned Advocate replying the notice and has not brought to the notice of the learned Advocate a fact that Mr. Manoj Bhojnagarwala has issued the cheque as an Authorised Signatory of Nidhi Investments and on receipt of such reply, on the basis of belief, the complainant has been misled by the-learned Advocate to believe and trust the words of the accused that Nidhi Investment is a private firm. This establishes that the accused are capable of misguiding their own Advocate and are the persons who have misguided their relations namely the complainant and his family members. \n 3.14. As stated in Para 12, Criminal Case No. 3432 of 1998 has been filed for cheque No. 50142 dated 23.10.1998 for Rs. 40,000\/-. That cheque was drawn on the Bank namely Textile Traders Co-operative Bank, New Cloth Market Branch, Ahmedabad. This cheque was deposited by the complainant as per the instruction of the accused and the same has been returned as uncleared because the Bankers of the accused informed the Bankers of the complainant that the accused have failed to arrange for the funds necessary for clearance of the cheque, 3.15. In reply, the accused have nowhere stated as to how and where they will fulfil the promises made by them by issuance of a Negotiable Instrument i.e. cheque. This establishes prima facie an offence punishable under Section 138 of the Act.  \n 3.16. As stated in Para 15 of the complaint, as accused have misguided the complainant, the accused have committed offences of sharing common intention to cheat and\/or abatement to cheat the complainant.  \n 3.17. As stated in Para 16 of the complaint, before filing the complaint, the complaint addressed a legal notice as required by the provisions of the Act to the accused within the time prescribed by the Act. Accused have replied that notice within the time prescribed by the Act. Considering the fact of issuance of the notice and the reply received from the accused, the complainant has stated that the complaint is filed within the time and within the jurisdiction of the Court of the learned Magistrate and the cheques have been issued by accused from the Bankers stationed within the local jurisdiction of the Court of the learned Magistrate.  \n 3.18. The complainant has stated specifically in Para 17 of the complaint that for the purpose of proving the charges levelled against the accused, the complainant wants to examine witnesses cited under caption \"witnesses\", and the complainant has sufficient documentary as well as oral evidence.  \n 3.19. The complainant has cited four witnesses out of which one is the Bankers of the accused. Lastly in a prayer clause i.e. in Para 18, the complainant has requested the learned Magistrate to take up legal proceedings against the accused for offence punishable under Section 138 of the Negotiable Instruments Act as well as the offences punishable under Section 420 read with Section 34 and\/or read with Section 114 of the IPC. The complainant has produced certain documents along with a separate list on the date on which he filed the complaint.  \n 3.20. On filing of this aforesaid private complaint by the complainant in the Court of the learned Magistrate, the learned Magistrate recorded a verification of the complainant as required to be recorded under Section 200 of the Cr.PC. On reading the complaint as a whole together with a verification of complainant on oath, and the documents produced with said complaint, as it appears, the learned Magistrate come to a conclusion that there is a sufficient ground for proceeding and, therefore, he took cognizance of offence punishable under Section 138 of the Act. He passed an order to register the complaint of the complainant as Criminal Case and issue summon against the accused on payment of process fees for securing the presence of accused.  \n 4. As per the arguments of the learned Advocates for both the parties, it appears that in all the complaints which are sought to be quashed by filing different Criminal Misc. Applications in this Court, the accused are the same persons in all the complaints. The complainant is different person in different complaints. That complainant, Mr. Priyakant R. Parikh or his HUF or his very near relatives. In each complaint, cheque and amount are different but the signatory i.e. drawer of the cheque is the common person i.e. accused No. 2 Manoj J, Bhojnagarwala. In some of the cheques, accused No. 2 Manoj has signed as a proprietor of Nidhi Investment and in some of the cheques, he has signed as Authorised Person of Nidhi Investment. Particulars of such different complaints, different cheques, dates and amounts and the status in which accused No. 2 has signed the cheques are reflected in Annexure I which shall be treated as part of this common Judgment.  \n 5. I have heard Mr. K.S. Nanavati, the learned Senior Advocate for the applicants, Mr. H.L. Jani, the learned APP for the State and Mr. M.R. Barot, the learned Senior Advocate for the respondent No. 2-original complainant in respective cases, in detail at length. I have also perused the complaint and documents produced with the complaint.  \n 6. Original accused No. 3-Pritiben Manojbhai Bhojnagarwala has requested this Court to quash the different complaints filed by the original complainant (Mr. Priyakant R. Parikh in his individual capacity as well as Karta of his own HUF and his son and other near relatives), on the ground that on reading the complaint in each case, the facts stated therein do not constitute an offence of which cognizance has been taken by the learned Magistrate. She has advanced some other grounds also for quashing the complaints lodged against her.  \n 7. As these applications are filed under Section 482 of Cr.P.C. it would be profitable to know as to under what circumstances, this High Court can exercise its inherent jurisdiction and for what purpose. Section 482 reads as follows:  \n Section 482 : Saving of inherent powers of High Court.--Nothing in this Code shall be deemed to limit or affect the inherent powers of the High Court to make such orders as may be necessary to give effect to any order under this Code, or to prevent abuse of the process of any Court or otherwise to secure the ends of justice.  \n 8. In case of Janata Dal v. H.S. Chawdhary and Ors., III (1992) CCR 326 (SC) = (1992) 4 SCC 305, the Hon'ble Supreme Court has dealt with Sections 397, 401, 482 of Cr.P.C. In Paras 131, 132 and 137, the Hon'ble Supreme Court has observed as follows:  \n Para 131: \"Section 482 which corresponds to Section 561-A of the old Code and to Section 151 of the Civil Procedure Code proceeds on the same principle and deals with the inherent powers of the High Court. The rule of inherent powers has its source in the maxim \"Quadolex aliquid alicui concedit, concedere videture id sine quo ipsa, ess uon potest\" which means that when the law gives anything to anyone, it gives also all those things without which the thing itself could not exist.\"  \n Para 132 : \"The Criminal Courts are clothed with inherent power to make such orders as may be necessary for the ends of justice. Such power though unrestricted and undefined should not be capriciously or arbitrarily exercised, but should be exercised in appropriate cases, ex debito justitiae to do real and substantial justice for the administration of which alone the Courts exist. The powers possessed by the High Court under Section 482 of the Code are very wide and the very plenitude of the power requires great caution in its exercise. Courts must be careful to see that its decision in exercise of this power is based on sound principles.\"  \n Paras 136 & 137: \"The inherent power under this section can be exercised by the High Court (1) to give effect to any order passed under the Code; or (2) to prevent abuse of the process of any Court; or (3) otherwise to secure, the ends of justice.......\" \n \"The power is not to be resorted to if there is a specific provision in the Code for the redress of the grievance of the aggrieved party. It should not be exercised as against the express bar of law engrafted in any other provision of the Code. The power should not be exercised to stifle a legitimate prosecution. The High Court being the highest Court of a State should normally refrain from giving a premature decision in a case wherein the entire facts are extremely incomplete and hazy, more so when the evidence has not been collected and produced before the Court and the issues involved whether factual or legal are of great magnitude and cannot be seen in their true perspective without sufficient material............\"   \n 9. In case of R.D. Bajaj v. K.P.S. Gill, 1996 Cr.L.J. P. 381 (SC), it has been held as follows:  \n \"The power of quashing a criminal proceeding should be exercised very sparingly and with circumspection and that too in the rarest of rare case, that the Court will not be justified in embarking upon an inquiry as to the reliability or genuineness or otherwise of the allegations made in the FIR or the complaint and that the extra ordinary or inherent powers do not confer an arbitration jurisdiction on the Court to act according to whim or caprice.\"  \n 10. In case of State of Bihar v. Rajendra Agrawalla, 1996 SCC (Cri) 628, the Hon'ble Supreme Court has observed as under :  \n \"The inherent power of the Court under Section 482 of the Code of Criminal Procedure should be very sparingly and cautiously used only when the Court comes to the conclusion that there would be manifest injustice or there would be abuse of the process of the Court, if such power is not exercised. So far as the order of cognizance by a Magistrate is concerned, the inherent power can be exercised when the allegations in the First Information Report or the complaint together with the other materials collected during investigation taken at their face value, do not constitute the offence alleged. At that stage, it is not open for the Court either to sift the evidence or appreciate the evidence and come to the conclusion that no prima facie case is made out.\"  \n 11. Keeping in mind the above legal position, in other words it can be said that if on reading the complaint and documents produced along with complaint, if taken at their face value, constitute the offences alleged and on the basis of such facts, if this Court comes to a conclusion that there would not be any injustice or there would be no abuse of the process of the Court, then powers under Section 482 of Cr.P.C. should not be exercised by this Court at the initial stage or taking cognizance by the learned Magistrate.  \n 12. Here in all these cases, following are the admitted facts for which neither party can agitate :  \n (1) Original accused No. 2 Manoj Bhojnagarwala is the husband of accused No. 3 (present petitioner in all applications);  \n (2) From an account in name of Nidhi Investment, accused No. 3 has issued 30 cheques. That all cheques are signed by accused No. 2 for and on behalf of Nidhi Investment. Meaning thereby, accused No. 2 has not given any cheque in his individual capacity. No doubt, accused No. 2 has signed some of the cheques, out of 30, in his capacity as Proprietor of Nidhi Investment and some of the cheques are signed by him in his capacity as Authorised Person for and on behalf of Nidhi Investment;  \n (3) Respective person in whose favour cheque was issued had presented that cheque in his Bank for realisation and that cheque was bounced and returned with an endorsement \"funds insufficient\";  \n (4) on receipt of such information with regard to bouncing of cheque which he had presented in the Bank for realisation, that person in whose favour that cheque was given by accused No. 2 had addressed a statutory notice under Section 138 of the Act;  \n (5) There is no dispute with regard to receipt of such notice from that person in whose favour that cheque was given (i.e. complainant of respective cases);  \n (6) On receipt of such statutory notice under Section 138 of the Act, accused Nos. 2 and 3 (petitioners) had replied that notice separately;  \n (7) At the fag-end of the arguments, Mr. K.S. Nanavati, learned Senior Advocate for the petitioner has drawn an attention of this Court that present petitioner being original accused No. 3 has replied the notice of the respective complainant and copy thereof is produced in record of Criminal Misc. Application No, 4202 of 1999.  \n (8) There is no dispute with regard to limitation of filing the complaint in the Court of the learned Magistrate from side of any of the accused.  \n (9) There is no dispute with regard to jurisdiction of the Court in which the complainant has filed his complaint against the accused.   \n 13. Mr. K.S. Nanavati, the learned Senior Advocate for the petitioner has argued that accused No. 2 Manoj Bhojnagarwala has issued cheques in his capacity as proprietor, and, therefore, only accused No. 2 can be said to be responsible for bouncing of the cheque. He has further argued that accused No. 3 who happens to be a wife of accused No. 2, is not connected any way with Nidhi Investment i.e. accused No. 1. He has further argued that the learned Magistrate has taken cognizance of offence punishable under Section 138 of the Act, and, therefore, it can be said that accused No. 2 is only responsible for bouncing of the cheque. During the course of arguments, he has further developed his arguments that in case if this Court comes to a conclusion from the documents on record that Nidhi Investment is not a sole ownership of accused No. 2 but it is a firm, then the case of the complainant falls under Section 141(1) of the Act and in that situation, looking to the averments made in the complaint, it is not the case of the complainant that accused No. 3 was \"charge of and \"responsible to and for conduct of the business\" of accused No. 1 -Nidhi Investment.  \n 14. He has further argued that in absence of averments with regard to following two most material ingredients, prima facie, accused No. 3 cannot be held responsible for bouncing of cheque given by accused No. 2:  \n (a) was in charge of; and  \n \n\n (b) was responsible to the Company for the conduct of the business of the Company.    \n 15. He has further argued that in case, this Court comes to a conclusion that there is a prima facie case against the accused No. 1 that it is a Company within the meaning of Explanation (a) below Sub-section (2) of Section 141 of the Act, then the Company can be held guilty of the offence and shall be liable to be proceeded against and punished for an offence punishable under Section 138 of the Act. He was put much stress on aforesaid two ingredients by citing different authorities and argued that in present case, the complainant has not averred anything about accused No. 3 to prima facie show that she \"was in charge of and \"was responsible to Nidhi Investment i.e. accused No. 1\" and for the conduct of the business of said Company. He has tried to strengthen his arguments by citing different authorities on the point with regard to an offence committed by a \"Company\" in different statutes, wherein practically aforesaid two ingredients are necessary to hold \"director\" of such Company responsible. He has cited following authorities on above point:  \n (1) Mahaldaram Tea Estate (Pvt.) Ltd. and Ors. v. D. N. Prodhan and Ors., 1978 LAB IC 898. Case was under Section 14A of the Employees Provident Funds and Miscellaneous Provisions Act, 1952.  \n (2) Anantharamaiah Woollen Factory, Bangalore-26 and Ors. v. State, 1981 LAB IC 538. Case was under Section 14(1)(A) and (1)(B) of the Employees Provident Funds and Miscellaneous Provisions Act, 1952.  \n (3) K.N. Genda and Anr. v. State, Etc., 1982 LAB IC 1777. Case was under Sections 14(1-a) and 14(1)(i) of the Employees Provident Funds and Miscellaneous Provisions Act, 1952.  \n (4) Kailash Kumar Radhakrishna Kanoria and Ors. v. State of Gujarat, 1991 (63) FLR 749. Case was under Section 14A of the Employees Provident Funds and Miscellaneous Provisions Act, 1952.  \n (5) Transport Corporation of India Limited and Ors. v. R.M. Gandhi and Ors., 1991 LAB I.C. 2017. Case was under Section 14A(1) and (2) read with Sections 14(2) and 14A of the Employees Provident Funds and Miscellaneous Provisions Act, 1952.  \n (6) Manibai (Smt.) and Anr. v. State of Maharashtra, AIR 1974 SC 434. Case was under Sections 7-16 read with Section 17(i) of the Prevention of Food Adulteration Act, 1971.  \n (7) G. Atherton & Co. (Pvt) Ltd. and Ors. v. Corporation of Calcutta, 1979 Cr.L.J. 86 (Cal.). Case was under Rule 39 of the Prevention of Food Adulteration Rules, 1955 read with Section 17 of the PF Act, 1954.  \n (8) R. Banerjee and Ors. v. H.D. Dudey and Ors., II (1992) CCR 1 (SC)=AIR 1992 SC 1168. Case was under Section 7(2) read with Section 17(4) of the Prevention of Food Adulteration Act, 1954.  \n (9) Bhanubhai V. Khuti v. P.5. Sharma and Anr., 1993(1) GLH 1. Case was under Section 16(1)-A, (i) read with Section 17 of the P.P. Act, 1954.  \n (10) Sham Sundar and Ors. v. State of Haryana, AIR 1989 SC 1982. Case was under Section 10 of the Essential Commodities Act, 1955.  \n (11) State of Karnakata v. Pratap Chandra and Ors., AIR 1981 SC 872. Case was under Section 18A read with Section 34 of the Drugs and Cosmetics Act, 1940.  \n (12) Bakridan Bibi and Ors. v. State of Bihar, 1973 CrLJ 1328 (Pat.). Case was under Section 28(a) and Section 29 of the Payment of Bonus Act, 1965. \n (13) Siddharth Kejriwal v. Regional Director, ESIC, 1955(1) LLJ (pages 59 to 71 in compilation of authorities supplied for study by this Court), Case was under Sections 85(a) and 86(3) of the Employees State Insurance Act, 1948.  \n (14) Girdhari Lal Gupta v. DM Mehta and Anr., AIR 1971 SC 2162. Case was under Section 23-C(1)(2) of Foreign Exchange Regulations Act, 1947.  \n (15) Kedar Nath Goenka and Ors. v. Superintendent of Central Excise and Ors., 1979 CrLJ 421. Case was under Sections 9(1) and 9-C(1) of the Central Excise and Salt Act.  \n (16) J.R. Grover v. Assistant Director of Enforcement. Directorate of Finance, Jullundur City, 1987 (31) Excise Law Times (P&H) 682. Case was under Sections 8(2), 4, 6 and 8 of the Foreign Exchange Regulations Act, 1973.  \n (17) Adoni Cotton Mills Ltd. and Ors. v. Regional Provident Fund Commissioner and Ors., 1995 Supp. (4) SCC 580. Case was under Sections 14 and 14A of the Employees Provident Funds and Miscellaneous Provisions Act, 1952.   \n Aforesaid all cases may be relevant, if case of the complainant falls under Section 141(1) of the Act because in almost all above cases, the Courts have dealt with aforesaid two important ingredients for holding the Director liable in the case in which Company is an accused. There cannot be any dispute for the principles! of law enunciated in aforesaid cases, and I am of the view that aforesaid authorities will surely be applicable only when case falls under Section 141(1) of the Act and not otherwise.  \n 16. In complaint which is sought to be quashed by accused No. 3, complainant has described as accused No. 1-Nidhi Investment as a firm. As against this, the applicant in Para 4 of memo of her application stated that the petitioner's husband is the sole proprietor of Nidhi Investment, meaning thereby the applicant has come out with a specific case that she is not at all concerned with accused No. 1 firm because that firm is of sole proprietorship of her husband. Thus it is her case that at the best accused No. 2 can be held responsible for bouncing of the cheque because he has issued a cheque drawn on an account maintained by him in name of Nidhi Investment with a Banker for payment.  \n 17. This Court is well aware of the fact that at the time of deciding application under Section 482, Cr.P.C. this Court cannot look into other documentary evidence produced by either of the parties and that this Court has to examine only a complaint and documents produced with the complaint before the Trial Court before the learned Magistrate who took cognizance for issuance of process. In these matters, petitioner has stated certain facts, disowning her liability for bouncing of cheque in memo of her Application which is also supported with her affidavit. The respondent No. 2 i.e. original complainant made his appearance before this Court and filed his reply opposing application of petitioner. It is also supported with his affidavit. He has produced certain documents in support of his affidavit. The petitioner has filed her additional affidavit in form of rejoinder which is at Page 43. She has also produced a copy of Summary Civil Suit Nos. 5507 of 1998 and 5385 of 1998 filed by respondent No. 2 i.e. complainant against three persons named as accused in the complaint and other persons liable and responsible for debt due from Nidhi Investment, to the plaintiff. Respondent No. 2 i.e. original complainant has also filed one additional reply supported with affidavit (at Pages 89 to 101). Along with that additional affidavit in reply, the respondent No. 2 has filed certain documents. Both the parties have referred to affidavits and documents during the course of their arguments. It is a well settled principle of law that all these documents cannot be considered by this Court at this stage and the respective parties can lead that evidence when trial will begin before the Trial Court.  \n 18. As against the contention of complainant that accused No. 1 Nidhi Investment is a private firm and present petitioner i.e. accused No. 3 is a partner in that firm, the petitioner has come out with her case that accused No. 1 is a proprietary firm and is of sole ownership of accused No. 2 only. This Court is required to be prima facie satisfied as to whether in fact accused No. 1 is a sole proprietary firm or a partnership firm and for that purpose some documents are taken into consideration.  \n 19. The respondent No. 2 has produced one certificate dated 16.10.1998 issued by Textile Traders Co-operative Bank Ltd. at Page 117, wherein the Bank has certified that as per the Bank's record, the persons named in that certificate are the partners of M\/s. Nidhi Investment and they maintain current account with that Bank. Names of nine persons are stated to be partners of that M\/s. Nidhi Investment. Name of present petitioner is at Serial No. 6. Name of accused No. 2 Manoj Bhojnagarwala appears at Serial No. 2. Over and above, the respondent No. 1 original complainant has produced a xerox copy of form of application by which current account was opened with Textile Traders Co-operative Bank Ltd. That form is at page 37. It is dated 2.7.1992. In column with regard to constitution, it is stated that it is a joint account. Accused No. 2 and his brother V.K. Bhojnagarwala both have signed that application form. Below it, there are contents with regard to specific specimen signatures-cum-indemnity for collection of funds, etc. Present petitioner is one of the signatory below that column. On Page 38 of that form, there are certain different columns applicable to different types of account holders. Column: A is for individual accounts. Column: B is for joint accounts. Column: C is for sole proprietary accounts and Column: D is for societies, club or similar bodies. On this page 78, accused No. 2 and his younger brother P.N. Bhojnagarwala have signed in Column: B meant for joint account. If it is a case of petitioner that accused No. 1 is of ownership of sole proprietor-accused No. 2, then certainly accused No. 2 would have signed in Column No. B which is specifically meant for sole proprietary accounts, and, therefore, an account in name of Nidhi Investment is a joint account of the persons named in second part of page 37. Page 39 is a copy of Card containing specimen signatures of persons operating current account. Name of present petitioner is stated at Serial. No. 5-Pritidevi Bhojnagarwala. She has given her specimen signature against her name. The account is in the name of Nidhi Investment. The account number is 2900, and, therefore, the complainant has prima facie satisfied that accused No. 1 is not a proprietory concern of sole ownership of accused No. 2, only but from aforesaid documents, it clearly appears that Nidhi Investment is nothing but \"an association of individuals\". As per definition of word \"company\" given in Clause (a) of Explanation below Section 141 of the Act, \"company\" means anybody corporate and includes a firm or other association of individuals. Thus prima facie complainant has satisfied this Court that accused No. 1 is a Company within the meaning given under Clause (a) of Explanation below Section 141 of the Act. At this juncture, it is required to make clear as to what is a status of members of \"Association of individuals\". Definition of \"director\" is given in Sub-clause (b) of Explanation below Section 141 of the Act. In the case of partner of the firm, that partner is a Director, and, therefore, in my view, when association of individuals is considered to be a Company, then individuals of that association are deemed \"directors\".  \n 20. Admittedly, complaint is filed for bouncing of cheque given by accused No. 2 for and on behalf of accused No. 1-Nidhi Investment. In view of legal position with regard to association of individuals, and an individual member of that association, it can be said that accused No. 2 in his capacity as deemed Director issued the cheque in question, to the complainant which ultimately came to be bounced, and, therefore, the offence committed by accused No. 2 in his capacity as deemed Director is an offence committed by \"Association of Individuals\" and same is punishable under Section 141 of the Act. If an offence with regard to dishonour of cheque for insufficiency of funds, etc. is committed by a sole individual, then it is an offence punishable under Section 138 of the Act, and if that offence of dishonour of cheque for insufficiency of funds is committed by a \"Company\", then an offence can be said to have been committed by a Company under Section 141 of the Act. It may fall either under Sub-section (1) or Sub-section (2) of Section 141 of the Act, Looking to Section 141 of the Act, Company can commit an offence of Section 138 of the Act by two different modes. One is described in Sub-section (1) of Section 141 of the Act, whereas another is described in Sub-section (2) of Section 141 of the Act. At this juncture, Section 141 of the Act is required to be taken into consideration. It reads as follows:  \n Section 141 : Offences by companies.--(1) If the person committing an offence under Section 138 is a company, every person who, at the time the offence was committed, was in charge of, and was responsible to the company for the conduct of the business of the company, as well as the company, shall be deemed to be guilty of the offence and shall be liable to be proceeded against and punished accordingly :  \n Provided that nothing contained in this sub-section shall render any person liable to punishment if he proves that the offence was committed without his knowledge, or that he had exercised all due diligence to prevent the commission of such offence.  \n (2) Notwithstanding anything contained in Sub-section (1), where any offence under this Act has been committed by a company and it is proved that the offence has been committed with the consent or connivance of, or is attributable to, any neglect on the part of, any director, manager, secretary or other officer of the company, such director, manager, secretary or other officer shall also be deemed to be guilty of that offence and shall be liable to be proceeded against and punished accordingly.  \n Explanation. : For the purpose of this section- \n (a) \"company\" means any body corporate and includes a firm or other association of individuals; and  \n \n\n (b) \"director\" in relation to a firm, means a partner in the firm.    \n 21. As per Sub-section (1) of Section 141, company as well as every person who at the time when offence was committed was in-charge of and was responsible to the company for conducting of the business of the company shall be liable to be proceeded against and punished accordingly. So if complainant has specifically stated in his complaint that along with company, its director has also committed an offence punishable under Section 138 of the Act, then he is required to state specifically that the persons named as Directors in the complaint were in charge of and were responsible to the company for the conduct of the business. If such type of case under Section 141(1) of the Act is of the complainant, then certainly arguments of Mr. K.S. Nanavati require some consideration. Admittedly, in this case, the complainant has not specifically or impliedly stated that accused Nos. 2 and 3 were in charge of and were responsible to the company for the conduct of the business of Nidhi Investment, and, therefore, arguments of Mr. K.S. Nanavati are more attractive, if complainant's case falls under Section 141(1) of the Act. Even Mr. M.R. Barot, the learned Senior Advocate for the original complainant has tried his level best to cover the case of complainant in Section 141(1) of the Act.  \n 22. Now it is a well settled principle of law that when the learned Magistrate takes a cognizance for an offence, he is taking into consideration the contents of complaint, verification of complainant below the complaint and the documents produced with the complaint, and at the time of taking cognizance, he is required to be satisfied that there is sufficient ground for proceeding. In this case, it appears that he was satisfied for issuance of process under Section 204, Cr.P.C. as he found that there is sufficient ground for proceeding further against the accused. At this stage, it is required to place on record as to what is legal position with regard to such private complaint.  \n 22.1 In case of Halimuddin Ahmad v. Ashoka Cement Ltd., 1976 Cr.LJ 449, it has been held as follows:  \n \"A complainant is not required to set out in the complaint all the evidence in his possession. A complaint is only an allegation of facts which constitute an offence with a view to summoning the accused for trial. It is, therefore, not necessary for a complainant to set out in a complaint all the evidence in his possession\".  \n 22.2 In case of Rajesh Bajaj v. State NCT of Delhi and Ors., II (1999) SLT 523=II (1999) CCR 4 (SC)=1999 (3) SCC 259, it has been held by the Hon'ble Supreme Court as follows:  \n\"It is not necessary that a complainant should verbatim reproduce in the body of his complaint all the ingredients of the offence he is alleging. Nor is it necessary that the complainant should state in so many words that the intention of the accused was dishonest or fraudulent. Splitting up of the definition into different components of the offence to make a meticulous scrutiny, whether all the ingredients have been precisely spelled out in the complaint, is not the need at this stage\". (That is at the stage under Section 482, Cr.P.C.).  \n It is further held that- \n \"If factual foundation for the offence has been laid in the complaint, the Court should not hasten to quash criminal proceedings during investigation stage merely on the premise that one or two ingredients have not been stated with details. For quashing FIR (a step which is permitted only in extremely rarest of rare case), the information in the complaint must be so bereft of even the basic facts which are absolutely necessary for making out the offence\".   \n 22.3 In case of State of West Bengal and Ors. v. Swapan Kumar Guha and Ors., AIR 1982 SC 949, it has been held as follows:  \n \"Whether an offence has been disclosed or not must necessarily depend on the facts and circumstances of each particular case. If on a consideration of the relevant materials, the Court is satisfied that an offence is disclosed, the Court will normally not interfere with the investigation into the offence and will generally allow the investigation in the offence to be completed for collecting materials for proving the offence. If, on the other hand, the Court on a consideration of the relevant materials is satisfied that no offence is disclosed, it will be the duty of the Court to interfere with any investigation and to slop the same to prevent any kind of uncalled for and unnecessary harassment to an individual\".  \n Here in this case, the learned Magistrate, after considering the materials placed before him was satisfied that this was a fit case for issuance of summons under Section 204 Cr.P.C. then this Court should be very slow in disturbing that order of issuance of process.   \n At this stage, it is required to know as to what is meant by words \"cognizance\". In case of Anil Saran v. State of Bihar and Anr., AIR 1996 SC 204, it has been held in Para 4 as follows:  \n \"Though the Code defines \"cognizable offence\" and \"non-cognizable offence\", the word \"cognizance\" has not been defined in the Code. But it is now settled law that the Court takes cognizance of the offence and not the offender. As soon as the Magistrate applies his judicial mind to the offence stated in the complaint or the police report, etc. cognizance is said to have taken cognizance of the offence takes place when the Magistrate takes judicial notice of the offence.\"  \n Here in this case, a legal position with regard to partnership firm is decided, and in Para 7, it has been held as follows:  \n \"Partnership firm is not a legal entity but a legal mode of doing business by all the partners, until the firm is dissolved as per law and the accounts settled, all the partners have dominion in common over the property and funds of the firm. Only after the settlement of accounts and allotment of respective shares, the partner becomes owner of his share.\"  \n Thus the partnership firm is nothing but an association of individuals of which legal position is discussed hereinabove.  \n 23.1 In that case, the appellant was a partner in M\/s. Agjevinath Films along with second respondent and one another third person of that firm had entered into an agreement with the producer, Bhojpuri Film for distribution of one film. One Shiv Prakash, as a complainant on behalf of M\/s. Agjevinath Films lodged the complaint against one another firm M\/s. Sapna Enterprises. That complaint was for offences punishable under Sections 406 and 420, IPC. Subsequently, it came to the knowledge of the complainant that the first accused colluded and conspired by the appellant with another partner Ajit with an intention to defraud 2nd respondent. In that case, it was alleged that the appellant and Ajit induced first accused by conspiracy to illegally obtain the films prepared for themselves and fabricated the documents, and thereby Ajit one of the partners of the first accused firm i.e. M\/s. Sapna Enterprises and the appellant in collusion and in conspiracy with common intention to do mischief committed the offences referred to earlier. The Hon'ble Supreme Court ultimately held in Para 9 that in view of the facts and circumstances, the imputation alleged against the appellant have been done in his capacity as partner of the firm. It is further held that whether offence has been made out and whether he is liable or what are the defences open to him, are not matters at this stage for consideration and it is for the learned Magistrate to proceed with the trial and to deal with the same in accordance with law.  \n 24. No doubt, this case was with regard to Section 204, Cr.PC, but in this case, the Hon'ble Supreme Court has held that at the time of taking cognizance, the defence of accused is not required to be taken into consideration. The learned Magistrate has only to decide as to whether offence is made out or not. The same analogy will be applicable to this application under Section 482, Cr.PC because it is the case of the petitioner that the learned Magistrate has abused the process of law by issuing summons against the accused. Under the circumstances, at this stage, in my view, defence of petitioner is not required to be taken into consideration.  \n 25. In case of Mahavir Prasad Gupta and Anr. v. State of National Capital Territory of Delhi and Ors., VII (2000) SLT 57=IV (2000) CCR 84 (SC)=2000 (8) SCC 115, it has been held as follows:  \n \"The Court would not be justified in embarking upon an inquiry as to the reality or genuineness or otherwise of the allegations made in the FIR or the complaint or as to whether the allegations in the complaint are likely to be established by evidence or not.\"  \n 26. In case of State of Bihar v. Murad Ali Khan and Ors., 1988(4) SCC 655, it has been held the Hon'ble Supreme Court as follows:  \n \"In exercising that jurisdiction, the High Court should not embark upon an enquiry whether the allegations in the complaint are likely to be established by evidence or not. That is the function of the trial Magistrate when the evidence comes before him,\"  \n In this authority, a case of Municipal Corporation of Delhi v. R.K. Rohtagi, 1983(1) SCC 1, has been referred to, wherein it has been held that- \n \"It is, therefore, manifestly cleat that proceedings against an accused in the initial stage can be quashed only if on the face of the complaint or the papers accompanying the same, no offence is constituted. In other words, the test is that taking the allegations and the complaint as they are, without adding or subtracting anything, if no offence is made out, then the High Court will be justified in quashing the complaint in exercise of its powers under Section 482 of the CrPC.\"  \n 27. In case of Medchl Chemicals & Pharma (P.) Ltd. v. Biological E. Ltd. and Ors., II (2000) SLT 414=I (2000) CCR 288 (SC)=2000(3) SCC 269, it has been held as follows:  \n \"Needless to record however ant) it being a settled principle of law that to exercise powers under Section 482 of the Code, the complaint in its entirety shall have to be examined on the basis of the allegation made in the complaint and the High Court at that stage has no authority or jurisdiction to go into the matter or examine its correctness. Whatever appears on the face of the complaint shall be taken into consideration without any critical examination of the same.\"  \n 28. In case of Municipal Corporation of Delhi v. Purshotam Dass Jhunjunwala and Ors., AIR 1983 SC 158, it has been held as follows:  \n \"As to what would be the evidence against the respondents is not a matter to be considered at this stage and would have to be proved at the trial, We have already held that for the purpose of quashing the proceedings only the allegations set forth in the complaint have to be seen and nothing further.\"  \n 29. Keeping in mind the above legal position with regard to complaint to be examined by this Court in the matter under Section 482, CrPC. now I will discuss as to what is the case in complaint and accompanying papers.  \n 30. Admittedly when complainant lodged his private complaint, he produced certain documents with list which is at page 18. If we peruse that list at page 18, we find that complainant has produced about five documents. First is a Bank's Memo dated 30.10.1998 under which cheque was returned to the complainant with a reason of \"funds insufficient\". That is at page 19. Copy of cheque is at page 20. It is dated 23.10.1998, the drawer of which is Nidhi Investment which is signed by accused No. 2 as Proprietor and same is issued for Rs. 40,000\/-. After bouncing of cheque and on receipt of Bank's memo, the complainant addressed a statutory notice under Section 138 of the Act to Nidhi Investment which is a private firm and its Nos. 2 to 7 deemed Directors, one of them is present petitioner and her name is at Serial No. 3. Admittedly, that notice has been received by the petitioner. The complainant has not placed a copy of reply given by present petitioner in reply to complainant's statutory notice under Section 138 of the Act. Mr. Nanavati has drawn an attention of this Court that in Criminal Misc. Application No. 4202 of 1999, the complainant has produced a copy of reply of notice dated 21.11.1998 given by present petitioner to the complainant. It is at pages 30 and 31 in the matter of Criminal Misc. Appln. No. 4202 of 1999.  \n 31. On return of cheque, the drawee i.e. in whose favour that cheque is given, has to address a statutory notice under Section 138 of the Act and on expiry of the prescribed period of limitation, if the drawer of the cheque fails to comply with the directions given in the notice and fails to make the payment of Cheque, then the complainant has no other option except to lodge the complaint in the Court and accordingly, complainant has lodged the complaint. The complainant has produced all necessary documents along with list. The learned Magistrate has examined the complaint, verification and these documents produced with the list and on the basis of this, he has taken cognizance of offence against the present petitioner. Whether there is a prima facie case against the present petitioner or not, this Court is required to examine the complaint and the documents produced at the time of lodging the complaint. Except this, this Court is not expected to examine any other documents produced by the present petitioner in support of her case which is in form of defence. That documents cannot be taken into consideration at this juncture. Under the circumstances, this Court has examined that documents produced with the list and the complaint itself. The notice under Section 138 of the Negotiable Instruments Act is a base of the criminal complaint. The copy of notice is at pages 21 to 25. This notice is given to main accused i.e. private firm namely Nidhi Investment and six deemed Directors, out of which the present petitioner is at Serial No. 3. Notice is addressed to all, including present petitioner (accused No. 3).  \n 31.1 In Para 6 of Notice, the complainant has stated as follows :  \n \"You have borrowed a total deposit to the tune of Rs. 1.39 crores from my client from his personal account as well as from him as Karta of his HUF towards need in your business.\"  \n 31.2 In Para-B of Notice, the complainant has stated as follows :  \n \"After borrowing the deposits, you were regularly paying the interest thereon, at the agreed rate thereof, however, lately your capacity to repay even the interest was becoming objectionable and doubtful. My client, therefore, had no choice but to request you to return the amount to him, along with the interest accrued thereon.\"  \n 31.3 In Para 9 of Notice, it has been stated as follows:  \n \"It might to be brought to your notice at this stage that it is my client Mr. Parikh in his dual capacity and also all his family members have given to you a large sums of deposits and, therefore, they were of course worried about the security of the deposits. \n And, therefore, in the larger interest of my client's family, the deposit amount was requested to be returned.\"   \n 31.4 In Para 10 of Notice, it has been stated as follows:  \n \"You shall recollect that because of the requests of my client for the purposes of repayment of the deposits as well as the interest accrued thereon, you gave him following cheques towards his personal account as well as his HUF account.\"  \n In Para 10 of Notice, it has been further stated as follows:  \n \"You are aware that the above mentioned principal amounts that were advanced to you by my client Mr. Priyakant Parikh from his personal a\/c. as well as Karta of HUF. You are requested as to read TTC as Textile Traders Co-op. Bank and NNSB as Nutan Nagrik Sahakari Bank, and Retd. as date of return of the cheque. This indicates that you had given various cheques towards the return of principal amount to Mr. P.R. Parikh from your Textile Traders Co-op. Bank (described as TTC).\"  \n In Para 10 of Notice, it has been further stated as follows:  \n \"Apart from the principal amount, you were requested to return, you were also requested to settle the balance of interest on the said huge amount of deposit towards which, you gave following cheques.\"  \n xxxx xxxx                                          xxxx \n xxxx                                        xxxx                                          xxxx\n \n\n It has been further stated in Para 10 of Notice as follows:  \n \"......you have accepted by issuance of above referred cheques (Negotiable Instruments), non-payment thereof attracts the provisions of Section 138 of the Negotiable Instruments Act requiring my client to issue a notice to you calling upon you to make the payment within a fortnight from the receipt of this notice.\"  \n 31.5 In Para 15 of Notice, it has been stated as follows:  \n \"You are hereby informed that by issuing the cheques, you have admitted your legal liabilities to repay. The dishonour thereof generates a right to demand the same which is being demanded herewith.\"   \n 32. Above notice is addressed to petitioner also and wherever the word \"you\" is stated in this notice, complainant wants to convey that, that notice was also issued to the present petitioner along with others and whatever transactions are referred to in the notice are the transactions entered into by the petitioner alongwith other deemed Directors.  \n 33. In Criminal Misc. Application No. 4202 of 1999, the reply of present petitioner dated 21.11.1998 is produced by the complainant. She has denied that she was never partner of Nidhi Investment, and she has never taken any money from the complainant and she has never issued any cheque to the complainant. Thus mere denial is there in reply. The Trial Court will consider the averments made in the notice by reading this reply with it. In this reply, the petitioner has advanced her case that by issuing such type of notice, the complainant was bringing pressure on the petitioner alongwith other about deemed five Directors for making payments of dues due, from Nidhi Investment to the complainant.  \n 34. Along with these two documents, now we will read the complaint also wherein the complainant has made averments as follows:  \n In Para 3, it has been stated as follows:  \n \"The complainant stales that said Manoj Jagdishbhai and Pritiben Manojbhai had represented to the complainant through the good offices of Yogendra Jagdishbhai as well as their parents namely Jagdishbhai and Sulochanaben that Nidhi Investments handles the portfolios of shares and finances in the most successful way and the complainant being the relative should entrust both these aspects i.e. portfolio of shares as well as finances\/deposits management to Nidhi Investment and the parents had orally guaranteed the safety and security of the same.\"  \n In Para 4, the complainant has given particulars of cheques given by him to Nidhi Investments.  \n In Para 5, it has been stated as follows:  \n \"This would go to show that a large amount of money was advanced as deposits on various dates to the accused respondent (including present petitioner) who has represented to the complainant that all the members of the family are concerned with Nidhi Investment.\"  \n In Para 5-A, it has been stated as follows:  \n \"It must be stated for and on behalf of the complainant that the accused herein (including petitioner) were paying back amount as well as interest to the complainant and the details thereof are as under\". Particulars of 12 cheques towards principal amount and 38 cheques towards interest are given.\"  \n In Para 6, it has been stated as follows:  \n \"That in the reply, the accused has attempted to settle interest paid by him to the complainant as principal amount which also establishes intention of the accused (including the petitioner) to deceive the complainant by luring him to finance funds..........and the accused has agreed to pay the agreed rate of interest on the same because that would be a common procedure of the market......one of the cheques was issued by the accused (three accused) is the subject-matter of the present issue...........\"  \n In Para 7, it has been stated as follows:  \n \"The accused now begs to submit that Nidhi Investment is a proprietary firm and none of the accused named in the cause title have any thing to do with Nidhi Investment. This stand of the accused Manoj Bhojnagarwala is highly unreasonable and unacceptable because said Manoj Bhojnagarwala has issued a cheque as Authorised signatory of Nidhi Investment.\" \n In Para 9, it has been stated as follows:  \n \"In all, 9 No. of cheques returned with the endorsement that the accused has failed to make the funds available for the clearance of the cheques. For each and every cheque the complainant, therefore, got issued distinct and separate notice calling upon the accused to comply with requirement of the Negotiable Instruments Act. Instead of promising to pay, the accused submitted false statement of the account and replied nothing in regard to the intention of payment.\"  \n In Para 11, it has been specifically pleaded as follows:  \n \"That Nidhi Investment is a private firm,\"  \n In Para 13, it is stated as follows:  \n \"That the accused has failed to arrange for the funds necessary for the clearance of the cheque.\" \n\n 35. If we read above all the averments by giving a cumulative effect, it can safely be said that the offence under Section 138 of the Act has been committed by \"Company\" i.e. accused No. 1 (Association of Individuals), and it has been committed with the consent and connivance of the present petitioner i.e. a deemed Director within the meaning of Clause (b) of Explanation below Section 141 of the Act. Thus, from the complaint, Notice and reply, it is crystal clear that the complainant's case falls under Section 141(2) of the Act. Though Mr. M.R. Barot has not argued on this point, this Court has independently and minutely examined the complaint as well as the documents produced with list at the time of lodging the complaint and after such examination, this Court is fully satisfied that the complainant's case falls under Section 141(2) of the Act. As discussed earlier, Mr. K.S. Nanavati, the learned Senior Advocate for the petitioner has vehemently argued that in view of absence of averments with regard to petitioner \"in charge of' and \"was responsible to the company for the conduct of the business of the company\" in complaint, as well as statutory notice, complaint deserves to be quashed and set aside. His main thrust of the arguments was such that the case of the complainant falls under Section 141(1) of the Act. When this Court has independently examined the complaint and the documents produced with list at the time of lodging the complaint, this Court comes to a conclusion that case falls under Sub-section (2) of Section 141 of the Act. It is interesting to note that what is required to be averred for the Director as expected in Sub-section (1) of Section 141 of the Act is not necessary to be averred for case falling under Section 141(2) of the Act. The opening words of Sub-section (2) of Section 141 of the Act are very much important. They are as follows:  \n \"Notwithstanding anything contained in Sub-section (1)\"  \n Words \"Notwithstanding anything contained in Sub-section (1) do suggest that if case falls under Section 141(2) of the Act, requirements of Sub-section (1) are not at all necessary to be fulfilled by the complainant.  \n Sub-section (2) is to be considered independently without taking into consideration Sub-section (1). When this Court has found that case falls under Sub-section (2) of Section 141 of the Act, the requirements of \"in charge of and \"was responsible to the company for the conduct of the business of the company\" are not at all necessary to be averred in the complainant, and, therefore, from the facts and circumstances of the case and by reading complaint as well as the documents produced with list by the complainant, it is crystal clear that prima facie case is made out by the complainant for issuance of summons under Section 204 of Cr.PC and this Court is of the view that the learned Magistrate has exercised his jurisdiction legally and properly by taking cognizance of offence and not the offender. In view of this, when legal position is clear that when Court finds that prima facie case is made out for issuance of summons, it can be said that there is no abuse of process of law and application under Section 482, Cr.PC cannot be quashed on the basis of arguments advanced by Mr. K.S. Nanavati the learned Senior Advocate for the petitioner, which are mainly on the non-fulfillment of requirements of ingredients stated in Sub-section (1) of Section 141 of the Act.   \n 36. Mr. K.S. Nanavati has placed reliance on following authorities also in support of his arguments on other points :  \n (1) K.P.G. Nair v. Jindal Menthol India Ltd., Vol. 104, Company Cases 290. This authority pertains to Sub-section (1) of Section 141 of the Act. As discussed earlier, case of the complainant falls under Section 141(1) of the Act, and, therefore, this authority is not helpful to petitioner in this case.  \n (2) Municipal Corporation of Delhi v. Ram Kishan Rohtagi and Ors., AIR 1983 SC 67. This authority cited in answer to arguments of Shri M.R. Barot that in case, if the complaint is quashed by this Court, then there should be some specific observation of this Court in judgment with regard to Section 319 of Cr.PC for impleading this present petitioner after the complainant leads evidence against her during the trial. At this stage, this question does not arise because in view of discussions made hereinabove, this Court is not going to quash the complaint. Still, however, the legal position is made clear by the Hon'ble Supreme Court in Paras 18 and 19 of this authority to meet with the requirements in answer to apprehension expressed by Shri Barot, and, therefore, this authority is also not helpful to the petitioner.  \n (3), Municipal Corporation of Delhi v. Purshotam Dass Jhunjunwala and Ors., (supra). In this case, legal position with regard to, Section 17 of the Prevention of Food Adulteration Act, 1954 is made clear. It has with regard to prosecution of Directors of Sugar Mill for manufacturing adulterated milk toffee and in complaint, averments were made giving complete detail of role played by the Directors and extent of liability. Complaint against accused could not be said to be vague and implicating the Directors. The High Court had in exercise of powers under Section 482, Cr.PC quashed the proceedings against the accused. The Hon'ble Supreme Court allowed the appeal filed by the complainant and set aside the order of the High Court. The Hon'ble Supreme Court has discussed Section 17 which is in pari materia with Section 141(1) of the Act. This authority will not be applicable to this present case.  \n (4) Girdhari Lal Gupta v. D.N. Mehta and Anr., (supra). In Para 6 of this authority, Hon'ble Supreme Court has explained as to what is meant by expression \"person in charge of and responsible for the conduct of the affairs of a company\". This authority will not be applicable because case of the complainant falls under Section 141(2) of the Act, and not under Section 141(1) of the Act.  \n (5) Sham Sundar and Ors., v. State of Haryana, (supra). In this case, Section 10(1) of the Essential Commodities Act which is practically in pari materia with Section 141(1) of the Act is discussed. In view of the fact that the averments made by the complainant in complainant as well as in notice which is a base of the complaint, the complainant has made out his case under Section 141(2) of the Act for issuance of the process, and, therefore, this authority will not be helpful to this case.  \n (6) Pepsi Food Ltd. and Anr., v. Special Judicial Magistrate and Ors., VI (1998) SLT 102=IV (1998) CCR 108 (SC)=AIR 1998 SC 128. This authority cited with regard to scope and ambit of Articles 226 and 227 of the Constitution of India and also under Section 482 of the Code. There cannot be any dispute with regard to legal position settled by the Hon'ble Supreme Court in this case. Looking to the facts of this case, the principles laid down in this authority will not be applicable because this Court has arrived at a conclusion which is on the basis of the principles laid down by the Hon'ble Supreme Court in other cases which have been referred to hereinabove, and, therefore, this authority will not be helpful to the present case. \n (7) In case of G. Sagarsuri v. State of U.P., 2000 (2) SCC 636, it has been held that though the Magistrate trying a case has jurisdiction to discharge the accused at any stage of the trial, if he considers the charge to be groundless, but that does not mean that accused cannot approach the High Court under Section 482 of the Code or Article 227 of the Constitution of India. It is also held that to have the proceedings quashed against them, when no offence is being made out against them, still why they must suffer agony of criminal trial. There cannot be any dispute with regard to the legal position settled in this case.  \n During the course of arguments, Mr. Barol has put much emphasis on the ground that accused has right to submit his application for discharge from the case before the Trial Court, and when accused has such right, his application under Section 482, Cr.PC cannot be considered. Arguments of Mr. Barot have not been dealt with in view of this authority and, therefore, when this Court has not decided application under Section 482, Cr.PC on the ground that accused has right to submit application for discharge from the case in the Trial Court, this authority will not be useful to the petitioner.  \n (8) In case of Ashok Chaturvedi and Ors. v. Shitul H. Chanchani and Anr., AIR 1998 SC 2796, there was only an allegation made in the complaint that shares of the complainant have been transferred on forged signatures and there was no iota of material to indicate how all or any of the accused were involved in the alleged forgery. Statement of complainant as well as witnesses were not lending any support, and, therefore, Hon'ble Supreme Court held that order taking cognizance was not proper. In this case, Hon'ble Supreme Court quashed not only cognizance taken by the learned Magistrate of the offence as against seven appellants before it but also against some two officers of the Company who were not the appellants before the Hon'ble Supreme Court. There cannot be any dispute for the legal position settled in this case.   \n 37. Rajesh Bajaj v. State NCT of Delhi and Ors., (supra). This authority is cited in support of arguments of Mr. K.S. Nanavati to the effect that for quashing of FIR, the information in the complainant must be so bereft of even the basic facts which are absolutely necessary for making out the offence. While examining the complaint in this case, this Court has taken into consideration the aforesaid legal position.  \n In this case, Hon' ble Supreme Court, criticising an approach of High Court, by observing that High Court seems to have adopted a strictly hypertechnical approach and sieved the complaint through a cullendar of finest gaizes for testing the ingredients under Section 415, IPC. Such an endeavour may be justified during trial, but certainly not during the stage of investigation. At any rate, it is too premature a stage for the High Court to step in and stall the investigation by declaring that it is a commercial transaction simplicitor wherein no semblance of criminal offence is involved.  \n 38. Sunil Kumar v. Escorts Yamaha Motors Ltd. and Ors., 1999 (8) SCC 468. In this case, accused had given cheque to the complainant. Cheque was bounced. Complainant lodged FIR for offences punishable under Sections 420, 406 and 468, IPC alleging that accused by an Act of conspiracy committed criminal breach of trust by presenting for encashment blank cheques signed by the accused for the purpose other than that for which a cheque had been given to the complainant, and, therefore, causing to the complainant loss of certain amount. Apart from this fact, the said allegations do not make out offence of cheating and criminal breach of trust. There were attendant circumstances indicating that FIR was lodged to preempt the filing of complaint under Section 138 of the Negotiable Instruments Act against the accused. In such circumstances, the Hon'ble Supreme Court held that High Court was well within the jurisdiction to quash the FIR as amounting to abuse to process of Court.  \n 39. During the course of arguments, without prejudice to the merits of the case, this Court had suggested both the parties to examine the possibility of remanding the complaint with certain directions to the complainant to lodge further better materials so as to enable the learned Magistrate to come to a right conclusion for taking a decision either under Section 203, Cr.PC or Section 204, Cr.PC. Mr. K.S. Nanavati, the learned Sr. Advocate for the petitioner submitted that if that recourse is taken by this Court, then the complaint will be inquired under Section 202, Cr.PC and in that circumstances, the petitioner will not have any chance for advancing her defence before the learned Magistrate who can take a decision either way under Section 203, Cr.PC or under Section 204, Cr.PC, He has submitted that the petitioner will not have any locus standi to appear before the learned Magistrate when the learned Magistrate will hold an inquiry under Section 202, Cr.PC in the matter of complaint and in support of that submission, he has cited an authority of Chandra Deo Singh v. Prakash Chandra Bose, alias Chabil Bose and Anr., AIR 1963 SC 1430. Looking to the legal position settled in this case, question does not arise for this Court to remand the complaint to the learned Magistrate for holding an inquiry under Section 202, Cr.PC. and, therefore, suggestion made by this Court requires to be withdrawn in view of the facts of the case, and accordingly suggestion is dropped by this Court.  \n 40. In view of what is discussed hereinabove, in short the case of the complainant squarely falls under Section 141(2) read with Section 138 of the Negotiable Instruments Act. There are averments in the complaint for making out a prima facie case under Section 141(2) of the Act for taking cognizance by the learned Magistrate. The learned Magistrate has rightly taken the cognizance of an offence under Section 138 of the Act committed by the Company and, therefore, in no case, it can be said that by taking cognizance against the accused for the offence stated in the complaint, the learned Magistrate has abused the process of his Court, and, therefore, the applications under Section 482, Cr.PC are devoid of merits and the same require to be dismissed outright, on merits. Accordingly, 30 (thirty) Criminal Misc. Applications filed under Section 482, Cr.PC by the present petitioner i.e. accused No, 3 in respective complaints filed by the respective complainants are dismissed by this one common judgment, because as these 30 Criminal Misc. Applications are decided in a group as jointly requested by the learned Advocates for both the parties. Rule issued in each Criminal Misc. Application shall stand discharged. Interim relief granted earlier and which had been extended from time-to-time till this date in each case shall stand vacated forthwith. The learned Magistrate be informed\\of accordingly without any further delay.  \nSd\/-  \n(H.H. Mehta, J.) Mr. R.S. Sanjanwala, learned Advocate for the petitioner in all matters requests this Court to continue interim relief granted earlier to move the higher forum. In view of the facts and circumstances of this present matters and in view of the legal position settled by this Hon'ble Court as well as the Apex Court, interim relief as prayed for is refused.  \n Annexure I Continuation of CAV Judgment in CR.MR. No. 4188 of 1999 and other 29 matters.  \nSr.No. \n\nCr. MA. No. u\/s. 482 of Cr. PC before the High Court. \n\nCriminal Case No. beore the Trial Court. \n\nComplainant Accused Cheque No. Accused No.2 Manoj B. \n\n Bhojnagar-wala signed the cheque as Amount of cheque. \n\n(Rs.)\n  \n \n  \n   \n   \n\n1. 4188\/99 3431\/98 Shri Priyakant R. Parikh\n  \n   \n   \n\n1. Nidhi Investment (Firm). \n\n050142 Proprietor 40,000.00 2, Mr. Munoj J. Bhojnagar wala. \n\n23.10.1988\n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n \n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n   \n   \n\n3. Mrs. Priti Manoj Bhojnagar-wala\n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n \n  \n   \n   \n\n2. 4189\/99 3433\/99\n  \n   \n   \n\n-do-\n-do-\n50131\n  \n   \n   \n\n-do-\n11,00.000.00 14.10.1998\n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n \n  \n   \n   \n\n3. 4190\/99 3434\/98\n  \n   \n   \n\n-do-\n-do-\n50141\n  \n   \n   \n\n-do-\n20,00.000.00 23.10.1998\n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n \n  \n   \n   \n\n4. 4191\/99 3435\/98\n  \n   \n   \n\n-do-\n-do-\n50138\n  \n   \n   \n\n-do-\n60,000.00 23.10.1998\n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n \n  \n   \n   \n\n5. 4192\/99 3436\/98\n  \n   \n   \n\n-do-\n-do-\n50133\n  \n   \n   \n\n-do-\n20.00,000.00 14.10.1998\n  \n   \n   \n\n \n  \n   \n   \n\n \n  \n \n  \n   \n   \n\n6. 4193\/99 3437\/98\n  \n   \n   \n\n-do-\n-do-\n50137 23.10.1998\n  \n   \n   \n\n-do-\n30,00,000.00\n  \n \n  \n   \n   \n\n7. 4194\/99 3438\/98\n  \n   \n   \n\n-do-\n-do-\n5013.4 14.10.1998\n  \n   \n   \n\n-do-\n40,000.00\n  \n \n  \n   \n   \n\n8. 4195\/99 3439\/98\n  \n   \n   \n\n-do-\n-do. \n\n44715 20.09.1998 Authorised Person 25,00,000.00\n  \n \n  \n   \n   \n\n9. 4196\/99 3440\/98\n  \n   \n   \n\n-do-\n-do-\n44705 01.09.1998\n  \n   \n   \n\n-do-\n20,00,000.00\n  \n \n  \n   \n   \n\n10. 4197\/99 3442\/98\n  \n   \n   \n\n-do-\n-do-\n5014330.10.1998 Proprietor 5,00.000.00\n  \n \n  \n   \n   \n\n11. 4198\/99 3443\/98\n  \n   \n   \n\n-do-\n-do-\n44707 02.09.1998 Authorised Person 5,00,000.00\n  \n \n  \n   \n   \n\n12. 4199\/99 3444\/98\n  \n   \n   \n\n-do-\n-do-\n45983 27.09.1998\n  \n   \n   \n\n-do-\n60,000.00\n  \n \n  \n   \n   \n\n13. 4200\/99 3445\/98\n  \n   \n   \n\n-do-\n-do-\n50144 30.10.1998 Proprietor 3,00,000.00\n  \n \n  \n   \n   \n\n14. 4201\/99 3449\/98 Jayesh J. Purikh\n  \n   \n   \n\n-do-\n52717 Authorised Person 1,00,000.00\n  \n \n  \n   \n   \n\n15. 4202\/99 3450\/98\n  \n   \n   \n\n-do-\n-do-\n45977\n  \n   \n   \n\n-do-\n1.00.000.00 16, 4203\/99 3451\/98\n  \n   \n   \n\n-do-\n-do-\n52730\n  \n   \n   \n\n-do-\n1,00,000.00\n  \n \n  \n   \n   \n\n17. 4204\/99 3452\/98\n  \n   \n   \n\n-do-\n-do-\n52716\n  \n   \n   \n\n-do-\n50,00,000.00 IS. \n\n4205\/99 3453\/98\n  \n   \n   \n\n-do-\n-do-\n52718\n  \n   \n   \n\n-do-\n25,00,000.00\n  \n \n  \n   \n   \n\n19. 4206\/99 3454\/98\n  \n   \n   \n\n-do-\n-do-\n52719\n  \n   \n   \n\n-do-\n50,000.00\n  \n \n  \n   \n   \n\n20. 4207\/99 3455\/98\n  \n   \n   \n\n-do-\n-do-\n52731\n  \n   \n   \n\n-do-\n50.000.00\n  \n \n  \n   \n   \n\n21. 4208\/99 3456\/98\n  \n   \n   \n\n-do-\n-do-\n52714\n  \n   \n   \n\n-do-\n20,00,000.00\n  \n \n  \n   \n   \n\n22. 4209\/99 3457\/98\n  \n   \n   \n\n-do-\n-do-\n52715\n  \n   \n   \n\n-do-\n40,000.00\n  \n \n  \n   \n   \n\n23. 4210\/99 3458\/98 Rajan Priyakant Parikh\n  \n   \n   \n\n-do-\n50139 23.10.1998 Proprietary 5,00,000.00\n  \n \n  \n   \n   \n\n24. 4211\/99 3459\/98\n  \n   \n   \n\n-do-\n-do-\n50140 23.10.1998\n  \n   \n   \n\n-do-\n10.000.00\n  \n \n  \n   \n   \n\n25. 4212\/99 3460\/98 RudhikaPriyakant Parikh\n  \n   \n   \n\n-do-\n45992 4.10.1998 Authorised Pereoti 10,000.00\n  \n \n  \n   \n   \n\n26. 4213\/99 3462\/98\n  \n   \n   \n\n-do-\n-do-\n52720 30.10.1998 Proprietor 5,00,000.00\n  \n \n  \n   \n   \n\n27. 4214\/99 3461\/98\n  \n   \n   \n\n-do-\n-do-\n50136 14.10.1998 Authorised Person 10,000.00\n  \n \n  \n   \n   \n\n28. 4215\/99 3463\/98\n  \n   \n   \n\n-do-\n-do-\n50135 14.10.1998 Proprietor 5,00,000.00\n  \n \n  \n   \n   \n\n29. 4216\/99 3464\/98\n  \n   \n   \n\n-do-\n-do-\n52721 30.10.1998 Authorised Person 10,000.00\n  \n \n  \n   \n   \n\n30. 3969\/99 3441\/98 Priyakant R. Parikh\n  \n   \n   \n\n-do-\n50132 14.10.1998\n  \n   \n   \n\n-do-\n22,000.00",
        "Doc_size":75823,
        "Case_Type":"Criminal",
        "Court_Type":"High_Court",
        "Court_Name_Normalized":"Gujarat High Court"
    },
    {
        "Titles":"Soni Natverlal Prabhudas And Anr. vs State Of Gujarat And Ors. on 31 January, 1983",
        "Court_Name":"Gujarat High Court",
        "Cites":34,
        "Cited_by":2,
        "Doc_url":"https:\/\/indiankanoon.org\/doc\/672946",
        "Text":"ORDER D.H. Shukla, J. \n\n1. The petitioner No. 1. Soni Natverlal Prabhudas, is an elder brother of petitioner No. 2 Soni Jinabhai alias Hasmukhlal Prabhu-das, who has been added as petitioner No. 2 during I he pendency of this application, vide order dated 22-3-1982. The petitioner No. 2 had purchased, allegedly in good faith, a golden chain weighing 1 Tola and 10 annas for Rs 2840\/- (rupees two thousand eight hundred forty only at his aforesaid shop at Viramgam in the afternoon on 22-2-1982 from a person who introduced himself to be belonging to village Panar, Taluka Viramgam, which is at a distance of about 10 Kms. from Viramgam. The petitioner No. 2 had no reason whatever to suspect the said property to be a stolen one at the time of the aforesaid purchase. It is alleged that petitioner No. 2 paid a reasonable market price for the said property as stated above. \n\n 2. to 4. * * * * * \n \n\n5. This application was presented by the petitioner No. 1 on 19-3-1982 while the petitioner No. 2 was in Police custody on account of the aforesaid remand order. It is submitted that the arrest of the petitioner No. 2 was not only illegal, unconstitutional and without jurisdiction. but the same was also mala fide. Hence, this application was originally filed by the petitioner No. 1 to challenge the propriety, legality, constitutionality, correctness and validity of the arrest of the petitioner No. 2 as well as the subsequent order of remand to the Police custody passed by the respondent No. 5. As pointed out earlier, the petitioner No. 2 has been added as a party later by an amendment order dated 22-3-1982 as by that time the respondent No. 5 had rejected the request of the investigating agency for further remand of accused No. 2 and as consequently accused No. 2 was released from the custody. \n\n6. The application is filed under Articles 226 and 227 of the Constitution of India for the enforcement of the fundamental right under Articles 21 and 22(1) of the Constitution of India and statutory right under Section 50(1) of the Criminal Procedure Code, it is filed on the basis of the following main contentions:\n1. The respondent Nos. 3 and 4 have acted mala fide as the petitioner No. 2 refused to satisfy the demand for illegal gratification of Rs 5,000\/- made by the respondents Nos. 3 and 4 in the Police Station at Viramgam on 16th March, 1982. \n\n2. The petitioner No. 2 was arrested in contravention and deliberate disregard of the constitutional mandates as embodied in Articles 21 and 22(1) of the Constitution of India and Section 50(1) read with Section 167(4) of the Criminal Procedure Code. Article 21 of the Constitution states that no person shall be deprived of his life or personal liberty except according to procedure established by law and Article 22(1) says that no person who is arrested shall be detained in custody without being informed as soon as may be of the grounds for such arrest nor shall he be denied the right to consult and to be defended by a legal practitioner of his choice. Section 50(1) of the Criminal Procedure Code enjoins that every Police Officer or other person arresting any person without warrant shall forthwith communicate to him full perticulars of the offence for which he is arrested or other grounds of such arrest. These provisions are enacted as a matter of abundant caution to safeguard the rights and liberty of the accused persons against whom ex parte material is collected during the police investigation and who are arrested on the strength of such material so as to enable them to know at the initial stage as to why they are arrested and also to consult a legal practitioner of their choice. It is submitted that provision of Section 50. Criminal Procedure Code is a new one added on the recommendation of the Joint Committee. Its provisions are material and cannot be overlooked. It brings the law in conformity with the provisions of Art'cle 22(1) of the Constitution of India enabling the person arrested to move for Habeas Corpus to obtain his release. The Section confers a valuable right and non-conformance to its mandatory provisions is a non-conformance to the procedure established by law. It is further submitted that a citizen's liberty cannot be curtailed except in accordance with the law. When a person arrested without warrant alleges by affidavit that he was not communicated with full particulars of the offence leading to his arrest, in the face of such an affidavit the Police diary cannot be perused to verify the police Officer's claim of oral intimation of such particulars. Even if such oral communication was made, \"whether full particulars were communicated not being known,\" the arrest and detention of the person must be termed illegal. These submissions are made on the basis of the reported ruling of the High Court of Calcutta in the case of Govind Prasad v. State of West Bengal, reported in 1975 Cri LJ 1249 and of the High Court of Gauhati in the case of Ajitkumar v. State of Assam reported in 1976 Cri LJ 1303. \n\n3. It is further submitted that in our country, majority of population is absolutely illiterate and unaware of its fundamental and legal rights. It is, therefore, the duty of those who are exercising public power to be extra careful in seeing that no public power is abused or misused ince all powers are intended to serve the ends of justice and not to defeat the same. \n\n4. The impugned action of the respondents. Nos. 2, 3 and 4 is without jurisdiction, inasmuch as the original complaint was filed at the Bavlu Police Station and therefore the respondent Nos. 2. 3 and 4 had no jurisdiction to carry out the investigation of the complaint filed at Bavlu Police Station and hence the search, seizure and arrest are illegal. \n\n5. The petitioner No. 2 was a bona fide purchaser for value without notice and there was no material whatever with the Investigating Officer to connect the petitioner No. 2 with the offence alleged in the complaint filed at Bavlu Police Station regarding theft of ornaments. Thus, there was no reasonable ground whatever for the search, seizure and arrest of the petitioner No. 2. \n\n6. The order of remand passed by the respondent No. 5 at 1,30 p. m. 17-3-1982 at Kadi is also illegal as the order does not comply with Section 167 of the Criminal Procedure Code. The respondent No. 5 has not recorded convincing reasons for granting remand of petitioner No. 2 to Police, The reasons recorded by him are imply the semblance of reasons. Respondent No 5 has not considered the specific grounds justifying the exercise of powers under Section 167 of the Criminal Procedure Code. The order is per functory and has resulted into prejudice to the petitioner No. 2 and miscarriage of justice. \n\n7. The petitioners have challenged the search and seizure made by the respondents Nos. 2, 3 and 4 as being illegal, having been against the relevant provisions of the Criminal Procedure Code, namely Sections 165, 166 in regard to the search and Sees. 94, 165 and 166 in regard to seizure. \n\n8. In the end, petitioners have challenged the entire investigation carried out by the Police against petitioner No. 2 as having been illegal and in violation of the provisions for investigation made under Sections 154 to 173 of the Criminal Procedure Code. \n\n 7. to 21. * * * * *\n \n\n22. The gravamen of Mr. Barot's attack on the investigation was that the investigation is initiated against petitioner No. 2 and is carried out of mala fides. \n\n     *     *       *\n \n\n23. The case of mala fides has been dealt with in detail by respondent No. 4 in his affidavit-in-reply.)   *    *     *.\n \n\n24. Mr. Mehta further submitted that at the stage of investigation, the question of mala fides may not be gone into. The matter is sub judice because a private complaint is filed against respondent No. 4. He further submitted that investigation is an independent agency and the Court would interfere only when there, was gross abuse of power. An irregularity here or there during investigation would not necessarily imply mala fides on the part of the Investigating Officers. Mr. Mehta submitted that if the matter is considered in the light of the allegations made by the petitioners and replies given by responsible police Officers in their respective affidavits-in-reply, a question arises whether such a situation has arisen which would call for intervention by the High Court at the stage of investigation. He further submitted that by the time the petition is heard, petitioner No. 2 is already released on bail and therefore are not the questions of illegal arrest and the illegal remand order academic and cannot these questions be considered at the time of the trial of the petitioner No. 2 and the trial of respondent No. 4 in the private complaint? If we decide these questions at this stage, would not the judicial proceedings be prejudiced? Mr. Mehta submitted two authorities for my consideration and they are the case of Madhu Limaye AIR 1969 SC 1014 : l969 Cri LJ 1440 and the case of State of Bihar v. J.A.C Saldanna . \n\n25. The Supreme Court in the case of Madhu Limaye (supra) has observed as under (at d. 1445):\n We have been pressed to decide the question of mala fides which is the fourth contention of Madhu Limaye. Normally such matters are not gone into by this Court in these proceedings and can be more appropriately agitated in such other legal action as he may be advised to institute or take. \n26. D. A Desai J., speaking for the Bench in the case of State of Bihar v. J.A.C. Saldanna (supra) observed at page 337 of AIR : Pp. 109, 110 of Cri LJ as under:. \n\n There is a clear-cut and well demarcated sphere of activity in the field of crime detection and crime punishment. Investigation of an offence is the field exclusively reserved for the executive through the police department, the superintendence over which vests in the State Government. The executive which is charged with a duty to keep vigilance over law and order situation is obliged to prevent crime and if an offence is alleged to have been committed it is its bounden duty to investigate into the offence and bring the offender to book. Once it investigates and finds an offence having been committed it is its duty to collect evidence for the purpose of proving the offence ....There is thus a well defined and well demarcated function in the field of crime detection and its subsequent adjudication between the Police and the Magistrate. \nDesai J. has quoted from a Privy council case reported in (1944) 71 Ind. App. 203 at page 213: (1945-46 Cri LJ 413 at P. 417) (King Emperor v. Khwaja Nazir Ahmad) as under :\n In India as has been shown, there is a statutory right on the part of the Police to investigate the circumstances of an alleged cognizable crime without requiring any authority from the judicial authorities and it would, as their Lordships think, be an unfortunate result if it should be held possible to interfere with those statutory rights by an exercise of the inherent jurisdiction of the Court. The functions of the judiciary and the, police are complementary, not overlapping, and the combination of individual liberty with a due observance of law and order is only to be obtained by leaving each to exercise its own function, always, of course, subject to the right of the Court to intervene in an appropriate case when moved under Section 491 of the Criminal Procedure Code to give directions in the nature of habeas corpus.... \n\nDesai J., further observed as under Cat p 111 of Cri LJ:\n The High Court in exercise of the extraordinary jurisdiction committed a grave error by making observations on seriously disputed questions of facts taking its cue from affidavits which in such a situation would hardly provide any reliable material; In our opinion the High Court was clearly in error in giving the direction virtually amounting to a mandamus to close the case before the investigation is complete. We say no more. \n27. These observations are a caveat in the present proceedings. It is hazardous to come to any conclusion on a serious question of the allegations of mala fides against the investigating officers in the circumstances of the present case outlined above, only on the strength of affidavits. \n\n28. The next important allegation which is made by Mr. N. K. Barot is that respondents Nos. 2 to 4 have acted without jurisdiction. He submitted that considering the relevant provisions of the Criminal Procedure Code, and particularly Section 156(1) thereof, respondent No. 4 could not have entered investigation and therefore whatever he did or caused to be done was without jurisdiction. if he was working under the instructions of his superior officer, as alleged, even then his superior officer could not have authorised him to undertake investigation of any case which was; not within the jurisdiction of respondent No. 4. In order to appreciate the argument of Mr. N.K. Barot. I shall reproduce Section 156(1) of the Criminal Procedure Code, which is as under:\n 156 (1) Any officer in charge of a police station may, without the order of a Magistrate, investigate any cognizable case which a Court having jurisdiction over the local area within the limits of such station would have power to inquire into or try under the provisions of Chapter XIII. \nMr. Barot's argument was two-fold. He submitted that this case would have been investigated only by P S. I. Bavlu Police Station in whose jurisdiction the offence was commit led. Respondent No. 4 may have been an officer superior to P. S. I. Bavlu Station. Nevertheless, respondent No. 4 did not have jurisdiction under Section 156(1) of the Criminal Procedure Code to investigate the case in question. \n\n29. Assuming that Section 36 of the Criminal Procedure code applied to the present case, even then respondent No. 4 did not have territorial jurisdiction to investigate the case in question. \n\n30. In order to meet with this argument of Mr. Barot, Mr. J.U. Mehta invited my attention to the provisions of Section 36 of the Criminal Procedure Code read with Section 156(2) thereof. Section 36 of the Criminal Procedure Code reads as under:\n 36. Police Officers superior in rank to an officer in charge of a police station may exercise the same power, throughout the local area to which they are appointed, as may be exercised by such officer within the limits of his station. \nMr Mehta submitted that Section 36 of the Criminal Procedure Code clearly meets with the first plank of Mr. Barot's argument, it is not in dispute that respondent NO\". 4 was a Police Officer superior in rank to the Officer in charge of a Police Station at Bavlu. Respondent No. 4. therefore, it was submitted, was completely justified in exercising the power which could have been exercised by P. S I., Bavlu Police Station and this he had acted within his jurisdiction while investigating the case in question. In my opinion, Mr. Mehta's submission is quite correct and Section 36 protect respondent No. 4 in his undertaking the investigation of the ease in question. \n\n31. So far as the second plank of Mr. Barot's argument is concerned, the provision made in Section 156(2) of the Criminal Procedure Code again protects respondent No. 4. Section 156(2) of the Criminal Procedure Code reads as under :\n 156. (2) No proceeding of a police officer in any such case shall at any stage be called in question on the ground that the case was one which such officer was not empowered under this section to investigate. \nSection 156(2) of the Criminal Procedure Code is a reply to Mr. N.K. Barot's challenge to the territorial jurisdiction of respondent No. 4. I do not propose to examine this question at great length since the issue raised by Mr. Barot is squarely dealt with and decided by Brother S B. Majmudar J, in Liladesitade Pavaiya v. State reported in 1982 (2) 23 Guj LR 734 : 1983 Cri LJ 934. A young boy was enticed away by the accused to Baranpura in Baroda where eunuchs were staying. After some time the boy was taken to Kalol. There, the other accused persons cut off the private part of the boy by a weapon like small sword. After the complainant regained consciousness, he was brought back to Baroda. The complainant alleged that the entire incident had happened because of his ignorance and m:nor age, and now he was made to live in a form of a eunuch. The complaint was first filed at Chhot-audepur from which it was transferred to Karelibag Police Station, Baroda where the officer-in-charge started investigation as the alleged offences were cognizable in nature The petitioners-accused Nos. 3 to 5 urged to the High Court that the Karelibag police Station had no authority or jurisdiction whatsoever to investigate the alleged offence under Section 156(1) of the Criminal Procedure Code, It was submitted that the offence of forcible emasculation which at -the highest may constitute an offence under Section 326 read with Sections 506 and 114 of the Indian Penal Code, was alleged to have been committed at Kalol. Therefore the investigation against the petitioners being carried on was contrary to law and therefore 1 he petitioners were entitled to get their fundamental rights under Article 21 enforced by issuance of a proper writ against the investigating agency. It was held that prima facie the offence of emasculation ' alleged to have been committed in Kalol in Mehsana Dist, was part and parcel of a common design and are components of the same transaction and the castration of the concerned victim was done with a view to make him an eunuch who could be a useful addition to their class of professional beggars. The relevant averments in the complaint clearly indicated that various offences were alleged to have been committed by different concerned accused as part and parcel of a comprehensive one and the same transaction. It was held under the circumstances of the case that the Criminal Court at Baroda had ample jurisdiction to try the offences alleged against the concerned accused. In the course of the judgment. Brother Majmudar J. observed as regards Sub-section (2) of Section 156 of the Cr. P.C. in the following terms:\n Sub-section (2) of Section 156 of the Criminal Procedure Code in terms lays down that no proceedings of Police Officer in any such case can be called in question on the ground that such officer was not empowered under this Sub-section to investigate. The legislature has used wider word 'police Officer' meaning thereby that immunity is. sought to be given to the investigating proceeding initiated by any police officer, which in its turn would include even an Officer incharge of the Police Station, and this immunitive which states that such investigation shall not be called in question on the ground that the case was one which such officer was not empowered under this section to investigate.... The net result, therefore, is that even assuming that a police officer in charge of a Police Station seeks to investigate into an offence which is beyond his territorial jurisdiction or alternatively, an Officer other than the Officer in charge of the Police Station seeks to investigate into the offence which otherwise falls within the territorial jurisdiction of the said police station, in either case, Section 156(2) immunises this investigation against any possible attack on the ground of absence of power with the concerned investigating officer. \nHe further observed as under:\n If the legislature in its wisdom has insulated inquiries and trials before the criminal Courts against the attacks on the ground of absence of territorial jurisdiction, save and except in a given contingency where failure of justice and material prejudice are demonstrated, it would be too much to hold that at prior stage of investigation a police officer who is investigating into the offence which does not fall within his territorial jurisdiction, would be required to be totally prohibited from proceeding with investigation on the ground that some of the offences into which he is investigating fall outside the ambit of his local jurisdiction. \nBrother Majumdar J. has thoroughly scrutinized the question of applicability of Section 156(2) of the Criminal Procedure Code and I do not want to add to my judgment by travelling on the same ground. Suffice it to say that i am in agreement with the view taken by him. \n\n32. Thus. Section 36 and Section 156(2) of the Criminal Procedure Code meet with Mr. Baro's challenge that respondent No. 4 has acted without jurisdiction. \n\n33. Mr. Barot also assailed the jurisdiction of respondent No. 2 and respondent No. 3 in assisting respondent No. 4 in carrying out the investigation against petitioner No. 2. This challenge of his is| met will by the State by resorting to Section 64 of the Bombay Police Act which defines duties of a Police Officer. \n\n64. It shall be the duty of every Police Officer:\n   x    x    x   x   x    x    x\n \n\n(e) to aid another police Officer when called on by him or in case of need in the discharge of his duty, in such ways as would be lawful and reasonable, on the part of the officer aided.\n \n\nIn this connection, the affidavit of respondent No. 4 may again be perused wherein respondent No. 4 has stated as under:\n I say that having received the information about the theft committed in this case, my superior instructed me to make a thorough investigation of this case with the help of respondent No. 3. I, therefore, further investigated into the matter and could trace the accused in the present case with the help of the respondents Nos. 2 and 3. \n \n\n Respondent No. 2 has stated in his affidavit-in-reply as under :\n I say that I assisted in the investigation as per the demand of the respondent No. 4 and I only assisted him in the investigation. I. have done nothing more than that. \n \n\nRespondent No. 3 has stated in his affidavit-in-reply as under:\n I say that I assisted respondent No. 4 in carrying out the investigation as per the order of my superior. I say that I remained with respondent No. 4 during this investigation. \n \n\nIn view of this statutory provisions of the Bombay Police Act, it cannot be said that what respondents Nos. 2 and 3 did in the course of the investigation was beyond their judisdiction. On the contrary, they were duty bound to do what they did under the circumstances of the case. Mr. Barot's challenge, therefore, on the ground of jurisdiction of respondents Nos. 2, 3 and 4 to investigate the case in question must fail.\n 34. to 42.      xx       xx       xx        xx\n \n\n43. The last argument which I must now consider requires special notice. Mr. Barot submitted that while respondent No. 4 arrested petitioner No. 2, petitioner No. 2 was not supplied full particulars of the offence for which he was arrested or other grounds for such arrest. Mr. Barot submitted that the arrest of petitioner No. 2 is in violation of Article 21, Article 22 of the Constitution of India and Section 50(1) of the Criminal procedure Code. Article 21 of the Constitution of India says that no person shall be deprived of his life or personal liberty except according to procedure established by law. Article 22(1) says that no person who is arrested shall be detained in custody without being informed, as soon as may be, of the grounds for such arrest nor shall he be denied the right to consult, and to be defended by. a legal practitioner of his choice. Section 50(1) of the Criminal Procedure Code says that every Police Officer or other person arresting any person without warrant shall forthwith communicate to him full particulars of the offence for which he is arrested or other grounds for such arrest. \n\n44. Mr. Barot submitted that the term \"grounds for arrest\" has repeatedly been interpreted by the Supreme Court of India as meaning all relevant facts and statements and evidence collected during the course of investigation justifying the arrest. It is stated at paragraph 12 of the petition that the petitioners do not know, \"even till date\" (that is to say till the filing of the petition and its amendment later) as to why the petitioner No. 2 was arrested and for which offence he has been arrested and on the strength of which material he has been arrested by the Police. I may interrupt at this stage to state that this statement of the petitioners does not appear to be correct in the light of the affidavit of respondent No. 4. \n\n45. Mr. Barot has heavily relied upon the two reported cases, namely Govind prasad v. State of West Bengal 1975 Cri LJ 1249 and Ajit kumar v. State of Assam 1976 Cri LJ 1303. \n\n46. Mr. Barot has relied upon the following observation from the case of Govind Prasad v. State of West Bengal 1975 Cri LJ 1249 at P. 12541 (supra):\nSection 50 is a new one, added on the recommendations of the Joint Committee. Its provisions are material and cannot be overlooked. It brings the law in conformity with the provisions of Article 22(1) of the Constitution of India. enabling the person arrested to move for habeas corpus to obtain his release. \n\nThe section confers a valuable right and a non-conformance to its mandatory provisions is a non-conformance to the procedure established by law. \n\n47. Mr. Barot relied upon the following passage from the case of Ajitkumar v. State of Assam 1976 Cri LJ 1303 (Gau) (supra). \n\n The section is mandatory. A citizen's liberty cannot be curtailed except in accordance with law. When a person arrested without warrant alleges by affidavit that he was not communicated with full particulars of the offence leading to his arrest in the face of such affidavit, the police diary cannot be perused to verify the police officer's claim of oral intimation of such particulars. Even if such oral communication was made, whether full particulars were communicated not being known the arrest and detention of the person is illegal. \n48. I shall first consider the observation cited by Mr. Barot from the case of Govind Prasad v. State of West Bengal 1975 Cri LJ 1249 (Cal.) (supra). I, with respect, agree with the proposition cited by Mr. Barot from head-note (C) of the same ruling. In order, however, to understand and appreciate its impact on the present case, it is necessary that the facts of the reported ruling are considered. \"On a complaint lodged by one Sat Paul Kanwar. described as a partner of the Vardhman General and Spinning Mills Ltd., at P. S. Sadar Ludhiana. Ludhiana P. S. Case No. 620 dated 15-12-1974 was started under Sections 406\/408\/468\/471 of the Indian Penal Code. In course of the investigation that followed, the accused-petitioner who is stated to be a businessman living at 132\/1, Mahatma Gandhi Road, Calcutta was arrested on the 20th March, 1975, by the Ludhiana Police with the assistance of the Police of the Jorasanko police Station, in Calcutta and was produced on the same day before the learned Additional Chief Metropolitan Magistrate. Calcutta, On an application for bail moved on behalf of the accused-petitioner Sri K. G. Choudhury. Additional Chief Metropolitan Magistrate. Calcutta by his order dated the 20th March, 1975, rejected the prayer for bail \"at this stage,\" and allowed the officer concerned coming from Ludhiana to take the accused away for being produced at the Ludhiana Court and to report compliance to the Calcutta Court by 8-4-1975. \"This was the impugned order which formed the subject-matter of the application for bail. An argument was advanced inter alia on behalf of the petitioner relating to a non-consideration on the part of the learned Additional Chief Metropolitan Magistrate.. Calcutta of a non-conform-ance to Section 50 of the New Code of Criminal Procedure Code (Act 2 of 1974).\" It was in that context thai it was observed that Section 50 of the Code of Criminal Procedure is a new one and that its provisions are material and cannot be overlooked. It was submitted that full particulars of the offences as enjoined under the new provisions were not communicated to the accused-petitioner when he was arrested without warrant in Calcutta. N. C. Talukdar. J., speaking for the Bench observed that the Section confers a valuable right and a non-conformance to its mandatory provision is a non-conformance to the procedure established by law. What is, however, to be observed is that the full particulars of the offences were not given to the petitioner-accused. In fact, from the facts which are given at paragraph 2 of the reported case, it appears that no particular of the offences for which the petitioner was arrested was supplied to him. It is to be noted that the incorporation of this provision brings the law in conformity with the provisions of Article 22(1) of the Constitution of India enabling the person arrested to move for habeas corpus to obtain his release. Mr. Barot's main contention was that the officer concerned should have not only supplied the full particulars of the offence to the petitioner No. 2, but that they should have been in writing along with the copies of the relevant documents. Mr. Barot's submission was that Section 50(1) of the Criminal Procedure Code is to be read not only in the light of Article 22(1) but Article 22(5) of the Constitution of India also. Article 22(5) requires that when any person is detained in pursuance of an order made under any law providing for preven:ive detention, the authority making the order shall, as soon as may be, communicate to such pardon the grounds on which the order has been made and shall afford him the earliest opportunity of making a representation against the order. So far as Section 50(1) of the Cr P.C. is concerned, it requires every police Officer or other person arresting any person without warrant to forthwith communicate to him full particulars of the offence for which he is arrested or other grounds for such arrest, Mr. Barot submitted that although it is not stated in the section that full particulars of the offence should be supplied in writing, that would be the meaning which must be deduced from the requirement of \"communicating\" the full particulars of the offence to the accused. While the reported case indeed emphasises the mandatory character of the requirement under Section 50(1) of the Criminal P.C. and holds that non-compliance with this provision amounts to non-conformance to the procedure established by law, it nowhere lays down that the requirement of Section 50(1) is pari materia with the requirement under Article 22(5) of the Constitution of India. On the contrary, it is expressly observed at paragraph 9 of the judgment that Provision of Section 50(1) of the Criminal P.C. brings the law in conformity with the provisions of Article 22(1) of the Constitution of India. The requirement of Article 22(1) of the Constitution of India is that a person who is arrested shall not be detained in custody without being informed, as soon as may be. of the grounds for such arrest. Article 22(1) and Article 22(5) of the Constitution of India are differently worded and the requirements of both are different, it is difficult to agree with Mr. Barot that Section 50(1) of the Cri P.C. must be interpreted so far as its requirements are concerned in the light of Article 22(5) of the Constitution of India that it should not be restrained in its demand of compliance with Article 22(1) of the Constitution of India. The authority considered above does not support this view of Mr. Barot. \n\n49. I may now refer to the second quotation cited by Mr. Barot from the case of Ajitkumar v. State of Assam (1976 Cri LJ 1303) (supra). The quotation is reproduced above, I may say that the quotation is lifted and cited here out of the context in the fact situation of the present case. We may see how the facts of the reported case are materially different from those of the present case. The petitioner was the ex-President of the Assam College Teachers Association, President of the Assam Political Science of the Handique Girls' College, Gauhati. There was some sort of turmoil with regard to the holding of the Pre-University Examinations of the Gauhati and the Dibrugarh Universities in June, 1975. and in that connection, it is stated by the petitioner, that the police indiscriminately arrested hundreds of students. The petitioner while he was relaxing at his house after his meal, the Officer-in-Charge of the Gauhati Police Station accompanied by some Police Constables came to his house and requested him to accompany them to the Thana on the plea that he was sent for by the Superintendent of Police. Kamrup. The petitioner refused to comply with the request on the ground that at that hour of the night he was not willing to go to the Thana and wanted to know of the police Officers if he was under order of arrest and they came to arrest him, and the petitioner demanded the warrant of arrest, if any. The Police Officers informed him that there was no warrant of arrest against him and they had not come to arrest him either. Even after that when he refused to comply with the request, the Police Officers forcibly took, him out of his house to a police vehicle parked nearby and then to the Thana. At the Thana he found the Superintendent of Police talking with a gentleman in one room and when the petitioner entered. the room, the Superintendent of Police, requested the petitioner to sit in a nearby room. Accordingly, he was sitting in that room, but the Superintendent of Police left the Thana After some time, the police Officers left their posts. Thereafter he was requested by some. Constables to. go to another room and no action was taken with regard to him. He was in great predicament and had to pass the night sitting till next morning, on the following day in the morning, he was visited by some friends and at about 1 p. m. the petitioner was brought to the prosecuting Inspector's office at the Deputy Commissioner's Court at Gauhati where he was kept confined till 5. P. M. Later on, he applied for bail which was granted. The petitioner applied under Section 482 of the Criminal P.C. 1973. He did not deny that the Police Officer did not have the power to arrest an accused if he is suspected of a cognizable offence, but his submission was that in that case the accused is entitled to communication of the full particulars of the offence under Section 50 of the Criminal Procedure Code and in that case this was not done In his affidavit, he specifically stated that communication of particulars of the offence has not been made to him in spite of the orders of the Chief Judicial Magistrate to do so. This allegation was not countered either by the State of Assam, respondent No. 1 or the Officer-in-Charge of the Thana (respondent No. 3) by any affidavit. In this situation, Baharul Islam J. (as he then was) observed as under (at p. 1305):\nSri C R. De, the learned Counsel appearing on behalf of the State submits that the police diary in his possession shows that the particulars of the offence were communicated to the petitioner orally. We are unable to peruse the police diary in the face of the affidavit filed by the petitioner. There was no reason as to why respondent No. 3 did not come forward to file a counter affidavit denying the petitioner's allegation. The provision of Section 50 is mandatory and must be strictly complied with. A citizen's liberty cannot be curtailed except in accordance with law. Even if any communication about the offence was orally made by respondent No. 3 to the petitioner, we do not know what kind of communication was made whether the communication of the full particulars or the mere section of the offence was told to the petitioner. In the circumstances, we hold that the arrest and detention of the petitioner by respondent No. 3 was in violation of Section 50 Cr. P. c. They are illegal and, consequently, the P R. Bond that had to be executed by the petitioner was also a nullity. \n\nIn the result we cancel the P. R. Bond executed by the petitioner and he is freed from it. \n (Underline supplied). \n\n50. Mr J. U. Mehta the learned Public Prosecutor rightly submitted that so far as the concluding observation of the judgment is concerned, it helps the prosecution rather than the petitioners, it is necessary that those observations are also cited here. Baharul Islam J., concluded as under:\n There was also a prayer by the petitioner for quashing the case. But this is not the stage at which the case can be quashed. It is possible that if there be no evidence against the petitioner, the case may end in a final report, or it there be a charge-sheet unwarranted by materials, the petitioner can approach an appropriate court at the appropriate lime for quashing the case. \n51. So far as the present facts are concerned, respondent No. 4 has filed a detailed affidavit, the contents of which we have seen above. The respondent No. 4 has elaborately stated the facts leading to the arrest of petitioner No. 2 and as to how he was pointed out by the accused of the original case under investigation as the person to whom he had sold the stolen ornaments. Having narrated these facts in details, respondent No. 4 has stated. \"I say that the petitioner No. 1 was given the information in presence of the petitioner No. 2 about his arrest and the petitioner No. 2 was also examined and was given the reasons for his arrest.\" So, it cannot be said that respondent No. 4 has not stated on affidavit the facts which would counter petitioner's affidavit wherein the allegation of non-compliance with Section 50(1) of the Criminal P. C are averred. It is pertinent to observe that we do not find any observation in this case also that the compliance of Section 50(1) of the Criminal Procedure Code should be in writing. \n\n52. Mr. Bard's main argument in this connection was that the compliance with Section 50(1) of the Criminal Procedure Code should be interpreted not only in the light of Article 22(1) of the Constitution of India, but also in the light of Article 22(5) of the Constitution of India Mr. Barot cited several authorities founded upon Article 22(5) of the Constitution of India to convince me that they had application while interpreting Section 50(1) of the Criminal procedure Code and therefore in comply with Section 50(1) of the Cri. P.C. the Prosecution ought to have supplied to petitioner No 2 full particulars of the offence in writing along with the copies of the documents on the contents of which the prosecution relied. Mr. Barot could show no authority in support of his argument and he candidly admitted that such an interpretation of Section 50(1) of the Criminal Procedure Code was sought by him without the support of any authority, it may be reiterated here that the authorities cited by Mr. Barot and discussed by me earlier, namely the case of Govind Prasad v. State of West Bengal (1975 Cri LJ 1249) (Call (supra) and the case of Ajitkumar v. State of Assam (1976 Cri LJ 1303) (supra) do not in any way support this argument of Mr. Barot. Mr. Barot has cited several authorities on each point of submission on this aspect. He cited authorities to explain the words \"forthwith,\" \"grounds\", \"communication of information\", \"opportunity of representation\". He submitted that the grounds means the same thing in Article 22(1) and Article 22(5) of the Constitution of India meaning entire statement of facts, documents and other materials relied upon by detaining authority for passing detention order. He submitted that documents are an integral part of grounds. \n\n53. As against these arguments of Mr. Barot, Mr. Mehta submitted that the facts and circumstances leading to the arrest of petitioner No. 2 and the affidavit-in-reply filed by respondent No. 4 showed that the petitioner No. 2 was given the reasons for his arrest and also all the documents namely the statement of the accused, Panchnama recorded in his presence and all that transpired leading to the arrest of petitioner-No. 2 occurred in his own presence. The' provisions of Article 22(1) of the Constitution of India and Section 50(1) of the Criminal Procedure C°de were fully complied, with. Mr. Mehta submitted that; the compliance or non-compliance with the provisions of Article 22(1) of the Constitution of India and Section 50(1) of the Criminal Procedure Code depends upon the facts and circumstances of each case. In the present case, there was full compliance of Article 22(1) of the Constitution of India and Section 50(1) of the Criminal Procedure C°de. \"Grounds\" means the reasons and the reasons were given for his arrest. The Investigating Officer were led by the accused Babal-sang (Fobarsang) to the shop of the present petitioner No. 2 and Babalsang pointed out petitioner No. 2 at his own shop. Respondent No. 4 had interrogated petitioner No. 2 at his shop and petitioner No. 2 had produced \"Bani\" with was melted from the stolen gold ornaments, while he did not produce other ornaments which were allegedly sold to him by accused Babalsang, Petitioner No. 2 had also produced the bill book which has been commented above. After further interrogation of petitioner No. 2 by respondent No. 4. the shop and the house of petitioner No. 2 were searched for stolen ornaments. There were the circumstances of which the petitioner No. 2 was clearly aware. Even so. respondent No. 4 has stated that he had given the reasons of petitioner No. 2's arrest to petitioner No. 2. Mr. Mehta submitted, can it be said by any stretch of imagination that petitioner No. 2 was not communicated the full particulars of the offence for which he was arrested? Mr. Mehta submitted that petitioner No. 2 was communicated everything necessary at the earliest opportunity to enable him to know exactly as to what the accusation against him was, so that he could exercise his right of consulting a legal practitioner of his choice. in fact, petitioner No. 2 did consult his advocate who argued the application filed by the prosecution for remand and at no stage was any grievance made before the learned Magistrate about non-compliance with Section 50(1) of the Criminal Procedure Code by the prosecution. Petitioner No. 2 was produced before the learned Judicial Magistrate. First Class, Kadi within 24 hours from his arrest. The report was submitted to him and the advocate for petitioner No. 2 vehemently argued before the Court why police remand should not be given. Thus petitioner No. 2 had full information and had instructed his lawyer about the full particulars of the offence for which he was arrested. Otherwise, the Advocate for the petitioner No. 2 would certainly have made a grievance that petitioner No. 2 did not know why he was arrested or detained. Mr. Mehta submitted, can it be said under these circumstances that petitioner No. 2 was not communicated or informed of the reasons for his arrest or the particulars of the offence for which he was arrested? Quoting from the case of Pranab Chatterjee v. State of Bihar and another in Writ Petition No. 326 of 1970. decided by the Supreme Court on 13-10-1970, Mr. Mehta contended that in that case the contention of the arrested petitioner was that he was never informed of the grounds for his arrest and that he was never produced before the Magistrate after his arrest The Supreme Court after discussing the facts and circumstances of that case held. \"The circumstances under which the petitioner was arrested along with others clearly establish that the petitioner knew the nature of the alleged offence for which he was arrested.\" \n\n54. Mr. Mehta also argued citing the case of Markendey v. State, 1976 All LJ 88 that the Article 22(1) of the Constitution of India will come into play only when a person who was arrested was being detained in custody. If the petitioner was granted bail, it cannot be said that he was being detained in the custody and therefore Article 22(1) of the Constitution of India cannot apply. Mr. Mehta also referred to the reported cases of Calcutta High Court and Gauhati High Court, discussed by me above, and submitted that in neither of these cases it was laid down that the particulars of the offence or grounds of arrest should be communicated to the person arrested in writing. The only requirement of Article 22(1) of the Constitution of India and Section 50(1) of the Criminal Procedure Code was that the person arrested must know the particulars and the reasons for his arrest as to why he is being arrested. The petitioner who as arrested must be informed of the particulars about the offence for which he is arrested and each case depends upon its own facts. \n\n55. I might say at this stage that I accept the arguments of the learned Public Prosecutor Mr. Mehta that each case is required to be decided in the light of its own peculiar facts and that it is not one of the requirements of Section 50(1) of the Criminal P.C. that the communication of the full particulars of the offence for which the accused is arrested or other grounds for such arrest should necessarily be conveyed to him in writing. I also agree with Mr. Mehta's submission that the requirements of Article 22(1) and Article 22(5) of the Constitution of India are laid in relation to different contingencies. Article 22(4) of the Constitution of India provides that no law providing for preventive detention shall authorise the detention of a person for a longer period than three months unless an Advisory Board constituted in accordance with the recommendation of the Chief Justice of the appropriate High Court has reported before the expiration of the said period of three months that there is in its opinion sufficient cause for such detention. So far as the person arrested under preventive detention is concerned, he is not required to be produced before a Magistrate within the period of 24 hours of such arrest. In case of a person who is arrested or detained under any law providing for preventive detention, Causes (1) and (2) of Article 22 of the Constitution of India will not apply. In case of a person who is arrested under a law. other than the law providing for preventive detention, he is required to be produced, before the Magistrate within the period of 24 hours of such arrest and such arrested person cannot be detained in custody beyond the said period without the authority of such judicial authority. Therefore so far as detention other than preventive detention is concerned, the provisions of Article 22(1) and (2) of the Constitution of India will apply and so far as preventive detention is concerned the remaining provisions of Article 22 of the Constitution of India will apply. All those cases in which the Supreme Court has interpreted Cause (5) of Article 22 of the Constitution of India in relation to preventive detention, will not apply in cases of arrest or detention under law other than the law of preventive detention. \n\n56. In this view of the matter, I cannot accept Mr. Barot's last argument. \n\n57. In the result, the present proceedings fail as indicated above. The petition is accordingly dismissed and the rule is discharged. \n\n 58.     x     x     x     x       x",
        "Doc_size":47086,
        "Case_Type":"Criminal",
        "Court_Type":"High_Court",
        "Court_Name_Normalized":"Gujarat High Court"
    },
    {
        "Titles":"State Of Gujarat vs Shahnawaz Abdulgafur Bhatti on 7 August, 2007",
        "Court_Name":"Gujarat High Court",
        "Cites":33,
        "Cited_by":2,
        "Doc_url":"https:\/\/indiankanoon.org\/doc\/952858",
        "Text":"JUDGMENT A.M. Kapadia, J. \n\n1. Criminal Confirmation Case No. 7 of 2005 arises pursuant to submission of the proceedings of Sessions Case Nos. 11 of 2002 and 18 of 2003 made under Section 366(1) of the Code of Criminal Procedure ('the Code' for short) by the learned Additional Sessions Judge, Fast Track Court No. 2, District Kachchh at Bhuj, who, by his judgment and order dated 14-10-2005, has sentenced respondent-Shahnawaz Abdulgafur Bhatti, the accused of Sessions Case No. 18 of 2003, ('the accused' for short) to death for commission of offence punishable under Section 121 read with Section 120B of the Indian Penal Code ('I.P.C for short) whereas Criminal Appeal No. 2317 of 2005 filed under Section 374(2) of the Code by the accused Shahnawaz Abdulgafur Bhatti from the jail is also directed against the judgment and order dated 14-10-2005 rendered by the learned Additional Sessions Judge, Fast Track Court No. 2, District Kachchh at Bhuj, in Sessions Case No. 18 of 2003 by which the appellant\/ accused is convicted for commission of the offence punishable under Section 121 read with Sections 120B I.P.C., 121A, 122 and 123 I.P.C., 124A I.P.C; Sections 25(1)(d), 25(1)(a), 25(1AA) of the Arms Act; Sections 13(2) and 14 of the Foreigners Act; Sections 4(b), 5 and 6 of the Explosive Substances Act, 1908, Rules 3 and 6 of the Indian Passport Rules, 1959 (Entry into India), Paragraph 3 of the Criminal Law Amendment 1961, Paragraph 3 of the Indian Foreigners (Report to Police) Orders, 1971 and Sections 3 and 6(1) of the Indian Wireless and Telegraphs Act, 1933. \n\n1.1. For the aforesaid offences, the accused is visited with the following punishments:   _________________________________________________________________\n  Sr.No.                            Sections Sentence imposed\n_________________________________________________________________\n1. Section 121 read with            Death sentence\n   Section 120B I.P.C.\n2. Section 121A I.P.C.              R.I. for life and fine of Rs.\n                                    250\/- i.d., R.I. for 3 months\n3. Sections 122 and                 R.I. for 10 years and fine of\n   123 I.P.C.                       Rs. 250\/- i.d., R.I. for 3\n                                    months\n4. Section 124A I.P.C.              R.I. for 3 years and fine of\n                                    Rs. 250\/- i.d., R.I. for 3\n                                    months\n5. Sections 25(1)(d),25(1)(a),      R.I. for 7 years and fine of\n   25(1 AA) of the Arms Act         Rs. 250\/- i.d., R.I. for 3\n                                    months\n6. Sections 13(2) and 14            R.I. for 7 years and fine of\n   of the Foreigners Act            Rs. 100\/- i.d., R.I. for 1\n                                    month\n7. Sections 4(b), 5 and 6 of the    R.I. for 10 years and fine of\n   Explosive Substances Act, 1908   Rs. 250\/- i.d., R.I. for 3\n                                    months\n8. Rules 3 and 6 of the             R.I. for 1 year and fine of\n   Indian Passport Rules, 1959      Rs. 100\/- i.d., R.I. for 1\n   (Entry into India)               month\n9. Paragraph 3 of the Criminal      No separate sentence\n   Law Amendment, 1961,\n   Paragraph 3 of the Indian\n   Foreigners (Report to Police)\n   Orders, 1971 and Sections 3 and\n   6(1) of the Indian Wireless\n   Telegraphs Act, 1933\n_________________________________________________________________\n \n\n2. As Criminal Confirmation Case and Criminal Appeal arise out of the common judgment and order dated 14-10-2005 rendered in Sessions Case Nos. 11 of 2002 and 18 of 2003 by the learned Additional Sessions Judge, Fast Track Court No. 2, District Kachchh at Bhuj ('the trial Court' for short), this Court proposes to hear the reference for confirmation of sentence of death and the appeal preferred by the accused together and to deal with the merits of the case against the accused in the light of all the material questions of law as well as facts, and to adjudicate upon the guilt of the accused and appropriateness of sentence of death by this common judgment. \n\n3. The facts emerging from the record of the case, more particularly, as disclosed in F.I.R. and unfolded during trial are as under:\n3.1. As per the allegations made in the complaint lodged by Gulabsinh Amarsinh Parmar, on 27-7-2001, at 7-00 hours, A.S.I. Rajpal Hardwarilal, B. No. 1292, Head Constable, Mulbharthi Prembharthi, Armed Police Constables, Lakhmanram Thakraram, Prithvisinh Mulvaji, Bhagwanbhai Ranchhodbhai and other police personnel of Hajipir Outpost were patrolling in the Hajipir Dargah area. Meanwhile, at 9-30 a.m., one Ramzan Pirmamad of Hajipir came and informed the staff of Hajipir Outpost that a suspicious individual was there in the Baval bushes near Mubarak Pir's Dargah. Thereupon, they went to the Baval bushes shown by him and found the suspicious looking individual and upon inquiring about his name and whereabouts, he informed that his name was Mazzamil Hussain Abdul Gafur, resident of Mugang Chowky, Lahore, Pakistan. Upon conducting physical search of the individual, Indian currency in the sum of Rs. 20,000\/- consisting of 34 notes of Rs. 500\/- denomination and 30 notes of Rs. 100\/- denomination, one wet chit bearing numbers in English and one live cartridge were found in his possession. \n\n3.2. It is further case of prosecution that, S.I. Naranayansingh No. 70110012 and S.I. Surendrasingh No. 69500224 of G-Branch of the B.S.F. also arrived and joined in helping the police. As the said individual was found to be in possession of a cartridge, hence upon it becoming certain that he must be having some weapon, the said Pakistani citizen expressed his willingness to show the weapon, whereupon immediately two panchas (1) Ishaq Ismail Mujhavar and (2) Noormamad Saleman Mujhavar, both residents of Hajipir, Taluka Bhuj, were called and in their presence the Pakistani intruder took out one AK 56 Rifle and its magazine which contained 28 live cartridges from the Baval bushes on the western side of the Muzhuddin Hussain Mubarak Pir's Dargah. Possession of the AK 56 Rifle Body No. H. 7177 valued at Rs. 1,50,000\/- and the cartridges valued at Rs. 560\/- was taken by drawing a detailed panchnama. \n\n3.3. As per further case of the prosecution, as ultra-modern weapons were recovered from the Pakistani citizen and it was probable that he was accompanied by other intruders, it did not appear to be safe to keep the Pakistani citizen at the Police Station; hence he was taken to the B.S.F. camp at Hajipir. Upon the Nara Police Station being informed in this regard through V.H.F. message sent from Hajipir Outpost, the in-charge P.S.I. and other staff reached Hajipir. As the Pakistani intruders had intruded through the desert, with a view to find out as to from where they had entered the border of India, local guides having expertise in the traditional way of tracking footprints and Police Force Photoprint Tracker on Special Duty Prabhatsinh Bharmalji Jadeja and police staff as well as B.S.F. personnel started tracking footprints on the path through which the intruders had come, whereupon at a distance of about 4 to 5 kilometres from Hajipir Outpost one bed-sheet and four live cartridges were found and clues indicating entry of three other intruders into the border of India from Pakistan were found. \n\n3.4. It is further case of the prosecution that as it was found that four individuals had intruded, an entry was made in the Nara Police Station, Station Diary being Entry No. 12 of 2001 at 11-15 hours on 27-5-2001. As per the averments made in the complaint, upon preliminary interrogation of the apprehended intruder, it was learnt that he was a trained terrorist belonging to the Pakistani Lashkar-e-Toiba hence, on the basis of Order No. L.I.B\/B.D.R.\/ Restrict Movement\/247\/2001 dated 28-5-2001 passed by the Superintendent of Police, Kachchh-Bhuj, in exercise of powers conferred under the Foreigners Order, 1948 read with Government of Gujarat Notification No. B.S.F. 1160 (11) dated 2-12-1960, he was placed under restrictions at the Joint Interrogation Centre at Bhuj, where he was jointly interrogated by the police as well as other agencies operating at Kachchh. \n\n3.5. It is further case of the prosecution that during the course of interrogation of the Pakistani intruder it was revealed that his real name is Shahnawaz Abdulgafur Bhatti, aged 19 years, resident of Nalowala, District Hafizabad Punjab, Pakistan. \n\n3.6. It is further case of the prosecution that on 27-5-2001, police footprint trackers and other staff members, while tracking such footprints in the desert, which were coming from the direction of Pakistan, passed near Survandh and footprints of two out of the three intruders were tracked from Survandh through the Baval bushes to the farm of Kashmirasingh Kalusingh Sikh at the Mm\/border of Nara Village. The footprints were found from the Kashmirasingh's vadi till his house. Upon searching in house, Kashmirasingh informed that two persons had come to his house and he had arranged for food and drinks and with the Rs. 500\/- currency note given by them he had purchased cold drinks, salted peanuts, sugar, etc., from the shop of Muluksingh Gurdayalsingh of the village and in return they had given him Rs. 500\/- as remuneration. It was learnt that these persons had come with intruders from Pakistan and were going to meet Maheru Bhil who was residing on the outskirts of Jaru village. Saying that from there both had some work at the place of Ghulam Hussain Mutva at Sarada village, they had left his place. The tracking was halted at night. \n\n3.7. As per further case of prosecution, on 28-5-2001, while tracking footprints they crossed the Hajipir cross-road and reached the border of Muru village where they found footprints at a little distance from the house of Maheru Bhil. Upon making search for Maheru Bhil, he was not found. Proceeding further with tracking footprints they passed through Dhedh Talav and found footprints till the border of village Sarada. They halted tracking at night. \n\n3.8. It is further case of the prosecution that on 29-5-2001, upon proceeding further, footprints were found near the water tank of Sarada village where upon searching for Ghulam Hussain, he was not found to be present, however, they secured information from the village that on 28-5-2001 two individuals had come to visit Ghulam Hussain and had met Sodha Haji Sahu, Maluk Alajudiya and Jhanjhan Haji Hayat, etc., there. It was learnt that from there Mamad Ali of Bhitara village had taken the said persons in his milk tempo. Upon getting investigation done by the footprint trackers around Sarada village and going further no footprints were found, hence, it appeared that the Pakistani intruders had left Sarada village in a vehicle. Ghulam Hussain, Sodha Haji Sahu, Maluk Alajudiya and Memon Haji Hayat of Sarada village were not found to be present. Mamad Ali of Bhitara village was also not found to be present. \n\n3.9. It is further case of the prosecution that on 30-5-2001, the B.S.F., during the course of searching for the intruders in the desert, found a box of used AK 56 cartridges and two pairs of old boots which were produced along with a report. \n\n3.10. As per further case of the prosecution, Shahnawaz Abdulgafur Bhatti, resident of Nalowala, Punjab, Pakistan and member of a terrorist organization named Lashkar-e-Toiba, and along with him his three accomplices-Pakistani intruders under the guidance of Lashkar-e-Toiba and with the intention of actually waging war in India and with a view to spread lawlessness and to create hatred against the lawfully established Government in the minds of the people and to spread discord, have hatched a conspiracy with the help of certain anti-India anti-national elements and having obtained help from anti-India elements, Shahnawaz and three unknown Pakistani intruders who had absconded. \n\n3.11. A complaint in respect of the aforesaid incident was lodged at Nara Police Station by Gulabsinh Amarsinh Parmar, P.S.I., Joint Interrogation Centre, Kachchh at Bhuj, which came to be registered vide CR No. 2 of 2001 at Nara Police Station for commission of the offences punishable under Sections 120B, 121, 121A, 123, 124A of I.P.C., Section 13(2) of the Foreigners Act, 1964 and Rules 3 and 6 of the Indian Passport Rules, 1950 (Entry into India) as well as Paragraph 3 of Criminal Law Amendment, 1961 and Paragraph 3 of the Indian Foreigners (Report to Police) Orders, 1971 and Sections 25(1)(d), 25(1)(a), 25(1AA), 25(1B)(f) of the Indian Arms Act. \n\n3.12. Pursuant to the registration of the complaint, investigation was entrusted to Dilipkumar Rameshchandra Agravat, P.I. L.C.B. Police Station, District Kachchh at Bhuj by the District Superintendent of Police, Kachchh. \n\n3.13. On taking over the investigation, D.R. Agravat, investigating officer, recorded statements of the witnesses and as there were incriminating evidences against Kashmirasingh Kalusingh, he was arrested on 19-7-2001 and his statement was recorded. He had also obtained police custody remand for ten days and made necessary investigation. Thereafter as there were sufficient incriminating evidences against the other six accused persons i.e., (i) Mamad Alikhan Jat, (ii) Gulamhusen Madhu Jat, (iii) Sodha Haji Sahu Jat, (iv) Jhanjhan Haji Hayat Jat and (v) Maluk Ala Judia Jat and (vi) Meharu Pappu Bhil, they were arrested on 29-7-2001 and their statements were recorded and they were produced before the Court within the stipulated time. \n\n3.14. Thereafter the AK 56 rifle and other articles recovered from the accused Shahnawaz were forwarded to F.S.L. for necessary analysis. During the course of investigation, the accused Shahnawaz, a Pakistani citizen, who had brought along with him explosive and other destructive equipments was interrogated and during the course of the interrogation, Shahnawaz expressed willingness to show the said articles. The investigating officer, D. R. Agravat, therefore, requisitioned the services of two Panchas and after informing them regarding all the facts and ascertaining their willingness to act as Panchas, the preliminary panchnama was drawn at L.C.B. Office at Bhuj. Thereafter at the instance of the accused Shahnawaz, various articles were recovered and panchnama was drawn accordingly on 17-12-2001. The articles which were recovered by him were as under:\n(i) AK 56 Rifle - 1 - valued at Rs. 1,50,000\/-\n(ii) Empty Cartridges - 2\n \n\n(iii) Cartridges - 240 pieces valued at Rs. 24,000\/-\n(iv) Yellowish explosive substance with normal greasiness 1,27,000 grams\n \n\n(v) Brownish black explosive substance 5,700 grams\n \n\n(vi) Yellow coloured oil cake like explosive substance with excessive oil-9,700 grams\n \n\n(vii) Hand grenades - 10 pieces\n \n\n(viii) Remote controls - 4 pieces\n \n\n(ix) Delay switches - 17\n \n\n(x) Wireless hand-set 2\n \n\n(xi) Battery manufactured by Energier company - 10 pieces\n \n\n(xii) Detonators (Electronic) 10 pieces\n \n\n(xiii) Detonators (Ordinary) 10 pieces, etc. 3.15. The said articles were sealed in presence of the panchas and thereafter the accused and the muddamal were brought to Bhuj. As all the muddamal were dangerous and explosive, experts from F.S.L. were called and the seal of the muddamal was opened in the presence of panchas by drawing panchnama. Samples of the muddamal substances were taken out and were sealed and panch slips were attached to the same in the presence of panchas. Thereafter upon weighing the R.D.X., it was found to weigh 12 Kgs. and 700 grams. All the muddamal articles were forwarded to F.S.L., Ahmedabad and detonators were sent to Vadodara Explosive Experts for analysis thereof. \n\n3.16. At the end of the investigation sufficient incriminating evidences were found against all the seven accused persons who were arrested earlier. He obtained necessary sanction from the State Government as well as District Magistrate and on obtaining necessary sanction, he filed charge-sheet against seven accused in the Court of learned J.M.F.C., Nakhatrana where the case is registered as Criminal Case No. 77 of 2002. \n\n3.17. After filing of charge-sheet against seven accused, he was transferred, and therefore, investigation was handed over to Police Inspector, G. H. Vasavada. Since, AK 56 rifle and live cartridges were recovered from the accused Shahnawaz, he was arrested on 21-11-2002. Thereafter, after making further investigation, G.H. Vasavada obtained necessary sanction to file supplementary charge-sheet against Shahnawaz and has filed supplementary charge-sheet against him before the learned J.M.F.C, Nakhatrana where it was registered as Criminal Case No. 384 of 2003. \n\n3.18. As the offences punishable under Sections 121, etc., of I.P.C. are exclusively triable by a Court of Session, the learned J.M.F.C, Nakhatrana committed the case to the Court of Session, Kachchh at Bhuj, where it was numbered as Sessions Case Nos. 11 of 2002 and 18 of 2003. \n\n3.19. Since both the Sessions Cases arose from the same CR No. 2 of 2001 the learned Additional Sessions Judge, Fast Track Court No. 2, Kachchh at Bhuj to whom both the cases were made over for trial, consolidated both the cases and framed charge against the accused of both the Sessions Cases for commission of the offences punishable under Sections 120B, 121, 121 A, 123, 124A of I.P.C., Section 13(2) of the Foreigners Act, 1964 and Rules 3 and 6 of the Indian Passport Rules, 1950 (Entry into India) as well as Paragraph 3 of Criminal Law Amendment, 1961 and Paragraph 3 of the Indian Foreigners (Report to Police) Orders, 1971 and Sections 25(1)(d), 25(1)(a), 25(1AA), 25(1B)(f) of the Indian Arms Act. \n\n3.20. The charges were read over and explained to the accused. As the accused persons pleaded not guilty to the charge and claimed to be tried, they were put to trial by the trial Court in Sessions Case Nos. 11 of 2002 and 18 of 2003. \n\n3.21. In order to bring home the charge levelled against the accused, the prosecution has examined as many as 18 witnesses and has relied upon their oral testimony, the details of which have been given in Paragraph 6 of the impugned judgment and order, as under:  _____________________________________________________________________\nSr.                               Status              Exh.   Page\nNo.                                                   No.    No.\n_____________________________________________________________________\n1.  Vikramsinh Malsinh Rahevar    Witness             12     43\n2.  Ishaq Ismail                  Panch witness       15     45\n3.  Gulamrasul Mithakhan          Witness             19     48\n4.  Mamad Kumbhir Jat             Witness             20     49\n5.  Ramzan Tarmahmad              Witness             21     50\n6.  Balvirsinh Kashmirsinh        Panch witness       22     54\n7.  Rajpal Hardvarilal Yadav      Witness             24     55\n8.  Popat Moti                    Panch witness       27     59\n9.  Sardarbhai Lavjibhai Karan    Witness P.S.I.      33     63\n10. Gulabsinh Amarsinh            Complainant P.S.I.  40     67\n    Parmar                        (J.I.C)\n11. Jayendrasinh Rajendrasinh     Witness P.S.I.      43     70\n    Vaghela\n12. Mahipatsinh Murubha           Panch witness       44     72\n    Rathod\n13. Noormamad Suleman             Panch witness       65     76\n    Mujavar\n14. Chandrasinh Laxmansinh        Panch witness       67     78\n15. Dilipkumar Rameshchandra      Investigating       73     80\n    Agravat                       Officer\n16. Navnitbhai Valjibhai          Witness             87     86\n    Champaneri\n17. Gopal Kumarswami Naikar       Witness             92     87\n18. Vijaykumar Bhaskarrai         Witness             93     90\n_____________________________________________________________________\n \n\n3.22. To prove the culpability of the accused, the prosecution has also produced as many as 32 documents and relied upon the contents of the same, details of which are enumerated in Paragraph 7 of the impugned judgment and order, as under:\n  ______________________________________________________________________\nSr.                     Particulars                       Exh.   Page\nNo.                                                       No.    No.\n______________________________________________________________________\n1.  Order passed by the District Magistrate granting       13     306\n    sanction under Section 39 of the Arms Act\n2.  Order passed by the District Magistrate granting       14     308\n    sanction for prosecution under Section 7 of the\n    Explosive Substances Act.\n3.  Receipt of muddamal article No. 6                      16     311\n4.  Receipt of muddamala article No. 7                     17     312\n5.  Panchnama in respect of recovery of muddamal           18     313\n    Mark 18\/2\n6.  Panchnama in respect of recovery of muddamal           23     315\n    Article - Notes of Rs. 500\/- denomination\n    Mark 11\/4\n7.  Panchnama in respect of recovery of muddamal           28     316\n    Mark 11\/5.\n8.  Slips of muddamal article Nos. 17,                     29,    309\n    18, 19 and 30. to\n    32 322\n9.  Extract of Police Station Diary                        34     323\n    No. 9\/01 - Mark 11\/10\n10. Extract of Police Station Diary                        35     324\n    No. 14\/01 - Mark 11\/11\n11. Extract of Police Station Diary                        36     325\n    No. 15\/01 - Mark 11\/11\n12. Extract of Police Station Diary                        37     326\n    No. 12\/01 - Mark 11\/12\n13. Xerox copy of the letters                              38     328\n    received from B.S.F.                                    &      &\n                                                           39     329\n14. Original complaint Mark 11\/1                           41     331\n15. Slips of muddamal article Nos. 40,                     45     347\n    22 to 30, 32 to 37                                     to      to\n                                                           60     362\n16. Panchnama of muddamal observation                      61     363\n    Mark 11\/6\n17. Panchnama of place of incident                         66     36\n    Mark 11\/8\n18. Panchnama in respect of recovery                       68  &  371\n    of muddamal (Mark 11\/3 and 11\/7)                       69  &  372\n19. Note sent to F.S.L. Mark 11\/15                         74     373\n20. Receipt issued by F.S.L. Mark 11\/16                    75     378\n21. Analysis report sent by F.S.L. in                      76     378\n    respect of muddamal Mark 11\/17\n22. Note sent by F.S.L. Mark 11\/18                         77     382\n23. Receipt issued by F.S.L. Mark 11\/19                    78     389\n24. Receipt issued by F.S.L. Mark 11\/20                    79     390\n25. Analysis report sent by F.S.L. in                      80     391\n    respect of muddamal Mark 11\/21\n26. Note sent by F.S.L. Mark 11\/12                         81     395\n27. Certificate issued by Explosive                        82     399\n    Department Mark 11\/23\n28. Receipt issued by F.S.L. Mark 11\/24                    83     401\n29. Analysis report sent by F.S.L. in                      84     402\n    respect of muddamal Mark 11\/25\n30. Analysis report sent by F.S.L. in                      85     406\n    respect of muddamal Mark 11\/26\n31. Sanction dated 3-11-2001 Mark 11\/28                    88     414\n32. Sanction dated 11-3-2003 Mark 11\/30                    89     416\n_____________________________________________________________________\n \n\n3.23. After recording of the evidence of the prosecution witnesses was over, the trial Court explained to the accused the circumstances appearing against them 156 FEBRUARY 2008 in the evidence of the prosecution witnesses and recorded their further statements as required under Section 313 of the Code. In their further statements the accused denied the case of the prosecution by saying that they are poor people and they have been falsely implicated in the case. However, they did not lead any evidence nor did they examine any witness in support of their defence. \n\nThe present accused of Sessions Case No. 18 of 2003, who has been sentenced to death, has further stated that he is a poor man and he has been falsely implicated in the case. He has further stated that the prosecution has filed false case against him and he did not know anything about the muddamal which were recovered by the investigating agency. He has further stated that he is a citizen of Pakistan and for worshipping at Hajipir he came to India through the desert route as he is poor and unable to afford the expenses to come to Hajipir via Punjab which would take much time and when he was coming to Hajipir for worshipping, near the border of India and Pakistan, officers of B.S.F. caught him and entrusted to the police and thereafter the police has falsely implicated him with the muddamal which the police has recovered from some isolated place. He has further stated that he is innocent. He, therefore, urged to release him. \n\n3.24. On appreciation, evaluation, analysis and scrutiny of the evidence adduced by the prosecution, the trial Court held that prior to framing of the charge against accused No. 7, Maheru Pappu Bhil has died whereas during the pendency of the trial, accused No. 2 Mamad Alikhan, has also died, and therefore, the case against both of them has been abated. So far as remaining five accused persons of Sessions Case No. 11 of 2002 are concerned, the trial Court has held that the prosecution has failed to prove the charge levelled against them, and therefore, they are acquitted whereas so far as the accused of Sessions Case No. 18 of 2003 is concerned, i.e., Shahnawaz, a Pakistani citizen, the prosecution has successfully established the charges levelled against him and it has been held that he has entered into the territory of India without passport or permit with AK 56 rifle, live cartridges as well as R.D.X., detonators and other equipments and materials mentioned in panchnama, and therefore, he attempted to wage war against the Indian Government and to create anarchism in India by exploding R.D.X. by creating terrorism and he intended to wage war against the Government of India and hence all the charges levelled against him have been duly proved and accordingly convicted him for the offences with which he was charged. \n\n3.25. The trial Court thereafter heard the accused Shahnawaz on the question of sentence. According to the trial Court, the accused Shahnawaz was found with AK 56 rifle, live cartridges and large quantity of R.D.X. and since his attempt was to explode R.D.X. in the Indian Territory and to create anarchism and to wage war against the Government of India by bringing the said articles to Indian territory along with his three other companions who are absconding and thereby to terrorize the people and to create anarchism, and therefore, he attempted to wage war against Government of India. Therefore, according to the trial Court, it is a 'rarest of rare case' for imposing the death sentence and accordingly the trial Court imposed extreme penalty of death for commission of offence under Sections 121 and 120B of I.P.C. and also imposed R.I. for life under Section 121A of I.P.C. and other various sentences for various offences to which reference is made in earlier paragraphs of this judgment which has given rise to instant two proceedings before this Court. \n\n4. Mr. Kirtidev Dave, learned Advocate of the accused, in support of the defence has raised several contentions pointing out that the conviction and sentence recorded against the accused is not justified, which can be summarised as under:\n4.1. Mr. Kirtidev Dave, learned Advocate of the accused, has firstly assailed the grant of sanction to prosecute the accused by the sanctioning authority. According to him the investigating officer has obtained sanction under the Arms Act from the Additional District Magistrate on 2-11-2001. The sanction to prosecute 7 other accused, who are Indian, has been accorded by P.W. 17 on 3-11-2001. This sanction was prayed for the 7 Indians only. The sanction by the State Exh. 89 is accorded on 11-3-2003. As per the prosecution case, the alleged recovery of arms and ammunitions from the accused was effected on 27-5-2001. The F.I.R. against all the accused, including the accused Shahnawaz was filed on 14-7-2001. The F.I.R. included charges of Section 121 and other offences under Chapter VI of the I.P.C. Therefore, the investigating officer was well aware on the day he sought sanction under Section 196 of the Code that the allegations against the accused are more serious. However, the investigating officer chose not to seek sanction against the accused because it was decided to implicate him in more serious and grave charge. \n\n4.2. In sum and substance, his submission centered around that the authority has accorded sanction without application of mind and it also led to the conclusion that the investigating agency has acted in improper and unjust manner. According to him, the Pakistani citizen may not claim fundamental rights under the Constitution of India. However, the equality and fairness in trial are fundamental of internationally accepted principles of human rights. Therefore, the trial based on such illegal sanction cannot be sustained. It is also contended by him that the prosecution has examined only the clerk and not the sanctioning authority, therefore, also sanction is not in accordance with law. Therefore, according to him, based on the illegal sanction, resultant conviction is bad in law and cannot be sustained. In support of the aforesaid contention he relied upon the following decisions:\n(i) State of Gujarat v. Dalpatsing Mafasing and Ors. 1993 (2) GLR 1775. \n\n(ii) P.C. Joshi and Anr. v. State of Vttar Pradesh . \n\n(iii) State of Rajasthan v. Tarachand Jain . \n\n4.3. According to Mr. Dave, as per the prosecution case, the B.S.F. personnel were there at the time of discovery. However, no person from B.S.F. has been examined. The report of the B.S.F. was produced by the prosecution but was not tendered in evidence by the prosecution. This action is bad in law. The report of the B.S.F. and the seizure memo of the B.S.F. for the same articles and at the same time was produced during the cross-examination of P.W. 9 P.S.I. Sardarbhai Lavjibhai Karan. The report is at Exh. 38 while the seizure memo is at Exh. 39. Both these documents are tried to be kept away from the scrutiny of the trial Court by the prosecution. These documents are prepared by a public servant in discharge of his official duty. It is the bounden duty of the prosecution to unfold the truth by producing all the relevant documents. \n\n4.4. He has also asserted that as per the story of the B.S.F., the accused was apprehended by them at 9-30 a.m. on 27-5-2001. The panchnama (Exh. 28) discloses that the accused was apprehended by P.W. 5 Rajpal Yadav at 10-00 a.m. on the same day. Now the person apprehended by B.S.F., who had seized the articles at 9-30, cannot lead the P.W. 5-Rajpal Yadav to discovery and also the recovery as mentioned in panchnama (Exh. 28). This creates serious doubt about the prosecution version right from the inception. The prosecution alleges that the story of seizure is cooked up by B.S.F. for getting benefit and publicity. The prosecution admits intervention by B.S.F. P.W. 9 \"Sardarbhai Lavjibhai Karan has also admitted that the police station had been handed over the custody of the accused and the articles by the B.S.F. P.W. 5-Sardarbhai Lavjibhai Karan has also admitted that no accused and articles would be handed over to any agency without proper paperwork. Therefore, according to him, not recording any statement of anybody from B.S.F. and also keeping away Exhs. 38 and Exh. 39 from scrutiny of the Court casts serious doubts about the genuineness of the investigation. It is alleged that the police created recovery at their end to get reward and publicity. The Police alleges the same against the B.S.F. This is the Police case, therefore, the evidence has to be produced by the Police. B.S.F. is a paramilitary force under the Act of 1968. Therefore, B.S.F. has not to come before the Court and hence the basic doubts created by the action of the police creates serious doubts, about the genuineness of the recovery and discovery by it on 27-5-2001. \n\n4.5. It is emphasised by him that as per the case of the prosecution, the accused was detained on 27-5-2001 whereas the F.I.R. has been lodged on 14-7-2001. The filing of F.I.R. and interrogation of the accused was delayed for over six weeks and there is no just and proper ground for the delay. The manner in which the F.I.R. was prepared at Bhuj office, creates serious doubt about it. The police had received the first information on 27-5-2001 and the Exh. 38, report of the B.S.F. is crystal clear. The other accused were also known to the police within a short span. Therefore, this belated F.I.R. is not genuine one. It is a creation after due deliberation by number of agencies and superior officers. Therefore, no reliance can be placed on such F.I.R. \n\n4.6. It is pointed out by him that admittedly, the accused was in custody from 27-5-2001. Therefore, the F.I.R. based on his confessional statement is clearly hit by Section 25 of the Evidence Act. Therefore also the F.I.R., Exh. 41, which is not first in point of time, is not admissible. \n\n4.7. It is emphatically submitted by him that the prosecution has relied upon the so-called second discovery-cum-recovery of the muddamal on 17-12-2001. The prosecution wants to prove this discovery panchnama (Exh. 28) through the deposition of P.W. 15-Dilip Rameshchandra Agravat - Investigating Officer. As per this panchnama and evidence, the place from where the recovery is made can be reached only after a walk of 12 km. The mark of identification was a stick on a heap. Between May and December there was monsoon. Therefore, the so-called identification could not have remained as such. This creates serious doubts about the alleged discovery. \n\n4.8. He has also drawn our attention that P.W. 15, Dilip Rameshchandra Agravat, has stated that the interrogation was going on till 16-12-2001. The alleged discovery was effected on 17-12-2001. Therefore, the facts were disclosed to the police well before the panchnama had begun. Therefore, the first part of the panchnama about disclosure is not genuine. Under the circumstances, the second portion of the panchnama is also not genuine. Therefore the said panchnama cannot be considered as panchnama under Section 27 of the Evidence Act. Besides this, the date of second discovery is after about seven months when the accused was in joint interrogation centre. No doubt, under Rules 3(5) and 5(2) of the Foreigners Order, 1948, the custody of a foreigner can be with the civil authority. However, as per Rule 5(2b) the permission to leave India can be refused if presence is required to answer a criminal charge. In this case, the civil authority waited for pretty long time and kept him under detention from 27-5-2001 to 21-11-2002. Therefore, the so-called discovery on 17-12-2001 is not free from reasonable doubts and no reliance can be placed on such discovery in such a serious crime. The seriousness of crime would require more vigilant investigation and proper and perfect evidence. This is lacking in this case, and therefore, the benefit of doubt must go to the defence. \n\n4.9. It is also emphasized by him that the trial Court has narrated in details the arguments of defence. However, the trial Court has not assigned any reason for the conclusion arrived at by it. \n\n4.10. According to him, this is a case of confirmation, and therefore, even if no appeal is filed, the entire evidence is required to be reconsidered and re-appreciated. \n\n4.11. It is also emphasized by him that there is no evidence worth consideration against the accused which can connect him with such serious charges of waging war against the Government of India. Discovery of the weapons itself is not established. It is true that the accused is a Pakistani citizen and without passport he came to Indian through unauthorized way, therefore, he can be convicted for the said offence but not for the offences of waging war against the Government of India as well as under the Explosive Substances Act and also under the Arms Act. \n\n4.12. On the aforesaid premises, according to him, the impugned judgment and order convicting the accused for the offences of waging war as well as under the Explosive Substances Act and the Arms Act, deserves to be quashed and set aside by allowing this Appeal and also by dismissing the Criminal Confirmation Case. He, therefore, prayed that the Criminal Confirmation Case may be dismissed and Criminal Appeal No. 2317 of 2005 may be allowed and the accused may be acquitted of the offences with which he was charged. \n\n4.13. In the alternative, he submitted that the trial Court is not justified in imposing death sentence on the accused. The trial Court has not assigned any reason for imposing death sentence. According to him, this case is not one of the 'rarest of rare cases' as per the catena of decisions rendered by the Supreme Court in this regard. Therefore, also the Criminal Confirmation Case No. 7 of 2005 is required to be dismissed. \n\n5. Mr. A. J. Desai, learned A.P.P. for the State of Gujarat, has vehemently opposed the contentions advanced by Mr. Kirtidev Dave, learned Advocate of the accused. \n\n5.1. It is contended by him that the sanctioning officer has after application of mind given the consent to prosecute the accused and to prove the said sanction, prosecution has also examined the witnesses who have signed the letter of sanction. \n\n5.2. According to him, there is voluminous evidence against the accused for commission of the offences with which he was charged. He was found in suspicious circumstances at a distance of 50-60 feet from Hajipir Dargah and this information was conveyed to Mulbharti, Head Constable at Hajipir Out Post. He was identified as a Pakistani citizen from whom Rs. 20,000\/- was also recovered and live cartridges and AK 56 Rifle were also recovered by the police officer after making discovery panchnama in presence of panchas. It is further emphasized by Mr. A.J. Desai, learned A.P.P., that thereafter the accused was sent to Joint Interrogation Centre, Kachchh at Bhuj, under the provisions of Foreigners Order, 1971, as he was a Pakistani citizen and came to India without passport by unauthorisedly crossing the boundaries of Kachchh. It is also emphasized by him that during interrogation he has shown his willingness to find out the explosive articles, AK 56 Rifle and R.D.X. which were brought by him from Pakistan with the help of other three Pakistanis who absconded and another accused i.e., accused No. 7, Maheru Pappu Bhil, who died during pendency of the trial, therefore, as per his information two panchas were called and preliminary panchnama was drawn and in the presence of the panchas explosive muddamal R.D.X., etc., were recovered. He has also pointed out that all the panchas have supported with regard to discovery made from the accused of the explosive substance, and therefore, his intention and attempt was to terrorize the people of India and then wage war against the Government of India by blasting the explosive substances which were brought by him at the instance of Azam Chima and other three Pakistanis and deceased Maheru Pappu Bhil. It is also asserted by him that there is nothing to disbelieve the evidence of police officers who have found him in suspicious condition and they have recovered muddamal by drawing two discovery panchnamas at the instance of the accused. He has also drawn our attention to the evidence of Investigating Officer which is of sterling quality and there is no reason to discard the said piece of evidence. According to him, the charges levelled against the accused, have been duly proved, and therefore, the impugned judgment and order convicting the accused for commission of the offences punishable under the I.P.C. as well as other provisions, does not call for interference of this Court in exercise of powers under Section 374(2) of the Code. \n\n5.3. In respect of the imposition of death sentence upon the accused, Mr. A.J. Desai, learned A.P.P., has submitted that the accused is a Pakistani citizen and he has crossed the border of Indian territory. He has brought explosive substance at the instance of Azam Chima and other three Pakistanis, with a view to blast the explosive substance within the territory of India and thereby to terrorise the people of India and to wage war against the Government of India. If the accused would have succeeded in his attempt, then it is not very difficult to perceive the result. No sympathy can be shown to him and this can be a \"rarest of the rare\" case. In the alternative Mr. A. J. Desai, learned A.P.P., has submitted that if this Court comes to the conclusion that this is not a \"rarest of the rare\" case, and therefore, death sentence imposed on the accused deserves to be commuted to life imprisonment, then the directions given by the Supreme Court in Subash Chander v. Krishan Lal and Ors. , may be followed and a direction may be issued that the accused shall not be entitled to any commutation or premature release under the Code, Prisoners Act, Jail Manual or any other statute and the rules made for the purpose of grant of commutation and remissions, and shall spend his entire life in the prison, in view of the act committed by the accused, who is a Pakistani citizen, by bringing explosive substance to the Indian territory with a view to blast it and with a view to wage war against the Government of India. \n\n5.4. On the aforesaid premises, it is submitted that no case is made out by the accused for commutation of death sentence to life imprisonment, and therefore, the appeal should be dismissed and the Criminal Confirmation Case should be allowed. \n\n6. This Court has considered the submissions advanced by Mr. Kirtidev Dave, learned Advocate of the accused and Mr. A. J. Desai, learned A.P.P. for the State of Gujarat at length and in great detail. This Court has undertaken a complete and comprehensive appreciation of all vital features of the case and the entire evidence on record which is read and re-read by the learned Advocates for the parties with reference to broad and reasonable probabilities of the case. In light of caution sounded by the Supreme Court while dealing with confirmation cases, this Court has examined the entire evidence on record for itself independently of the trial Court and examined arguments advanced on behalf of the accused and infirmities pressed, scrupulously with a view to find out as to whether it was the accused and none else who has committed the offences as alleged against him. We have also carefully considered the judgments cited at the bar by the learned Advocates for the parties. \n\n7. Before re-appreciating evidence of witnesses examined in this case, it would be advantageous to refer to criteria for appreciation of oral evidence. While appreciating the evidence of a witness, the approach must be whether the evidence of witness read as a whole appears to have a ring of truth. Once that impression is formed, it is undoubtedly necessary for the Court to scrutinise the evidence more particularly keeping in view the deficiencies, drawbacks and infirmities pointed out in the evidence as a whole and evaluate them to find out whether it is against the general tenor of the evidence given by the witness and whether the earlier evaluation of the evidence is shaken as to render it unworthy of belief. Minor discrepancies on trivial matters, not touching the core of the case, hyper-technical approach by taking sentence torn out of the contex here or there, from the evidence, attaching importance to some technical error committed by the investigating officer not going to the root of the matter, would not ordinarily permit rejection of the evidence as a whole. If the Court before whom the witness gives evidence had the opportunity to form the opinion about the general tenor of the evidence given by the witness, the Appellate Court which had not this benefit, will haye to attach due weight to the appreciation of evidence by the trial Court, and unless the reasons are weighty and formidable, it would not be proper to reject the evidence on the ground of variations or infirmities in the matter of trivial details. Minor omissions in the police statements are never considered to be fatal. The statements given by the witnesses before the police are meant to be brief statements and could not take place of evidence in the Court. Small\/trivial omissions would not justify a finding by a Court that the witnesses concerned are liars. The prosecution evidence may suffer from inconsistencies here and discrepancies there, but that is a shortcoming, from which no criminal case is free. The main thing to be seen is whether those inconsistencies go to the root of the matter or pertain to insignificant aspects thereof. In the former case, the defence may be justified in seeking advantage of incongruities obtaining in the evidence. In the latter, however, no such benefit may be available to it. In the deposition of witnesses, there are always normal discrepancies, however honest and truthful they may be. These discrepancies are due to normal errors of observation, normal errors of memory due to lapse of time, due to mental disposition, shock and horror at the time of occurrence and the like. It is not un often that improvements in earlier version are made at the trial in order to give a boost to the prosecution case, albeit foolishly. Therefore, it is the duty of the Court to separate falsehood from truth. In sifting the evidence the Court has to attempt to separate the chaff from the grains in every case. The Court cannot abandon the attempt on the ground that the case is baffling unless the evidence is really so confusing or conflicting that the process cannot reasonably be carried out. In the light of these principles, the evidence of the witnesses examined in this case will have to be appreciated. \n\n8. In the light of above-quoted principles, the Court will have to consider the question whether guilt of the accused is established by the prosecution. In order to decide this question, it would be necessary for the Court to discuss in extenso the evidence adduced by the witnesses. \n\n9. Mr. Kirtidev Dave, learned Advocate for the accused, has assailed the impugned judgment on the ground that the sanction to prosecute the accused is not accorded strictly in accordance with law and it has been granted without application of mind. \n\n9.1. In this connection, we may first advert to the oral testimony of P.W. 1, Vikramsinh Malsinh Rahevar, Exh. 12. He has, inter alia, testified that he is serving as a Clerk in the office of the District Magistrate, Kachchh District at Bhuj. He has produced papers from the office of the Additional District Magistrate in respect of granting of sanction on 2-11-2001 to prosecute the accused persons under Section 39 of the Arms Act. He has identified the signature of H.M. Gadhvi, Additional District Magistrate. The said document is produced at Exh. 13. He has further testified that the District Magistrate has granted sanction on 15-1-2001 to prosecute the accused persons under Section 7 of the Explosive Substances Act. He has also identified the signature of M.N. Chhibar, District Magistrate and the said letter is produced at Exh. 14. \n\nIn cross-examination he has admitted that he has no personal knowledge in this regard. \n\n9.2. A conjoint reading of the oral testimony of P.W. 1, Vikramsinh Malsinh Rahevar, Exh. 12 and documents at Exhs. 13 and 14, it is seen that as per Exh. 13, sanction to prosecute eight accused persons, including the present accused Shahnawaz, for commission of the offences under the Arms Act was granted by the Additional District Magistrate in exercise of powers conferred under Section 39 of the Arms Act. Exh. 14 shows that against eight accused persons, including the present accused Shahnawaz, sanction was granted to prosecute them under the provisions of Explosive Substances Act by the District Magistrate in exercise of powers conferred under Section 7 of the Explosive Substances Act. \n\n9.3. In view of the aforesaid evidence, according to us, it is not correct to contend that the sanctioning officer has not applied mind properly prior to the granting of sanction to prosecute the accused under the provisions of the Arms Act and Explosive Substances Act. \n\n9.4. Since, both these documents Exh. 13 and Exh. 14 are bearing the signature of the sanctioning authority i.e., Additional District Magistrate and District Magistrate respectively as identified and testified by P.W. 1-Vikramsinh Malsinh Rahevar Exh. 12, who is serving as a Clerk in the office of the District Magistrate, it is not necessary for the prosecution to examine the authors of the said documents themselves. \n\n9.5. The prosecution has also obtained the sanction to prosecute the accused for commission of the offences under Sections 120B, 121, 121A, 123 and 124A I.P.C. In this regard, the prosecution has examined P.W. 16 Navnitbhai Valjibhai Champaneri, Exh. 87, P.W. 17 Gopal Kumarswami Naikar, Exh. 92, P.W. 18 Vijaykumar Bhaskarrai, Exh. 93. \n\n9.6. P.W. 16, Navnitbhai Valjibhai Champaneri, Exh. 87, has in his oral testimony testified that he is serving as Deputy Section Officer in the Home Ministry, Government of Gujarat, and he has produced the sanction obtained against accused Nos. 1 to 7 of Sessions Case No. 11 of 2002, which is at Exh. 88 whereas the sanction to prosecute the accused of Sessions Case No. 18 of 2003, Shahnawaz is produced at Exh. 89. \n\n9.7. P.W. 17, Gopal Kumarswami Naikar, Exh. 92, has inter alia, testified in his evidence that after examining the papers placed before him, he has granted sanction in exercise of the powers conferred under Section 196 of the Code to prosecute seven accused persons for commission of the offences punishable under Sections 120B, 121, 121A, 123 and 124A I.P.C. \n\n9.8. P.W. 18, Vijaykumar Bhaskarrai, Exh. 93, has also stated that after examining the papers placed before him, he has granted sanction to prosecute the accused Shahnawaz in exercise of powers conferred under Section 196 of the Code for commission of the offences punishable under Sections 120B, 121, 121 A, 123 and 124A I.P.C. \n\n9.9. A close analysis of the oral testimony of these witnesses as well as the orders granting sanction produced at Exhs. 88 and 89, it cannot be said that the sanctioning authority has not applied mind prior to granting approval to prosecute the accused. These witnesses have studied the entire case file and the accusation alleged against the accused, and thereafter, granted the sanction to prosecute the accused. Therefore, the letters of sanction to prosecute the accused for commission of the offences punishable under Sections 120B, 121, 121 A, 123 and 124A I.P.C. produced at Exhs. 88 and 89 has been accorded in accordance with law and it is not correct to say that the sanctioning authority has not applied mind prior to granting sanction. \n\n9.10. In view of the aforesaid evidence, according to us, prior to filing of the charge-sheet, the prosecution has obtained necessary sanction to prosecute all the accused persons, including the present accused Shahnawaz, for commission of the offences under the Arms Act and Explosive Substances Act and under Sections 120B, 121, 121 A, 123 and 124A I.P.C. and the trial Court has rightly negatived the contention that the sanction is not accorded in accordance with law or on non-application of mind. Therefore, the contention advanced by Mr. Kirtidev Dave having been found to be meritless, has to be rejected and accordingly we reject the said contention and hold that the prosecution has successfully established that the prosecution has obtained necessary sanction prior to the filing of the charge-sheet against the accused persons for prosecuting them under the provisions of the Arms Act, Explosive Substances Act and under Sections 120B, 121, 121A, 123 and 124A I.P.C. and the trial Court has rightly held that the sanction is accorded in accordance with law. \n\n9.11. The judgments relied upon by Mr. Kirtidev Dave, learned Advocate of the accused, in support of his above contention are not applicable to the facts of the present case as those judgments rested on the facts of those cases which have no bearing to the facts of the present case, and hence, detailed reference to the judgments relied upon by Mr. Dave are avoided with a view not to burden the judgment. \n\n10. The next question which is to be answered by this Court is whether the prosecution has proved the charges levelled against the accused for commission of the offences levelled against him. \n\n11. In this connection, we have to first of all, find out how this incident has been reported to the police authority. In this regard, we have to scrutinise the evidence of P.W. 5, Ramzan Tarmahmad, Exh. 21. He has testified that at the relevant time he was residing at Hajipir and was conducting prayer services at the Hajipir Dargah. At the relevant time, when he was near Mubarakpir Dargah of Hajipir, he had gone near the bushes at a distance of about 50-60 feet thereof to relieve himself, when he found a person drinking water from a muddy puddle. On seeing him, the said person asked him to come near him. The said person thereafter inquired from him as to whether he was a Hindu or a Muslim, to which he had replied that he was a Muslim. The said person was wearing a salwar and there was money in its front pocket. The said person asked him to keep the money and get him a shirt and give him food and water. The said person was wearing only a salwar and the rest of his body was bare. This witness told the said person to keep the money with him. This witness was suspicious about the said person. The lower leg of the said person was bleeding. This witness brought him near the water stand and gave him a bucket of water and told him to drink water and take a bath and in the meanwhile he would get him some clothes and food. This witness had also asked his nephew (who has since then expired) to keep an eye on the said person. He thereafter went to the police station where Jamadar Rajpal, Mulbharthi, Lakhmanram constable, Pathubha, etc., were present. He informed them about the said person and told them that he suspected the said person. He, thereafter took the policemen to the place where he had seated the said person, whereupon the police apprehended the said person and took him away. Later on he learnt that the said person was a Pakistani whose name was something like Muzbilhussain. He had Rs. 500\/- and one live cartridge. Thereafter the police had interrogated him and then they went near the bushes with the accused. In the bushes a rifle was lying beneath a jute sack. Thereafter, the said person was taken to the B.S.F. Camp. \n\n11.1. This witness was cross-examined by the learned Advocate of the accused, at length and in great detail. Suggestions were made to this witness about non-recording of his statement. However, he has repelled such suggestions and he has in unequivocal terms stated that he has informed the police about the said incident. He has also stated that police has recorded his statement subsequently. \n\n11.2. Nothing substantial has been brought out during the cross-examination of this witness which would shake or discredit the evidence of this witness. \n\n12. The prosecution has thereafter examined and relied upon the oral testimony of P.W. 2, Ishaq Ismail, a panch witness, Exh. 15. He has inter alia testified that two years and three months ago, he had been asked by the Hajipir Police Jamadar to come near Mubarakpir Dargah as they had apprehended an accused person named Majboolhussain Abdul Gafur. He had seen the accused person. Rs. 20,000\/- had been recovered from him which consisted of currency notes of the denomination of Rs. 100 and Rs. 500. One rifle was also recovered. Upon interrogation it was revealed that he was a Pakistani. Thereafter a panchnama had been drawn. Subsequently, the accused was taken to the B.S.F. camp. He has further deposed that the rifle referred to earlier, had been taken out by Muzbilhussain from the bushes. The possession of the rifle was taken over by the police by drawing panchnama. There were 28 cartridges also. He has identified the rifle and cartridges and acknowledged his signatures on the panchnama Exh. 18 as well as panch slips. \n\n12.1. This witness was also cross-examined by the learned Advocate of the accused at length and in great detail but nothing substantial which would be any help to the accused could be brought out from his cross-examination and this witness withstood the test of cross-examination successfully. \n\n12.2. A question was asked by the Court to this witness to which he replied that the rifle and money which were recovered from the accused were shown by the accused himself. He has also stated that during the panchnama B.S.F. personnel were also present. The said panchnama is produced at Exh. 18 and he has identified his signature in the said panchnama. \n\n12.3. On close scrutiny of the oral testimony of P.W. 2 Ishaq Ismail, Exh. 15 and the panchnama at Exh. 18, it has to be held that Exh. 18 is a discovery panchnama. The panch has deposed as per the contents of the panchnama. Therefore, there is no reason to disbelieve the testimony of P.W. 2, Ishaq Ismail, Exh. 15 and the panchnama at Exh. 18, by which the rifle and Rs. 20,000\/- were recovered from the accused Shahnawaz. \n\n13. The prosecution has thereafter examined and relied upon the evidence of P.W. 7, Rajpal Hardvarilal Yadav, Exh. 24. He has, inter alia, testified that at the relevant time he was discharging duties at Hajipir Outpost. On 27-5-2001 at 7-00 a.m., he and his staff consisting of Head Constable Mulbharthi, Police constables Lakhmanram, Bhagwanji and Prithvirajji, etc., were patrolling in the Hajipir area. Mean while, they had received information that a suspicious looking individual was seen in the bushes located near the Mubarakpir Dargah, opposite Hajipir Dargah. Upon receiving such information, he had immediately proceeded to the said place along with his staff and there, in the baval bushes, they found a suspicious looking individual. On asking his name, address, etc., he started prevaricating. Thereafter he had divulged information to the effect that his name was Muzzamil Hussain Gurjar, aged 21 years, resident of Moga Chowky, Lahore, Pakistan. Upon conducting physical search of the said individual, a plastic bag was found from the salwar that he was wearing. Upon opening the said plastic bag, Rs. 20,000\/- in Indian currency notes, one live cartridge and a wet chit were found. \n\n13.1. This witness has further deposed that on the basis of the aforesaid articles, he felt suspicious and carried out further interrogation of the said person, whereupon the said person showed the bushes near the pit, wherein he had kept the AK 56 rifle wrapped in a jute sack. Upon opening the sack, a magazine bearing No. P-5177 and an AK 56 weapon were found. On opening the magazine, 28 live cartridges were found. On further interrogation, it was revealed that the said person was connected with Pakistan's Lashkar-e-Toiba group, therefore, he immediately asked for help from the B.S.F. The said individual also disclosed that he had come along with 3 to 4 other persons. Therefore, this witness immediately sent message through V.H.F. set to the Nara Police Station as well as to his higher officers. Thereafter he had drawn a panchnama of all the articles recovered in the presence of panchas from 10-00 to 11-00 hours. The panchas of the said panchnama were Ishaq Osman and Noormamad Sale, both residents of Hajipir. \n\n13.2. Thereafter he had taken Muzzamil Hussain as well as the articles recovered by way of the aforesaid panchnama to the B.S.F. Camp for the purpose of safety. Subsequently, on arrival of his higher officers as well as the officers of B.S.F., the B.S.F. officers had handed over the articles recovered vide the aforesaid panchnama to his higher officers. Thereafter, the muddamal receipt in connection with the articles detailed in the panchnama was written at the Nara Police Station in his presence. The higher officers had taken Muzzamil Hussain and the articles recovered from him to the Joint Interrogation Centre, Bhuj for interrogation and as instructions had been issued to the staff present there to disperse into two groups and to proceed for patrolling in search of the absconding persons, he had also participated in the search for the 3 to 4 absconding persons in the Nara Vadi area. \n\n13.3. This witness has also identified the accused as Muzzamil Hussain as well as the currency notes, AK 56 rifle and 28 cartridges recovered from him. \n\n13.4. This witness was also cross-examined by the learned Advocate for the accused at length and in great detail. He has denied the suggestion made to him during the course of cross-examination that the accused was arrested by the B.S.F. personnel. He has also successfully withstood the test of cross-examination and nothing has been brought out during his cross-examination to make his evidence unreliable. \n\n14. The prosecution has thereafter examined and relied upon the oral testimony of P.W. 8, Popat Moti, a panch witness, Exh. 27. He is a panch witness to the panchnama drawn on 17-12-2001. He has deposed that on 17-12-2001, at 9-30 at night, he had been called at the L.C.B. office at Bhuj for acting as a panch. A person named Shahnawaz Abdul Gafur Bhatti was present there. He informed that he was ready and willing to show the place where the rifle and other things were kept. Shahnawaz was a resident of Pakistan. \n\n14.1. This witness has further deposed that he had put his signature on the panchnama. He accordingly identified his signature on the preliminary panchnama. He has further deposed that between 9-30 to 9-45 hours they had started out in a Government vehicle. The accused Shahnawaz was with them and he was to show the way on which they were to go and accordingly they had departed from Bhuj. From Bhuj they proceeded in the Government vehicle and passed through Nakhatrana, Desalpar, Hajipir and entered the desert. They proceeded further into the desert as far as the vehicle could go. Thereafter, as it was not possible for the vehicle to go any further, they stopped the vehicle and set out on foot on the way shown by Shahnawaz. After walking ahead on foot for about 12 kilometres, they saw a mound of sand, whereupon Shahnawaz removed sand from the top of the mound and took out four sacks from beneath the sand. One rifle was recovered from a sack. From the second sack explosives like bombs were found which were shown to the panchas and were sealed. Khakhi tape was applied and something was written on it. \n\n14.2. One packet of cigarettes, one strip of tablets meant for headaches, and some pieces of wood were also seen there. No other articles were found to be seen. All the sacks were again sealed and they had immediately set out on the return journey. At that time it was about 6-30 in the evening. While sealing the sacks, a panchnama was drawn and he has signed the said panchnama which is at Exh. 28. This witness has also identified his signature on the slips attached to the muddamal articles Exhs. 29, 30, 31 and 32. \n\n14.3. This witness was also cross-examined at length but nothing substantial which would impeach his testimony has been brought out. \n\n14.4. A conjoint reading of the evidence of P.W. 8, Popat Moti, Exh. 27 and the panchnama Exh. 28, it is clear that the panch witness has deposed as per the contents of the panchnama. In the first part of the panchnama, the accused has shown his willingness to show the place where the rifle, R.D.X., etc., were hidden by him. The accused showed the place where they saw a mound of sand, and Shahnawaz removed sand from the top of the mound and took out four sacks from beneath the sand. One rifle was recovered from a sack. From the second sack explosives like bombs were found in the presence of this witness and those muddamal articles were sealed in his presence. Therefore, there is no reason to disbelieve the say of this panch witness with regard to the discovery of the weapons and explosive substances made at the instance of the accused. \n\n15. The prosecution has thereafter examined and relied upon the oral testimony of P.W. 9, Sardarbhai Lavjibhai Karan, at Exh. 33. He was in-charge P.I. at Nara Police Station at the relevant time. On 27-5-2001 at 11-20 hours, Head Constable Mulbharthi of Hajipir Outpost informed that all the police personnel at Nara Police Station should immediately come to Hajipir, hence, he immediately proceeded to Hajipir with nine policemen. Upon reaching there, he learnt that a terrorist has been apprehended with an AK 56, currency notes and a live cartridge and ha:, been taken to the B.S.F. Camp by the B.S.F. personnel and he is being interrogated there. Upon coming to know of the aforesaid, he went to the B.S.F. Camp. At that time an individual who had been apprehended was there. Upon asking his name and whereabouts, he informed that his name was Muzzamil Hussain Abdulgafur Gurjar, resident of Lahore, Pakistan. As three other intruders had entered along with him, search was made in the area surrounding Hajipir. A.S.I. Rajpal Hardvarilal of Hajipir Outpost had drawn a panchnama of the muddamal articles viz., currency notes of Rs. 20,000\/- a chit with numbers written in English, one live cartridge and another panchnama in connection with the recovery of an AK 56 body No. H. 77 P and 28 live AK 56 cartridges and taken possession of the same. This witness along with police personnel had carried out search for three intruders, but could not find them. However, as regards the apprehended Muzzamil, the higher officers also arrived at Hajipir and interrogated him, and thereafter, they had taken him to Joint Interrogation Centre, Bhuj. An entry in this regard was made by this witness in the Nara Police Station, Station Diary being Entry No. 12\/01 on 27-5-2001 at 15-00 hours after which he took charge of the investigation. Thereafter he recorded statements of several witnesses. Kashmirasingh Kalusingh Sikh, resident of Nara had given shelter to the intruders in return for money, out of which he had spent a five hundred rupee-note at the shop of Mallucksingh Gurdayalsingh. The said note was recovered from Mallucksingh Gurdayalsingh by drawing a panchnama and his statement was also recorded. P.S.I.J.R. Vaghela had made search in the desert region in connection with the present case and a report of the muddamal articles so recovered was submitted to the P.S.O. which was also kept in the investigation file. The other three intruders could not be traced despite search being made and on 6-6-2001 the said officer was relieved from Nara Police Station and the investigation was entrusted to P.S.I.G.A. Parmar. \n\n15.1. This witness was also cross-examined by the learned Advocate of the accused at length and in great detail. A suggestion was made to him that the accused was arrested by B.S.F. personnel. He had repelled the said suggestion. He has also stated in his cross-examination that he has continued the investigation till the accused was taken to the Joint Interrogation Centre. \n\n15.2. We could not notice anything from his cross-examination which would make his evidence untenable or unbelievable. On the contrary, his evidence inspires confidence and appears to be trustworthy. \n\n16. The prosecution has thereafter examined and relied upon the oral testimony of P.W. 10, Gulabsinh Amarsinh Parmar, Exh. 40. He has, inter alia, testified that on 6-6-2001 he was handed over investigation in connection with Nara Police Station, Station Diary Entry No. 12\/01. Meanwhile, the combing was being carried out in search of the other accused and he had joined in the said combing. On 30-5-2001, B.S.F. Subedar Naransinh had handed over 4 live cartridges, bed-sheet, two pants, purse and belt along with a report in connection with which an entry was made in the Station Diary. He had forwarded all the aforesaid articles as well as all the papers in connection with the report which he had received, to S.L. Karan. The investigation and combing in connection with this case was going on and those accused who were apprehended were sent to Joint Interrogation Centre, Bhuj where they were being interrogated, thereafter on 14-7-2001, he had lodged F.I.R. Exh. 41, on behalf of the State Government. \n\n16.1. This witness was also cross-examined at length but nothing substantial could be brought out by the learned Advocate of the accused which would be capable of creating any doubt in the trustworthiness of the evidence of this witness. It is required to be mentioned that his evidence inspires confidence and it is reliable and reliance can be placed upon it with regard to filing of complaint as well as the role played by him in the investigation. \n\n17. The prosecution has thereafter examined and relied upon the oral testimony of P.W. 11, Jayendrasinh Rajendrasinh Vaghela, Exh. 43. He has deposed that in the year 2001 when he was discharging duties at the Dayapar Police Station, it was learnt that a terrorist had been apprehended from Hajipir, whereupon they had immediately proceeded from Dayapar Police Station and gone to the B.S.F. Camp, at Hajipir. Upon being sent to carry out combing in the desert in search of the accomplices of the apprehended person, they had found two pairs of black shoes of size 8 and 9 as well as one empty cartridge shell, one black coloured salwar and one old torn cloth from the Hajipir desert, which they had brought from the desert and submitted at the Nara Police Station along with a report. The P.S.O. had taken possession of the same by drawing a panchnama. \n\n17.1. This witness was cross-examined by the learned Advocate of the accused but nothing substantial which would be of any help to the accused could be brought out during the cross-examination. \n\n18. The prosecution has thereafter examined and relied upon the oral testimony of P.W. 12, Mahipatsinh Murubha Rathod, a panch witness, Exh. 44. In presence of this witness the sacks containing muddamal articles, such as, R.D.X., hand grenades, etc., were opened and after taking small quantity as samples, they were again sealed. He has, inter alia deposed that on 20-12-2001 at about 1 O'clock in the afternoon, he had been called at the L.C.B. Office at Bhuj by the police as a panch as the police wanted to collect samples of the R.D.X. seized by them. An officer from the Forensic Science Laboratory and the other panch, Jigar Pandya were also present in the office at that time. They were shown four black coloured sacks, which were in a sealed condition. The said sacks were opened and shown to them. The first sack contained some sticky yellow coloured substance, which according to the officer present there was R.D.X. The second sack contained 10 hand grenades. The third sack contained wires, detonators and a remote control, whereas the fourth sack contained cartridges. Inside the sack, which contained the yellowish substance, there were other bags, from each of which small quantities of the substance was collected as samples. The witness has identified his signature on each of the panch slips attached to the sacks as well as the samples. \n\n18.1. This witness was also cross-examined by the learned Advocate of the accused but he stuck to the version made by him in the examination-in-chief and nothing could be brought out which would be of any help to the defence. \n\n19. The prosecution has thereafter examined and relied upon the oral testimony of P.W. 15, Dilipkumar Rameshchandra Agravat, Exh. 73. He has, inter alia, deposed that he was discharging duties as P.S.I. at the L.C.B. Police Station in the year 2000. Pursuant to the order dated 18-7-2001 of the District Superintendent of Police, further investigation in connection with Nara Police Station I CR No. 2\/01 was entrusted to the L.C.B. whereupon he had taken charge of the investigation. He studied the case papers and became conversant with the investigation carried out by the previous officer. He, thereafter, recorded statements of the concerned witnesses against the accused. As there was sufficient evidence against the accused Kashmirasingh, the said accused was arrested at 19-00 hours on 19-7-2001. He recorded the statement of the accused. He obtained remand of the accused for ten days and made necessary investigation. Thereafter as there was sufficient evidence against the other accused (i) Mamadali Khan Jat, (ii) Ghulamhussain Madhu, (iii) Sodha Sahu Jat, (iv) Janjan Ghaji Hayat, (v) Mallu Kala Jadia and (vi) Meru Pappu Bhil, they were arrested on 29-7-2001, their statements were recorded and they were produced before the Court within the stipulated time-limit. \n\n19.1. Thereafter, the AK 56 rifle and cartridges etc., recovered from the accused Shahnawaz were forwarded to the F.S.L. officer for analysis. Thereafter, on the basis of information it was learnt that when the accused Shahnawaz had come from Pakistan he had brought along with him explosives and related equipment. Thereafter, as the accused Shahnawaz expressed willingness to recover the said articles, two panchas were called and after apprising them of the facts and ascertaining their willingness to act as panchas the preliminary panchnama was drawn at the L.C.B. Office at Bhuj between 21-30 to 21-45 hours on 17-12-2001. Thereafter at the instance of the accused, various articles were recovered and panchnama was drawn accordingly. The articles were sealed in the presence of panchas. The accused and muddamal were brought to Bhuj. As all the muddamal was dangerous and explosive, experts from F.S.L. were called and the seal of the muddamal was opened in the presence of panchas by drawing panchnama. Samples of the muddamal substances were taken out and were sealed and panch slips were attached to the same in the presence of panchas. Thereafter, upon weighing the R.D.X., it was found to weigh 12 Kgs and 700 grams. All the muddamal articles were forwarded to F.S.L., Ahmedabad and detonators were sent to Vadodara Explosive Experts for analysis thereof. \n\n19.2. As sanction for filing charge-sheet against the seven accused arrested earlier was received from the State Government as well as the District Magistrate, charge-sheet was filed. \n\n19.3. The report received from F.S.L., Ahmedabad was kept along with the charge-sheet and was produced at Exhs. 74 to 85. \n\n19.4. Thereafter as he had been transferred, permission to file charge-sheet against the accused Shahnawaz was obtained by Police Inspector, G. H. Vasavada, who had filed the charge-sheet against the said accused. \n\n19.5. This witness was cross-examined by the learned Advocate of the accused and made the suggestion that the muddamal articles i.e., AK 56 rifle and R.D.X. were recovered beneath the heap of sand earlier and the accused is connected with the said muddamal but he has repelled the said suggestion and has stated that the muddamal were discovered at the instance of the accused. He has successfully withstood the test of cross-examination and nothing has been pointed out from the cross-examination which would impeach the credibility of his evidence. \n\nThis is the sum and substance of the evidence of the prosecution witnesses. \n\n20. On re-appraisal of the evidence of the prosecution witnesses, as discussed hereinabove, the following points can be culled out which would lead to the unerring conclusion about the complicity of the accused for commission of the serious crime:\n(i) The accused Shahnawaz, a citizen of Pakistan, was found at Hajipir Dargah without passport and through unauthorised route. \n\n(ii) He was found by P.W. 5, Ramzan Tarmahmad, near Mubarakpir Dargah of Hajipir. The accused asked help from P.W. 5, Ramzan Tarmahmad. The accused was found under suspicious circumstances. \n\n(iii) P.W. 5, Ramzan Tarmahmad, immediately reported to the Police Station about the said accused. \n\n(iv) P.W. 7, Rajpal Hardvarilal Yadav, along with his Police personnel immediately went there on receiving the information and they saw the suspicious individual near Mubarakpir Dargah, Hajipir. \n\n(v) P.W. 7, Rajpal Hardvarilal Yadav, immediately drew the discovery panchnama by calling P.W. 2, Ishaq Ismail, to act as panch, as the accused had shown his willingness to show the muddamal, and in the presence of P.W. 2, Ishaq Ismail, Rs. 20,000 and AK 56 rifle were recovered from the accused. \n\n(vi) P.W. 2, Ishaq Ismail, endorsed the said panchnama about discovery of Rs. 20,000 and AK 56 rifle from the place shown by the accused. \n\n(vii) Thereafter, the accused was sent to Joint Interrogation Centre. \n\n(viii) A complaint was lodged against the accused Shahnawaz as well as other accused persons on 14-7-2001 by P.W. 10, G.A. Parmar. \n\n(ix) During the detention in the Joint Interrogation Centre, the accused showed his willingness to show the place where the rifle and other articles were hidden. \n\n(x) The rifle and other articles were recovered in presence of the panchas by drawing panchnama. \n\n(xi) During the course of investigation, the real name of the accused was revealed that in fact the accused is Shahnawaz Abdulgafur Bhatti, a Pakistani intruder, and a resident of Nalowala, Punjab, Pakistan. \n\n(xii) Under the guidance of Lashkar-e-Toiba at the instance of Azam Chima, the accused and his three accomplices had entered into the Indian territory with explosive substances in huge quantity through unauthorized route by crossing border of Kachchh and had hidden those dangerous and hazardous articles in the desert area of Indian territory, which were subsequently discovered at the instance of the accused by drawing panchnama. \n\n(xiii) The three accomplices who accompanied the accused at the time of crossing the border of Indian territory unauthorizedly have successfully fled through the same route. \n\n(xiv) The attempt on the part of the accused and his three accomplices was to bring the explosive substances and dangerous arms and ammunitions to the Indian territory to terrorise the citizens of India and to hatch conspiracy to wage war against the Government of India. \n\n(xv) The complicity of the accused for commission of the offence of bringing within the territory of India dangerous and hazardous equipments like AK 56 rifle and explosive like R.D.X. has been duly established. \n\n(xvi) The explanation offered by the accused for crossing Indian territory through unauthorized route i.e., through Hajipir at Kachchh for worshipping at Hajipir Dargah is not swallowable. The say of the accused is that he is a poor man and could not afford to come via the legal route. But the fact of recovery of Rs. 20,000\/- from him falsifies the said version of the accused. \n\n21. In view of the aforesaid finding, now the next question which falls for determination of this Court is as to what offence or offences has\/have been committed by the accused Shahnawaz. \n\n22. The accused is mainly charged with the offence of waging or attempting to wage war or abetting waging of war against the Government of India and criminal conspiracy under Sections 121 and 120B I.P.C. He is also charged with the offences punishable under the Arms Act, Foreigners Act, Explosive Substances Act, 1908, Indian Passport Rules, 1959 (Entry into India), Paragraph 3 of the Criminal Law Amendment, 1961, Paragraph 3 of the Indian Foreigners (Report to Police) Orders, 1971 and the Indian Wireless and Telegraphs Act, 1933. \n\n23. To answer the aforesaid question, it would be advantageous to refer to Section 121 of I.P.C., which reads as under:\n 121. Whoever wages war against the Government of India, or attempts to wage such war, or abets the waging of such war, shall be punished with death, or imprisonment for life, and shall also be liable to fine. \n\nTo prove the offence of 'waging war', the prosecution must establish the following:\n(i) that the accused waged war, or attempted to do so, or abetted the same;\n(ii) that such war was against the Government of India. \n\nIt is not incumbent on the accused to show what the object and meaning of the acts done were, but it is the duty of the prosecutors to make out their case against the accused. \n\n24. In the case of Nazir Khan and Ors. v. State of Delhi JT 2003 (Supp. 1) SC 200, the Supreme Court has explained the meaning of the expression \"waging war\" as under:\n The expression \"waging war\" means and can only mean waging war in the manner usual in war. In other words, in order to support a conviction on such a charge it is not enough to show that the persons charged have contrived to obtain possession of an armoury and have, when called upon to surrender it, used the rifles and ammunition so obtained against the Government troops. It must also be shown that the seizure of the armoury was part and parcel of a planned operation and that their intention in resisting the troops of the Government was to overwhelm and defeat these troops and then to go on and crush any further opposition with which they might meet until either the leaders of the movement succeeded in obtaining the possession of the machinery of Government or until those in possession of it yielded to the demands of their leaders. \nIn Paragraph 34 of the said decision, it is further observed by the Apex Court as under:\n The Indian Law Commissioners in their Second Report dated 24-6-1847 had observed \"We conceive the term 'wages war against the Government' naturally to import a person arraying himself in defiance of the Government in like manner and by like means as a foreign enemy would do, and it seems to us, we presume it did to the authors of the Code that any definition of the term so unambiguous would be superfluous\". Mere collection of men, arms and ammunitions does not amount to waging war. \n\nApplying the principles laid down by the Supreme Court in the above referred to judgment as well as the provisions contained in Section 121 of the I.P.C., we are afraid to and it would be difficult to perceive that the acts committed by the accused would fall within the mischief of Section 121 of the I.P.C. According to us, the prosecution has failed to prove the charge levelled against the accused for commission of the offence under Section 121 of I.P.C. \n\n25. A minute scrutiny of the evidence which has been reproduced in the foregoing paragraphs, it is not correct to contend that the accused has waged war, attempted to wage war or abetted to wage war against the Government of India. Therefore, according to us, the conviction recorded against the accused for commission of the offences punishable under Section 121 read with Section 120B I.P.C. cannot be sustained and hence it requires to be quashed and set aside and resultantly the sentence to death imposed on the accused for commission of the said offences also deserves to be quashed and set aside. \n\n26. Now the next question to be determined by this Court is as to whether the conviction of the accused under Section 124A I.P.C. is justified or not? To answer the said question, it would be appropriate to refer to Section 124A I.P.C. which reads as under:\n124A. Whoever by words, either spoken or written, or by signs, or by visible representation, or otherwise, brings or attempts to bring into hatred or contempt, or excites or attempts to excite disaffection towards the Government established by law in India, shall be punished with imprisonment for life, to which fine may be added, or with imprisonment which may extend to three years, to which fine may be added, or with fine. \n\nExplanation 1 : The expression \"disaffection\" includes disloyalty and all feelings of enmity. \n\nExplanation 2 : Comments expressing disapprobation of the measures of the Government with a view to obtain their alteration by lawful means, without exciting or attempting to excite hatred, contempt or disaffection, do not constitute an offence under this Section. \n\nExplanation 3 : Comments expressing disapprobation of the administrative or other action of the Government without exciting or attempting to excite hatred, contempt or disaffection, do not constitute an offence under this Section. \n\n26.1. To prove the charge of commission of offence punishable under Section 124A I.P.C., the prosecution must prove:\n(i) that the accused spoke or wrote the words, or made the signs or representations, or did some other acts, in question;\n(ii) that the accused thereby brought or attempted to bring into hatred or contempt; or excited or attempted to excite disaffection;\n(iii) that such disaffection was towards the Government established by law in India. \n\n26.2. A perusal of the evidence adduced by the prosecution, according to us, does not establish that the accused spoke or wrote the words or made the signs or representations, or did some other acts, or the accused thereby brought or attempted to bring into hatred or contempt; or excited or attempted to excite disaffection; or that such disaffection was towards the Government established by law in India. Therefore conviction and sentence under Section 124A I.P.C. has to be quashed and set aside. \n\n27. It is true that the prosecution has successfully established that the accused being a Pakistani, came to India without passport through unauthorized route with three other accomplices and has brought with him dangerous, lethal and hazardous arms and ammunitions and explosive substances, and hidden them in the heap of sand 12 Kms. away from Hajipir within the territory of India. It is unlikely that a law-abiding citizen would conceal such quantities of explosives in the desert. Stockpiling such a large quantity of explosives in the desert could not have been meant for a bona fide purpose. The explosives are capable of creating havoc if they are used in preparing bombs, as they are capable of mass destruction. In our view considering the fact that the accused is a foreign national who has been found to have unauthorisedly entered the Indian territory without a valid passport, and a huge cache of arms and ammunition have been recovered at his instance, it would be prudent and reasonable to draw inference of criminal conspiracy. Therefore, the said acts of the accused, according to us, amount to conspiracy to commit offence punishable under Section 121A as well as collecting arms, etc., with intention of waging war against the Government of India punishable under Section 122 I.P.C. and also concealing the same with intent to facilitate design to wage war punishable under Section 123 I.P.C. Therefore, in our view, the accused has committed offences punishable under Sections 121A, 122 and 123 I.P.C. \n\n28. So far as the offences committed by the accused under other Acts, such as, Arms Act, Foreigners Act, Explosive Substances Act, Indian Passport Rules, 1959 (Entry into India), Paragraph 3 of the Criminal Law Amendment, 1961, Paragraph 3 of the Indian Foreigners (Report to Police) Orders, 1971 and Sections 3 and 6(1) of the Indian Wireless and Telegraphs Act, 1933, they are duly proved. \n\n29. The net result of the aforesaid discussion is that the conviction and sentence recorded against the accused for commission of the offences punishable under Sections 121 read with Sections 120B and 124A I.P.C. cannot be sustained, and therefore, it has to be quashed and set aside whereas the conviction recorded and sentence imposed by the trial Court against the accused for commission of the offences punishable under Sections 121A, 122 and 123 I.P.C., Sections 25(1)(d), 25(1)(a), 25(1AA) of the Arms Act, Sections 13(2) and 14 of the Foreigners Act, Sections 4(b), 5 and 6 of the Explosive Substances Act, 1908, Rules 3 and 6 of the Indian Passport Rules, 1959 (Entry Into India), Paragraph 3 of the Criminal Law Amendment, 1961, Paragraph 3 of the Indian Foreigners (Report to Police) Orders, 1971 and Sections 3 and 6(1) of the Indian Wireless and Telegraphs Act, 1933 are to be confirmed and maintained. \n\n30. For the foregoing reasons, Criminal Appeal No. 2317 of 2005 filed by the accused succeeds in part and accordingly it is partly allowed. Consequently, conviction recorded against the accused for commission of the offences punishable under Section 121 read with Section 120B I.P.C. and sentence to death is quashed and set aside so also the conviction recorded against the accused for commission of offence punishable under Section 124A I.P.C. is quashed and set aside and the sentence of R.I. for 3 years and fine of Rs. 250\/- i.d., R.I. for 3 months is quashed and set aside and the accused is acquitted of the said offences. Obviously, therefore, Criminal Confirmation Case No. 7 of 2005 has to be dismissed, and accordingly, it is dismissed. \n\n (i) The conviction under Section 121A I.P.C. and sentence to suffer R.I. for life and fine of Rs. 250\/- i.d., R.I. for 3 months, (ii) conviction under Sections 122 and 123 I.P.C. and sentence to suffer R.I. for 10 years and fine of Rs. 250\/- i.d., R.I. for 3 months, (iii) conviction under Sections 25(1)(d), 25(1)(a), 25(1AA) of the Arms Act and sentence to suffer R.I. for 7 years and fine of Rs. 250\/- i.d., R.I. for 3 months, (iv) conviction under Sections 13(2) and 14 of the Foreigners Act and sentence of R.I. for 7 years and fine of Rs. 100\/- i.d., R.I. for 1 month, (v) conviction under Sections 4(b), 5 and 6 of the Explosive Substances Act, 1980 and sentence to suffer R.I. for 10 years and fine of Rs. 250\/- i.d., R.I. for 3 months, (vi) conviction under Rules 3 and 6 of the Indian Passport Rules, 1959 (Entry into India) and sentence to suffer R.I. for 1 year and fine of Rs. 100\/- i.d., R.I. for 1 month and (vii) conviction under Paragraph 3 of the Criminal Law Amendment, 1961, Paragraph 3 of the Indian Foreigners (Report to Police) Orders, 1971 and Sections 3 and 6(1) of the Indian Wireless and Telegraphs Act, 1933, are hereby confirmed and maintained. \nAll the substantive sentences are ordered to run concurrently. \n\nThe ultimate result is that Criminal Confirmation Case No. 7 of 2005 is dismissed and Criminal Appeal No. 2317 of 2005 is partly allowed, as discussed in the foregoing paragraphs of this judgment.",
        "Doc_size":90696,
        "Case_Type":"Criminal",
        "Court_Type":"High_Court",
        "Court_Name_Normalized":"Gujarat High Court"
    },
    {
        "Titles":"State vs Sonu on 12 January, 2010",
        "Court_Name":"Gujarat High Court",
        "Cites":12,
        "Cited_by":2,
        "Doc_url":"https:\/\/indiankanoon.org\/doc\/187011",
        "Text":"Gujarat High Court Case Information System \n\n  \n  \n    \n\n \n \n    \t      \n         \n\t    \n\t\t   Print\n\t\t\t\t          \n\n  \n\n\n\t \n\t \n\t \n\t \n\t \n\t \n\t \n\t\n\n\n \n\n\n\t \n\nCR.A\/125920\/2003\t 19\/ 19\tJUDGMENT \n \n \n\n\t\n\n \n\nIN\nTHE HIGH COURT OF GUJARAT AT AHMEDABAD\n \n\n \n\n\n \n\nCRIMINAL\nAPPEAL No. 1259 of 2003\n \n\nWith\n\n\n \n\nCRIMINAL\nAPPEAL No. 1168 of 2005\n \n\nFor\nApproval and Signature:  \n \nHONOURABLE\nMR.JUSTICE RAVI R.TRIPATHI  \nHONOURABLE\nMR.JUSTICE J.C.UPADHYAYA\n \n \n=========================================================\n\n \n\t  \n\t\t \n\t\t\t \n\n1\n\t\t\n\t\t \n\t\t\t \n\nWhether\n\t\t\tReporters of Local Papers may be allowed to see the judgment ?\n\t\t\n\t\n\n \n\t  \n\t\t \n\t\t\t \n\n2\n\t\t\n\t\t \n\t\t\t \n\nTo be\n\t\t\treferred to the Reporter or not ?\n\t\t\n\t\n\n \n\t  \n\t\t \n\t\t\t \n\n3\n\t\t\n\t\t \n\t\t\t \n\nWhether\n\t\t\ttheir Lordships wish to see the fair copy of the judgment ?\n\t\t\n\t\n\n \n\t  \n\t\t \n\t\t\t \n\n4\n\t\t\n\t\t \n\t\t\t \n\nWhether\n\t\t\tthis case involves a substantial question of law as to the\n\t\t\tinterpretation of the constitution of India, 1950 or any order\n\t\t\tmade thereunder ?\n\t\t\n\t\n\n \n\t  \n\t\t \n\t\t\t \n\n5\n\t\t\n\t\t \n\t\t\t \n\nWhether\n\t\t\tit is to be circulated to the civil judge ?\n\t\t\n\t\n\n \n\n \n=========================================================\n\n \n\nSTATE\nOF GUJARAT - Appellant(s)\n \n\nVersus\n \n\nSONU\n@ GAJENDRASINH DASHRATHSINH SISODIYA - Respondent(s)\n \n\n=========================================================\n \nAppearance\n: \nMR\nDEVANG VYAS ADDL. P.P. for\nAppellant(s) : 1, \nMR BK OZA for Respondent(s) :\n1, \n=========================================================\n\n\n \n\t  \n\t\t \n\t\t\t \n\nCORAM\n\t\t\t: \n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nHONOURABLE\n\t\t\tMR.JUSTICE RAVI R.TRIPATHI\n\t\t\n\t\n\t \n\t\t \n\t\t \n\t\t\t \n\nand\n\t\t\n\t\n\t \n\t\t \n\t\t \n\t\t\t \n\nHONOURABLE\n\t\t\tMR.JUSTICE J.C.UPADHYAYA\n\t\t\n\t\n\n \n\n \n \n\n\n \n\nDate\n: 12\/01\/2010 \n\n \n\n \n \nCOMMON\nORAL JUDGMENT(Per : HONOURABLE MR.JUSTICE J.C.UPADHYAYA) Both these Criminal Appeals arise out of judgment and order rendered by learned Additional Sessions Judge, Fast Track Court, Modasa on 5.7.2003 in Sessions Case No.94 of 2002 whereby the learned trial Judge was pleased to record conviction of original accused, Sonu alias Gajendrasinh Dashrathsinh Sisodiya, who is appellant in Criminal Appeal No.1168 of 2005 and respondent in Criminal Appeal No.1259 of 2003 for commission of offences punishable under Sections 304 Part I, 435, 404 and 201 of the Indian Penal Code ('IPC' for short) and was sentenced to undergo R.I. for 5 years and fine of Rs.500\/- and i.d., S.I. for one month for the offence punishable under Section 304 Part I IPC; R.I. for six months and fine of Rs.500\/- and i.d., S.I. for one month for the offence punishable under Section 435 IPC; R.I. for six months and fine of RS.500 and i.d., S.I. for one month for the offence punishable under Section 404 IPC and R.I. for one year and fine of Rs.500 and i.d., S.I. for one month for the offence punishable under Section 201 IPC and the substantive sentence of imprisonment were ordered to run concurrently. \n\nThe prosecution case as unfolded during the course of trial is that on or about 8.6.2002 accused Sonu alias Gajendrasinh Dashrathsinh Sisodiya was performing his duty as cleaner in truck No.HR 38 G 7348 and deceased Abdulgani Shaikh was the driver of the truck. It is alleged that both the accused and deceased driver Abdulgani belonged to Gaziabad and the truck was owned by one Sunit Yashpal Diwan. On 2.6.2002 the deceased driver Abdulgani along with cleaner, accused Sonu alias Gajendrasinh Dashrathsinh Sisodiya and one second driver Subhanali left Gaziabad for Mumbai carrying goods in the truck. On 4.6.2002 they reached Mumbai and on 6.6.2002 they left Mumbai for coming to Delhi carrying oil barrels in the truck. It is the case of prosecution that when the drivers were at Mumbai some dispute took place and the accused quarrelled with both the drivers i.e., deceased driver Abdulgani and the second driver Subhanali. On account of the quarrel the second driver Subhanali did not join them and he continued to stay at Mumbai. During the night hours of 7.6.2002 the truck driven by deceased Abdulgani wherein the accused was travelling in capacity as cleaner reached near Isrol village on Modasa-Shyamalaji Road. On account of some mechanical defect the truck was required to be stopped. It is the prosecution case that during night hours the deceased driver Abdulgani intended to cause unnatural act with the accused Sonu. It is further case of the prosecution that at the time of the incident deceased driver Abdulgani had cash amount of Rs.18,000\/- With a view to rob the amount and keeping grudge in mind, the accused allegedly inflicted a blow with tommy on the head of the deceased who at the relevant time was sleeping on the roof top of a container in the truck. The accused thereafter set the truck to fire and took the cash amount from the truck and ran away. During early morning of 8.6.2002 it was noticed that the truck was on fire and therefore police was called who in turn called fire brigade. The fire was extinguished and it was found that the dead body of deceased driver Abdulgani was lying on the roof top of a container in the truck. The contact number of the owner of the truck was painted on the body of the truck and the owner of the truck i.e., P.W.14, Sunit Yashpal Diwan, was contacted. Upon receipt of the information Sunit Yashpal Diwan reached the place of the incident. The incident was reported to Modasa Rural Police Station by PSI Mr.Dixit and his FIR was registered. During the course of investigation, statements of material witnesses were recored. On 13.6.2002 the accused came to be arrested. The accused in presence of panchas and police officers discovered the muddamal weapon tommy and from his possession cash amount to the tune of Rs.8,700\/-, one shirt and a pair of shoes were recovered. After collecting required material for the purpose of lodgment of charge sheet the charge sheet came to be filed in the Court of learned JMFC, Modasa for commission of offences punishable under Sections 302, 435, 404 and 201 IPC. Since the offences were exclusively triable by the Court of Sessions, the learned JMFC, Modasa committed the case to the Court of Sessions at Modasa which was registered as Sessions Case No.94 of 2002. \n\nThe learned trial Judge framed charge against the accused at Ex.1 for the commission of offences punishable under Sections 302, 435, 404 and 201 IPC to which the accused pleaded not guilty and claimed to be tried and thereupon the prosecution examined witnesses and adduced oral as well as documentary evidence. After the prosecution concluded its oral evidence, the trial Court recorded further statement of the accused under Section 313 of the Code of Criminal Procedure ('Cr.PC' for short) and the accused in his further statement denied generally all the incriminating circumstances put to him by the trial Court and stated that he was falsely implicated in this case and that the cash amount and the cloth seized from him belonged to his father. \n\nThe trial Court after appreciating the evidence on record and the submissions made on behalf of both the sides ultimately came to the conclusion that the prosecution has successfully proved the involvement of the accused in the incident. However, the trial Court recorded acquittal of the accused for the offence of murder punishable under Section 302 IPC but recorded his conviction for the offence of culpable homicide not amounting to murder punishable under Section 304 Part I IPC together with other offences punishable under Sections 435, 404 and 201 of IPC and awarded sentence as herein above referred to in this judgment. \n\nFeeling aggrieved by and dissatisfied with the order of acquittal recorded by the trial Court for the offence punishable under Section 302 IPC, the State of Gujarat preferred Criminal Appeal No.1259 of 2003 under section 378 (1)(3) of the Cr.P.C. The accused in turn challenged his conviction by preferring Criminal Appeal No.1168 of 2005 under Section 374 of the Cr.P.C. \n\nHeard learned advocate Mr. B.K. Oza for the original accused (appellant in Criminal Appeal No.1168 of 2005 and respondent in Criminal Appeal No.1259 of 2003) and learned Addl. P.P. Mr. Devang Vyas for the State of Gujarat. \n\nLearned advocate Mr. Oza for the accused submitted that the prosecution case rests solely upon circumstantial evidence. The circumstances relied upon by the trial Court are not such which can be considered to be sufficient for the purpose of recording the conviction of the accused. The circumstantial evidence relied upon by the trial court cannot be said to have been duly proved. The theory of the deceased having last seen together with the accused cannot be accepted for the simple reason that when the witnesses reached the place of the incident the accused was not found there in the truck. That the prosecution failed to prove beyond reasonable doubt the recovery of tommy and cash amount from the accused. Therefore it is submitted that the appeal preferred by the accused be allowed. \n\nAbout the State appeal, learned advocate Mr. Oza submitted that though the accused deserves acquittal, so far as the appeal preferred by the State of Gujarat is concerned, the trial Court rightly came to the conclusion that the offence which can be said to have been constituted in this case is not murder but culpable homicide not amounting to murder. The medical evidence reveals that this is a case of solitary blow. The accused had ample opportunity to inflict more blows. If the prosecution evidence as it is considered the deceased driver demanded unnatural act which provided grave and sudden provocation to the accused. It is further submitted that the accused had already served out the sentence and he is not now in jail. Therefore it is submitted that the appeal preferred by the State of Gujarat under Section 378 of the Cr.P.C. may be dismissed. \n\nPer contra, the learned Addl. P.P. Mr. Vyas vehemently opposed the appeal preferred by the accused and submitted that the trial Court has rightly recorded conviction of the accused as the prosecution has successfully proved chain of circumstantial evidence. The trial Court has rightly appreciated the evidence on record. The circumstances are strong enough to record the conviction of the accused. \n\nThe learned Addl.P.P. for the State of Gujarat submitted that however the trial Court has erred in recording acquittal of the accused of the offence of murder punishable under Section 302 IPC. The medical evidence reveals that though there was a solitary injury the injury was on vital part of the body i,.e., head and that brain matter had come out from the wound. That the medical evidence suggests that the injury was sufficient in ordinary course of nature to cause death. Therefore it is submitted that the trial Court should have recorded the conviction of the accused for the offence of murder punishable under Section 302 IPC. Ultimately it is submitted that the appeal preferred by the State of Gujarat under Section 378 of the Cr.P.C. may be allowed. \n\nWe have examined the record and proceedings in context with the submissions made by the rival sides. \n\nAfter appreciating and reanalysing the evidence on record it clearly transpires that the prosecution case solely rests upon the circumstantial evidence. It further transpires that the circumstances relied upon by the prosecution are (i) the accused having been last seen together in the company of the deceased, (ii) soon after the incident the accused who was serving in the truck as cleaner left the truck and was absconding, (iii) the accused came to be apprehended on 13.6.2002 and in presence of panchas the accused discovered the muddamal weapon tommy which was used in commission of the offence and that from the search of his person the amount of booty i.e., cash amount of Rs.8,700\/- came to be seized and (iv) strong motive available to the accused to cause death of the deceased. \n\nWe have gone through the evidence of all 19 witnesses examined by the prosecution but it transpires that the evidence of P.W.14, Sunit Yashpal Diwan recorded at Ex.34, bears importance. He is the owner of the truck. Considering his evidence it clearly transpires that the truck bearing No.HR 38 G 7348 belonged to him and in the truck deceased Abdulgani was employed as a driver and the accused Sonu was employed as cleaner. According to his evidence, on 2.6.2002 both the deceased driver Abdulgani and the cleaner accused Sonu and the second driver Subhanali left Gaziabad for Mumbai carrying goods in the truck. On 4.6.2002 they reached Mumbai and the goods were unloaded from the truck. According to his version, he received a telephone call from his driver Abdulgani from Mumbai that he had received Rs.18,000\/- by way of freight charges. However, he informed that the cleaner accused Sonu was quarrelling with him and the second driver Subhanali. Thereafter because of the quarrel the second driver Subhanali stayed in Mumbai but on 6.6.2002 carrying oil barrels in the truck, driver Abdulgani and the accused left Mumbai for Gaziabad. It has come in evidence that during the night falling between 7.6.2002 and 8.6.2002 when the truck reached near village Isrol on Modasa-Shyamalaji Road, because of some mechanical defect the truck was parked on the road. \n\nIt is further pertinent to note that considering the evidence of the son of deceased driver Abdulgani i.e., P.W.18, Shahalam Abdulgani, he deposed that the deceased was his father and was employed as driver in the truck. According to his evidence, from Mumbai his deceased father along with the accused Sonu left for Gaziabad. \n\nThus considering the evidence of the owner of the truck i.e., P.W.14, Sunit Yashpal Diwan and the son of deceased i.e., P.W.18, Shahalam Abdulgani it is clear that the deceased was employed as driver and accused was employed as cleaner in the truck owned by Sunit Yashpal Diwan. It has further become clear that from Mumbai they both left for Gaziabad in the truck. Under such circumstances, we are of the considered opinion that the trial Court rightly came to the conclusion that it was the accused who accompanied the deceased at the time when the incident occurred. It is further pertinent to note that the evidence further reveals that soon after the incident the accused was not found near the truck. The truck was set to fire by him. He was found absconding and he could be arrested only after about a week on 13.6.2002. It is further pertinent to note that in the further statement recorded under Section 313 of the Cr.P.C., he nowhere explains his absconding, or nowhere explains as to how the incident took place. It is further pertinent to note that considering Section 106 of the Evidence Act, it is clearly provided that when any fact is especially within the knowledge of any person, the burden of proving that fact is upon him. In the instant case, even in further statement recorded under Section 313 of the Cr.P.C., no explanation is forthcoming from the part of the accused about the incident or about his absconding. \n\nEvaluating the evidence on record and especially considering the evidence of the owner of the truck i.e,. Sunit Yashpal Diwan, it clearly transpires that before leaving Mumbai the accused had quarrelled with the deceased. Moreover, the accused was knowing that the deceased had received a sum of Rs.18,000\/- by way of freight charges of the truck. Because of the quarrel the second driver i.e., Subhanali did not think it fit to travel in the truck and he continued to stay in Mumbai. When such is the situation we are of the considered opinion that the prosecution has proved the motive in the instant case. \n\nHowever, the prosecution attempted to adduce the evidence regarding alleged extra judicial confession made by the accused before the owner of the truck i.e., P.W.14, Sunit Yashpal Diwan. On this count if the evidence of P.W.14, Sunit Yashpal Diwan is appreciated, it transpires that the extra judicial confession was made by the accused in the police station in presence of police officers. When such is the situation it cannot be said that the prosecution has successfully proved the circumstance i.e., the extra judicial confession allegedly made by the accused before the owner of the truck. Needless to say that the evidence in the form of extra judicial confession is otherwise a very weak evidence. Even if in this case the evidence regarding extra judicial confession is not at all taken into consideration, as stated above, the prosecution has adduced cogent and convincing evidence regarding the accused having been last seen together in the company of the deceased, about his act of absconding soon after the incident and also about the strong motive available to the accused to kill the deceased. \n\nMoreover, the evidence reveals that in presence of panch P.W.3, Bharatkumar Mohanbhai, the accused discovered the muddamal weapon, tommy, vide discovery panchnama Ex.11. Even the Investigating Officer, P.W.19, PSI Dixit supports this part of the evidence. Moreover, the evidence further reveals that from the possession of the accused an amount of Rs.8,700\/- came to be recovered. No satisfactory explanation is forthcoming about the cash amount recovered from the accused. \n\nExamining the medical evidence on record and especially the evidence of P.W.6, Dr. Patel it clearly transpires that according to his evidence the solitary injury found on the left side of the head of the deceased was possible by the muddamal weapon tommy discovered by the accused. \n\nThus we are of the considered opinion that the prosecution successfully proved the chain of circumstantial evidence. The chain is well established. The trial Court therefore rightly recorded the conviction of the accused and his involvement in the incident. \n\nHowever, Learned Addl. P.P. Mr. Vyas for the State of Gujarat submitted That the trial Court has erred in recording the acquittal of the accused for the offence of murder punishable under Section 302 IPC. It is submitted that the medical evidence reveals that though the accused inflicted solitary blow on the head of the deceased, at the time of the incident the deceased was sleeping and the injury on head sustained by the deceased was very serious as brain matter had come out from the wound. Therefore it is submitted that the appeal preferred by the State of Gujarat be allowed and the conviction of the accused may be recorded for the offence of murder punishable under Section 302 IPC. \n\nWe have given our thoughtful consideration to the submissions made by the learned Addl. P.P. Mr. Vyas. Examining medical evidence on record it becomes clear that the deceased sustained solitary injury above the left eye on frontal region on his head. The injury resulted into fracture of frontal bone and at the time of post mortem brain matter was found in the wound. The cause of death is opined to be shock due to intra-cranial injury. \n\nWe have carefully examined the evidence of medical officer Dr. Patel and post mortem report Ex.20. Appreciating the evidence on record, the trial Court came to the conclusion that the offence which can be said to have been constituted is culpable homicide not amounting to murder and not murder. There is no dispute that the deceased sustained a solitary blow. It has come in evidence that at the time of the incident except the deceased and the accused, nobody was present. Nothing emerges from record that the deceased offered any resistance. In such circumstances there was sufficient opportunity to the accused to inflict more blows. According to the prosecution case the accused inflicted only solitary blow with tommy on the person of the deceased and thereafter he left the truck. The subsequent act of setting the truck to fire cannot be linked with the cause of death because there is no medical evidence on record to come to the conclusion that the deceased had sustained any burn injuries. We have examined the judgment rendered by the trial Court and the trial Court in paragraph 30 of the judgment elaborately discussed this aspect of the matter and then came to the conclusion that considering the medical evidence on record and the facts and the circumstances under which the incident took place, the offence which can be said to have been constituted is culpable homicide not amounting to murder punishable under Section 304 Part I IPC and not murder punishable under Section 302 IPC. We do not find any illegality or infirmity in the judgment rendered by the trial Court while recording acquittal of the accused for the offence of murder and while recording conviction of the accused for the offence punishable under Section 304 Part I IPC. We do not find any need to interfere with the findings arrived at by the trial Court and the ultimate conclusion in the impugned judgment. \n\nIn the result, we are of the considered opinion that both the appeals are devoid of any merits and deserve dismissal. \n\nFor the foregoing reasons, Criminal Appeal No.1259 of 2003 and Criminal Appeal No.1168 of 2005 stand dismissed. \n\n(Ravi R. Tripathi, J.) (J.C. \n\nUpadhyaya, J.) ... \n\n(karan) Top",
        "Doc_size":21070,
        "Case_Type":"Criminal",
        "Court_Type":"High_Court",
        "Court_Name_Normalized":"Gujarat High Court"
    },
    {
        "Titles":"Rabari Sagarbhai Ganeshbhai vs State Of Gujarat & on 27 February, 2013",
        "Court_Name":"Gujarat High Court",
        "Cites":16,
        "Cited_by":2,
        "Doc_url":"https:\/\/indiankanoon.org\/doc\/98745554",
        "Text":"RABARI SAGARBHAI GANESHBHAIV\/SSTATE OF GUJARAT\n\t \n\t \n\t \n\t \n\t \n\t \n\t \n\t \n\t \n\t \n\t\n\n \n \n\n\n\t \n\n\n\tR\/SCR.A\/3622\/2012\n\t                                                                    \n\t                           JUDGMENT\n\n \n\n \n\n\n \n\t  \n\t  \n\t\t \n\t\t\t \n\nIN\n\t\t\tTHE HIGH COURT OF GUJARAT AT AHMEDABAD\n\t\t\n\t\n\n \n\n\n \n\n\n \n\n\nSPECIAL CRIMINAL\nAPPLICATION  NO. 3622 of 2012\n \n\n\n \n\n\n \n\n \n\n \n\nFOR\nAPPROVAL AND SIGNATURE: \n\n \n\n  \n\n \n\nHONOURABLE\nMR.JUSTICE R.M.CHHAYA   Sd\/-\n \n\n \n\n \n\n================================================================\n \n\n \n\n\n \n\t  \n\t \n\t \n\t  \n\t\t \n\t\t\t \n\n1    \n\t\t\t\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nWhether\n\t\t\tReporters of Local Papers may be allowed to see the judgment ?\n\t\t\t \n\n \n\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nNO\n\t\t\n\t\n\t \n\t\t \n\t\t\t \n\n2    \n\t\t\t\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nTo\n\t\t\tbe referred to the Reporter or not ?\n\t\t\t \n\n \n\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nNO\n\t\t\n\t\n\t \n\t\t \n\t\t\t \n\n3    \n\t\t\t\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nWhether\n\t\t\ttheir Lordships wish to see the fair copy of the judgment ?\n\t\t\t \n\n \n\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nNO\n\t\t\n\t\n\t \n\t\t \n\t\t\t \n\n4    \n\t\t\t\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nWhether\n\t\t\tthis case involves a substantial question of law as to the\n\t\t\tinterpretation of the constitution of India, 1950 or any order\n\t\t\tmade thereunder ?\n\t\t\t \n\n \n\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nNO\n\t\t\n\t\n\t \n\t\t \n\t\t\t \n\n5    \n\t\t\t\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nWhether\n\t\t\tit is to be circulated to the civil judge ?\n\t\t\t \n\n \n\n\t\t\t\n\t\t\n\t\t \n\t\t\t \n\nNO\n\t\t\n\t\n\n \n\n================================================================\n \n\n\nRABARI SAGARBHAI GANESHBHAI\n &  1....Applicant(s)\n \n\n\nVersus\n \n\n\nSTATE OF GUJARAT  & \n3....Respondent(s)\n \n\n================================================================\n \n\nAppearance:\n \n\nMR\nPREMAL NANAVATY WITH MR BS KHATANA, ADVOCATE for the Applicant(s) No.\n1 - 2\n \n\nMR\nABHAYKUMAR P SHAH, ADVOCATE for the Respondent(s) No. 2 - 4\n \n\nMS\nMOXA THAKKAR, APP.  for the Respondent(s) No. 1\n \n\nRULE\nNOT RECD BACK for the Respondent(s) No. 3\n \n\nRULE\nSERVED for the Respondent(s) No. 2 , 4\n \n\n================================================================\n \n\n \n\n\n \n\n\n\t \n\t\t  \n\t\t \n\t\t  \n\t\t\t \n\t\t\t\t \n\nCORAM:\n\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t \n\t\t\t\t \n\nHONOURABLE\n\t\t\t\tMR.JUSTICE R.M.CHHAYA\n\t\t\t\n\t\t\n\t\n\n \n\n\n Date : 27\/02\/2013\n \n\n\n ORAL JUDGMENT1. Heard Mr. Premal Nanavaty, learned Counsel with Mr. B.S. Khatana for the petitioners, Mr. Abhaykumar P. Shah, learned Advocate for respondent nos. 2 to 4 and Ms. Moxa Thakkar, learned APP. for respondent No.1- State. \n\n2. By way of this petition under Article 226 of the Constitution of India r\/w section 482 of the Code of Criminal Procedure,1973 (hereinafter referred to as the Code for the sake of brevity) the petitioner original accused have prayed for quashing and setting aside the impugned FIR lodged by respondent nos. 2 to 4 being FIR\/M. Case No. 1 of 2011 registered with Vithalapur Police Station for the alleged offences u\/Ss. 406, 420, 467, 468, 465, 466 r\/w 409 of Indian Penal Code (hereinafter referred to as IPC ). The relevant facts arising out of this petition are as under. \n\n3. That respondent nos. 2 to 4 filed an application being Inquiry Case No. 38 of 2011 before the Court of JMFC, Viramgam interalia praying for passing the order u\/s. 156(3) of the Code. It is a matter on record that JMFC, Viramgam passed an order of investigation by Police Inspector, Vithalpur Police Station u\/s. 156(3) of the Code against the present petitioner and the accused persons and the same came to be registered as FIR\/M. Case No. 1 of 2011. \n\n4. The allegation made by the complainants is in relation to land bearing block no. 55\/1 part admeasuring 60703 sq. mtrs. situated at village Udhrojpura, Taluka Mandal, district Ahmedabad. It appears from the record that the land in question originally belonged to Ukardi Ganotia Sahkari Kheti & Gopalak Mandali Limited. It is alleged in the complaint that on the basis of the resolution passed by the Members of the Society dated 8.8.2005 and after taking due approval from the Society, the land in question came to be transferred by sale-deed dated 8.1.2007 for consideration of Rs.3.65 lacs. It is further alleged that on the basis of the same the original complainants i.e. respondent nos. 2 to 4 are owners and occupiers of the said land. It is further alleged in the impugned complaint that petitioner no.1 in his capacity as President of the said Society once again sold the very land in question to petitioner no.2 for a total consideration of Rs. 4.90 lacs and executed a sale-deed in favour of petitioner no.2 which came to be registered at Sr.No.1249 in the Sub-Registrar office dated 6.4.2010. On these factual matrix it is alleged in the complaint that the petitioners have committed offences as alleged in the complaint. \n It is matter of record of the petition that the petitioner had applied for anticipatory bail and the bail was granted by the Sessions Court and even the application for cancellation of bail being Criminal Misc. Application No. 887 of 2007 came to be disposed of by the Court (Coram : Hon ble Ms. Justice Sonia Gokani) vide order dated 30.3.2012 wherein the present petitioner no.1, i.e. respondent no. 2 in the said application was directed not to function as Chairman of the Society. \n\n Mr. \n\n Nanavaty, learned Counsel for the petitioners has contended that as such the earlier transaction was illegal and without any force of law. Mr. Nanavaty further submitted that the parties have amicably resolved the dispute and the original complainants and the society have executed a deed of cancellation dated 8.1.2007. The said deed of cancellation has also been duly registered with the Registrar of Documents on 18.6.2012. Mr. Nanavaty further contended that in view of the settlement arrived at between the parties any further continuance of criminal proceedings in pursuance to the impugned FIR\/M Case would result into great harassment to the parties. Mr. Nanavaty further pointed out that in view of the fact that the petitioners and the complainants have resolved the issue, the trial shall be futile and any further proceedings in pursuance to the impugned FIR\/M. Case would amount to abuse of process of Court and law and therefore it is a fit case to exercise jurisdiction u\/s. 482 of the Code, in order to secure the ends of justice. Mr. Nanavaty further pointed out that in fact all the three complainants have also filed affidavit dated 9.1.2013 before this Court. Mr. Nanavaty therefore prayed that this Court may allow this application as prayed for. \n 7. Ms. \n\n Moxa Thakkar, learned APP. has candidly submitted that in view of the facts and circumstances and more particularly considering the fact that the parties have resolved the dispute this Court may pass appropriate order. \n\n 8. Mr. \n\n Shah, learned Advocate for respondent nos.2 to 4 the original complainants, reiterated the contentions raised by Mr. Nanavaty for the applicants. \n\n 9. It may be noted that this Court (Coram : Hon ble Mr. Justice K. M.Thaker) vide order dated 9.1.2013 has passed the following order:\n 1. Heard Mr.Nanavati, learned advocate for the applicants. \n\n2. In present application, the applicants have prayed that:\n 17(A) By issuing an appropriate writ, order or direction, Your Lordships may be pleased to quash and set aside the impugned FIR lodged by respondent nos.2 to 4 herein being M. Case No.1\/2011 lodged with Vithalapur Police Station which is at Annexure-A to this petition. \n\n3. The alleged offence for which the impugned FIR is filed, is punishable under sections 406, 420, 467, 468, 465, 466 and 409 of the Indian Penal Code. \n4. Mr.Abhaykumar P. Shah, learned advocate has appeared and submitted that he has received instructions to appear for respondent Nos.2 to\n4. He has also submitted that he will enter his appearance for the said respondents today. \n\n5. Mr.Nanavati, learned advocate for the applicants has submitted that dispute between the parties is settled inasmuch as the second deed, which was executed by the applicants, has been cancelled and that, therefore, original deed, which was executed with the complainant, is restored and that is how dispute between the parties has come to an end. He has also submitted that since dispute is settled, it would be futile to continue the proceedings in connection with the impugned FIR. The parties have jointly requested that the impugned FIR and proceedings pursuant thereto may be quashed. \n\n6. Therefore, below mentioned order is passed. \n\n7. RULE. \n\n8. It would be open to the learned advocates to request the Hon ble Court to fix the date for early final hearing of the application. \n10. On perusal of the affidavits filed by the original complainants it is found that the parties have amicably resolved the dispute due to intervention of common friends and relatives and the fact that the original complainants have also executed a deed of cancellation as observed hereinabove as pointed out in the affidavits so filed. \n\n11. At this juncture it would be advantageous to refer to the judgment of the Apex Court in the case of Gian Singh Vs. State (2012) 10 SCC 303 wherein the Hon ble Apex Court has observed as under:\n 56. It needs no emphasis that exercise of inherent power by the High Court would entirely depend on the facts and circumstances of each case. It is neither permissible nor proper for the court to provide a straitjacket formula regulating the exercise of inherent powers under Section 482. No precise and inflexible guidelines can also be provided. \n 57. Quashing of offence or criminal proceedings on the ground of settlement between an offender and victim is not the same thing as compounding of offence. They are different and not interchangeable. Strictly speaking, the power of compounding of offences given to a court under Section 320 is materially different from the quashing of criminal proceedings by the High Court in exercise of its inherent jurisdiction. In compounding of offences, power of a criminal court is circumscribed by the provisions contained in Section 320 and the court is guided solely and squarely thereby while, on the other hand, the formation of opinion by the High Court for quashing a criminal offence or criminal proceeding or criminal complaint is guided by the material on record as to whether the ends of justice would justify such exercise of power although the ultimate consequence may be acquittal or dismissal of indictment. \n\n 58. Where High Court quashes a criminal proceeding having regard to the fact that dispute between the offender and victim has been settled although offences are not compoundable, it does so as in its opinion, continuation of criminal proceedings will be an exercise in futility and justice in the case demands that the dispute between the parties is put to an end and peace is restored; securing the ends of justice being the ultimate guiding factor. No doubt, crimes are acts which have harmful effect on the public and consist in wrong doing that seriously endangers and threatens well-being of society and it is not safe to leave the crime-doer only because he and the victim have settled the dispute amicably or that the victim has been paid compensation, yet certain crimes have been made compoundable in law, with or without permission of the Court. In respect of serious offences like murder, rape, dacoity, etc; or other offences of mental depravity under IPC or offences of moral turpitude under special statutes, like Prevention of Corruption Act or the offences committed by public servants while working in that capacity, the settlement between offender and victim can have no legal sanction at all. However, certain offences which overwhelmingly and predominantly bear civil flavour having arisen out of civil, mercantile, commercial, financial, partnership or such like transactions or the offences arising out of matrimony, particularly relating to dowry, etc. or the family dispute, where the wrong is basically to victim and the offender and victim have settled all disputes between them amicably, irrespective of the fact that such offences have not been made compoundable, the High Court may within the framework of its inherent power, quash the criminal proceeding or criminal complaint or F.I.R if it is satisfied that on the face of such settlement, there is hardly any likelihood of offender being convicted and by not quashing the criminal proceedings, justice shall be casualty and ends of justice shall be defeated. The above list is illustrative and not exhaustive. Each case will depend on its own facts and no hard and fast category can be prescribed. \t\n\n \n\n\n \n\n\n \n\t \n\n\n\t\n\t \n\n\n\t          xxx\n\t      xxx      xxx\n\t \n\n\n\t\n\t \n\n\n\t61. The\n position that emerges from the above discussion can be summarised thus: the power of the High Court in quashing a criminal proceeding or FIR or complaint in exercise of its inherent jurisdiction is distinct and different from the power given to a criminal court for compounding the offences under Section 320 of the Code. Inherent power is of wide plenitude with no statutory limitation but it has to be exercised in accord with the guideline engrafted in such power viz; (i) to secure the ends of justice or (ii) to prevent abuse of the process of any Court. In what cases power to quash the criminal proceeding or complaint or F.I.R may be exercised where the offender and victim have settled their dispute would depend on the facts and circumstances of each case and no category can be prescribed. However, before exercise of such power, the High Court must have due regard to the nature and gravity of the crime. Heinous and serious offences of mental depravity or offences like murder, rape, dacoity, etc. cannot be fittingly quashed even though the victim or victim s family and the offender have settled the dispute. Such offences are not private in nature and have serious impact on society. Similarly, any compromise between the victim and offender in relation to the offences under special statutes like Prevention of Corruption Act or the offences committed by public servants while working in that capacity etc; cannot provide for any basis for quashing criminal proceedings involving such offences. But the criminal cases having overwhelmingly and pre-dominatingly civil flavour stand on different footing for the purposes of quashing, particularly the offences arising from commercial, financial, mercantile, civil, partnership or such like transactions or the offences arising out of matrimony relating to dowry, etc. or the family disputes where the wrong is basically private or personal in nature and the parties have resolved their entire dispute. In this category of cases, High Court may quash criminal proceedings if in its view, because of the compromise between the offender and victim, the possibility of conviction is remote and bleak and continuation of criminal case would put accused to great oppression and prejudice and extreme injustice would be caused to him by not quashing the criminal case despite full and complete settlement and compromise with the victim. In other words, the High Court must consider whether it would be unfair or contrary to the interest of justice to continue with the criminal proceeding or continuation of the criminal proceeding would tantamount to abuse of process of law despite settlement and compromise between the victim and wrongdoer and whether to secure the ends of justice, it is appropriate that criminal case is put to an end and if the answer to the above question(s) is in affirmative, the High Court shall be well within its jurisdiction to quash the criminal proceeding. \n12. The Hon ble Apex Court in the case of Jayrajsinh Digvijaysinh Rana Vs. State of Gujarat & Anr. \n\nreported in 2013(1) GLR 65 wherein the Hon ble Apex Court has observed thus :\n 8) The above question was recently considered by this Court in Shiji @ Pappu & Ors. vs. Radhika & Anr. (2011) 10 SCC 705. The question posed in that case was \"Whether the criminal proceedings in question could be quashed in the facts and circumstances of the case having regard to the settlement that the parties had arrived at.\" After adverting to Section 482 of the Code and various decisions, this Court concluded as under:\n\"17. It is manifest that simply because an offence is not compoundable under Section 320 Cr.P.C. is by itself no reason for the High Court to refuse exercise of its power under Section 482 Cr.P.C. That power can in our opinion be exercised in cases where there is no chance of recording a conviction against the accused and the entire exercise of a trial is destined to be an exercise in futility. There is a subtle distinction between compounding of offences by the parties before the trial court or in appeal on the one hand, and the exercise of power by the High Court to quash the prosecution under Section 482 Cr.P.C. on the other. While a court trying an accused or hearing an appeal against conviction, may not be competent to permit compounding of an offence based on a settlement arrived at between the parties in cases where the offences are not compoundable under Section 320, the High Court may quash the prosecution even in cases where the offences with which the accused stand charged are non-compoundable. The inherent powers of the High Court under Section 482 CrPC are not for that purpose controlled by Section 320 Cr.P.C. \n\n18. Having said so, we must hasten to add that the plenitude of the power under Section 482 Cr.P.C. by itself, makes it obligatory for the High Court to exercise the same with utmost care and caution. The width and the nature of the power itself demands that its exercise is sparing and only in cases where the High Court is, for reasons to be recorded, of the clear view that continuance of the prosecution would be nothing but an abuse of the process of law. It is neither necessary nor proper for us to enumerate the situations in which the exercise of power under Section 482 may be justified. All that we need to say is that the exercise of power must be for securing the ends of justice and only in cases where refusal to exercise that power may result in the abuse of the process of law. The High Court may be justified in declining interference if it is called upon to appreciate evidence for it cannot assume the role of an appellate court while dealing with a petition under Section 482 of the Criminal Procedure Code. Subject to the above, the High Court will have to consider the facts and circumstances of each case to determine whether it is a fit case in which the inherent powers may be invoked.\" \n\n9) On going through the factual details, earlier decision, various offences under Section 320 of the Code and invocation of Section 482 of the Code, we fully concur with the said conclusion. In the case on hand, irrespective of the earlier dispute between Respondent No.2-the complainant and the appellant being Accused No.3 as well as Accused Nos.1 and 2 subsequently and after getting all the materials, relevant details etc., the present appellant (Accused No. 3) sworn an affidavit with bona fide intention securing the right, title and interest in favour of Respondent No.2 herein-the Complainant. In such bona fide circumstances, the power under Section 482 may be exercised. Further, in view of the settlement arrived at between Respondent No. 2-the complainant and the appellant (Accused No. 3), there is no chance of recording a conviction insofar as the present appellant is concerned and the entire exercise of trial is destined to be an exercise in futility. Inasmuch as the matter has not reached the stage of trial, we are of the view that the High Court, by exercising the inherent power under Section 482 of the Code even in offences which are not compoundable under Section 320, may quash the prosecution. However, as observed in Shiji [2011(10)SCC 705 : AIR 2012 SC 499], the power under Section 482 has to be exercised sparingly and only in cases where the High Court is, for reasons to be recorded, of the clear view that continuance of the prosecution would be nothing, but an abuse of the process of law. In other words, the exercise of power must be for securing the ends of justice and only in cases where refusal to exercise that power may result in the abuse of the process of law. \n 13. Having heard the learned Advocates appearing on behalf of the respective parties and considering the facts and circumstances arising out of the present petition as well as considering the ratio of the decision rendered in the case of Dimpey Gujaral & Ors. Vs. Union Territory, Through Administrator, U.T.Chandigarh and Ors., reported in AIR 2013 SC 518, Jayrajsinh Digvijaysinh Rana Vs. State of Gujarat & Anr. \n\n reported in 2013(1) GLR 65 and Gian Singh Vs. State of Punjab, reported in (2012) 10 SCC 303, Madan Mohan Abbot Vs. State of Punjab, reported in 2008(4) SCC 582, Nikhil Merchant Vs. Central Bureau of Investigation & Anr., reported in 2009(1) GLH 31 as well as in the case of Manoj Sharma Vs. State & Ors., 2009(1) GLH 190, it appears that further continuation of criminal proceedings in relation to the impugned FIR against the petitioners-original accused would be unnecessary harassment to the petitioners and would amount to abuse of process of law and Court and the trial would be futile. \n\n14. For the reasons stated hereinabove, the present petition is allowed. Impugned complaint being FIR\/M Case No. 1 of 2011 registered with Vithalpur Police Station for the alleged offences punishable u\/Ss. 406, 420, 467, 468, 465, 466 r\/w 409 as well as proceedings of Criminal Inquiry Case No. 38 of 2011 pending before the Court of JMFC, Viramgam and all other consequential proceedings arising out of the aforesaid FIR\/M Case are hereby quashed and set aside. \n\n 15. Rule is made absolute to the aforesaid extent. Direct service permitted. \n\n Sd\/-\n(R.M.CHHAYA, J.) M.M.BHATT Page of 16",
        "Doc_size":21749,
        "Case_Type":"Criminal",
        "Court_Type":"High_Court",
        "Court_Name_Normalized":"Gujarat High Court"
    }
]